{
   "type": "FeatureCollection",
   "features": [
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.45,1.4 ]
    },
    "properties": {
    "Species":"Alangium Ridleyi King",
    "Kolektor":"Arifin, Z & Suharja, I",
    "Description":"Trees up to 25 (-40) m tall, 25-45 cm in diameter, often with flat and curved stilt-roots. Internodes between adult leaves 1.8-7.5 cm long, 3-9 mm thick, glabrous. Petioles 1.5-4 cm long, glabrous. Leaves obovate-oblong, 8-40 cm long, 5-20 cm wide, leathery, glabrous, base rounded to wedge-shaped, apex more or less acuminate, secondary veins 10-18 pairs, pinnately arranged. Inflorescences glabrous, 6-15-flowered. Flowers 6-merous, 1.8-2.7 cm long, calyx glabrous, petals glabrous outside, pilose inside, stamens with bearded filament apex, style pilose on longitudinal stripes, stigma conical, ovary 1-celled. Fruits in dry state ovate, flattened, rounded or slightly acute at base, more acute towards the apex, 2.7-3.7 cm long, 1.8-2.2 cm in diameter, usually glabrous, and with 10-14 rounded ribs and deep grooves between them (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"tree",
    "Ecology":"Usually hill side on low undulating country.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Cornaceae-Alangium%20ridleyi-AA3723%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 112.5333333,1.3 ]
    },
    "properties": {
    "Species":"Anisoptera Costata Korth.",
    "Kolektor":"G. Argent & P. Wilkie",
    "Description":"Trees up to 65 m tall, up to 1.7 m diameter, bole straight, cylindrical, buttresses few, up to 4 m tall, up to 2.5 m long, thick, rounded, straight, continuing up the bole as ribs up to 10 m. Bark greyish brown, shallowly fissured, fissures up to 1.5  m long, lenticelled, outer bark up to 3 cm thick, thickly lamellate cream and yellow, sapwood creamy-white, heartwood pale yellow with silica. Damar grey-green. Twigs at first frequently angular, becoming minutely striated or smooth, terete. Stipules c. 8 mm long, c. 3 mm wide, hastate, acute, falling off early. Petioles 2-4 cm long, thickened at apex. Leaves oblong to obovate, 6-20 cm long, 7-11 cm wide, thinly leathery, frequently slightly raised between veins, glabrescent beneath, grey-green stellate hairs present, base obtuse or broadly wedge-shaped, often heartshaped, acumen to 5 mm long, secondary veins 15-22 pairs. Calyx not cupped at base, lobes triangular, corolla cream, petals broadly hastate, acute, stamens c. 25, ovary cylindrical, style short, pubescent at base. Fruits calyx shortly pubescent, tube 1-1.3 cm diameter, globular, tapering gradually to the pedicel, 2 longer calyx lobes c. 16 cm long, 1.5-2 cm wide, spatula-shaped, obtuse, 3 shorter lobes c. 20 mm long, c. 4 mm wide, variable, hastate, base slightly constricted, apex of nut broadly conical. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Common, often gregarious, in Semi-evergreen dipterocarp forest and evergreen forest in seasonal areas, rare but widespread in lowland forest in everwet areas, up to 700 m altitude. Usually growing on ridges with sandy to clayey soils, sometimes along rivers. Occasionally found on limestone.",
    "Distribution":"Indo-China, Birma, Thailand, Peninsular Malaysia, Sumatra, Java, Borneo, Philippines.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Anisoptera%20costata-9616.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.05 ]
    },
    "properties": {
    "Species":"Anisoptera Reticulata P.S.Ashton",
    "Kolektor":"Sidiyasa, K",
    "Description":"Emergent tree up to 67 m tall and 152 cm dbh. Stem with resin. Twig of variable thickness, at first frequently angular, becoming minutely striated or smooth, terete. Bud 3-5 by 1.5-3 mm, ovoid, somewhat compressed, acute. Stipule c. 8 by 3 mm, hastate, acute, fugaceous. Leaves 6-18 by 7-11 cm, thinly coriaceous, frequently slightly bullate, oblong to obovate, undersurface grey-green lepidote to golden or chocolate; base obtuse or broadly cuneate; acumen to 5 mm long; margin not revolute or only slightly so; nerves 8-22 pairs, at 60-70 degrees; petiole 2-4 cm long. Panicle to 20 cm long, terminal or axillary, angular, pendent, doubly or trebly branched, branchiets bearing up to 5 flowers; bracteoles to 4 by 2 mm, hastate, acute, shortly densely pubescent. Flower bud to 12 by 6 mm, ovoid, acute. Calyx densely tomentose outside, shortly pubescent within; lobes deltoid, ca. acute, acuminate, of varying lengths. Corolla cream; petals broadly hastate, acute, shortly puberulent on parts exposed in bud. Stamens c. 25 (to 35 outside Malesia), subequal; filaments short, compressed; anther oblong, tapering apically; appendage to connective about twice as long as anther, filiform, tapering, reaching, almost to apex of stylopodium. Stylopodium cylindrical, somewhat tapering, densely pubescent; style short, trifid, pubescent at base, otherwise glabrous. Fruit calyx shortly pubescent, tube glabrescent; tube to 1 by 1.2 cm, globose, tapering gradually to the pedicel, narrowed to 8 mm at the neck; 2 longer calyx lobes to 16 by 1.5-2 cm, spatulate, obtuse, c. 5 mm broad at base; 3 shorter lobes to 20 by 4 mm, variable, hastate, base slightly constricted. Nut apex broadly conical, crowned by a c. 2.5 by 1.5 mm oblong stylopodium, shortly pubescent. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Scattered in mixed dipterocarp forest on well-drained undulating land and low hills",
    "Distribution":"Peninsular Thailand, Peninsular Malaysia and Sumatra.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Anisoptera%20reticulata-AW62%20(Custom).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,1.45 ]
    },
    "properties": {
    "Species":"Archidendron Havilandii (Ridl.) I.C.Nielsen",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 40 m tall, c. 75 cm in diameter. Bark grey, smooth, hooped (transverse rows of lenticels), inner bark dark red or white, sap wood white, heartwood bright yellow. Branchlets terete. Leaflets 1.5-2 pairs per pinna, proximal pair alternate, distal one opposite, papery, 1-sided, ovate-elliptic, elliptic, or obovate-elliptic, 5.5-22 cm long, 3-12 cm wide, base symmetrically wedge-shaped, apex acuminate, lower surface with scattered hairs. Inflorescences terminal. Flowers in stalked heads, calyx green, funnel-shaped, 3-4 mm long, corolla green or white, narrowly funnel-shaped, 6.5-8 mm long, stamens white, ovary solitary, glabrous. Pods brown outside, light brown inside, terete, straight, woody to rigidly leathery, up to 16 cm long, c.4 cm in diameter, dehiscing along the ventral and the dorsal suture. Seeds brown, almost cylindrical, 12-35 mm in diameter (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Relatively common in primary and secondary rain forest, along rivers and regrowth, up to 1.550 m altitude.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Fabaceae-Archidendron%20havilandii-S3450%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.9166667,0.333333333 ]
    },
    "properties": {
    "Species":"Archidendron Jiringa (Jack) I.C.Nielsen",
    "Kolektor":"Kessler",
    "Description":"Shrub or tree, to 24 m high, 60(-90) cm in diameter. Bark grey or grey-white, usually smooth, rarely c. flaky, inner bark pink or reddish brown. Sapwood white or pinkish white, heartwood white, with a strong smell of garlic. Branchlets terete with decurrent ridges from the leaf-scars, light brown, glabrous. Leaves: petiole 2-7 cm, glabrous, gland(s) on petiole often present, circular in outline, sessile, subglobose to flat, 1.5-2 mm in diameter; pinnae 1 pair, to 20 cm, glabrous; petiolules 4-6 mm, glabrous; leaflets 2 or 3 pairs per pinna, opposite, drying c. dark greyish on both surfaces or green beneath, chartaceous, equal- or unequal-sided, ovate-elliptic to oblong, 5.5-20.5 by 2.4-7 cm, base c. asymmetrically rounded to broadly cuneate, apex obtusely acuminate, both surfaces glabrous; principal lateral veins c. 6-10 per leaflet-half, strongly arching, non-parallel; reticulation fine, inconspicuous or prominulous on both surfaces, more distinct beneath. Inflorescences either ramiflorous below the leaves or axillary at the distal leaves, with scattered hairs in the distal parts, glabrescent, consisting of glomerules aggregated into panicles to 30 cm long; glomerules or small spikes composed of 4-7 sessile flowers; floral bracts ovate or ovate-elliptic, acute, 0.5-1 mm, appressed-puberulous. Flowers cream or yellowish white, pentamerous, bisexual. Calyx broadly campanulate to cup-shaped, 1-2 mm, scarcely puberulous especially in the proximal part; teeth deltoid, acute, 0.2-0.3 mm. Corolla funnel-shaped, 4-5 mm, tube glabrous; lobes ovate-elliptic to oblong, acute, c. 2 mm, appressed-puberulous or glabrous at the apex, reflexed. Stamens c. 8-10 mm, tube equalling the corolla-tube. Ovary solitary, glabrous. Pod greyish to dark brown or dark purple outside, greyish within, falcate or twisted in a wide spiral or contorted into a circle c. 11 cm in diameter, c. deeply lobed between the seeds along the ventral suture, at maturity most often divided quite down to the thickened dorsal suture, the segments being separated by necks, pod woody, to 20-25 by 5.2 cm, glabrous, with inconspicuous veins, dehiscing along the ventral suture. Seeds dark-brown, orbicular, biconvex, 2.8-3.5 cm in diameter, 1-1.5 cm thick.",
    "Habitus":"Tree",
    "Ecology":"Flora Malesiana",
    "Distribution":"Bangladesh, Burma, Thailand, Peninsular Malaysia, Sumatra, Java, Borneo, Moluccas.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Fabaceae-Archidendron%20jiringa-PK2197%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.9166667,0.966666667 ]
    },
    "properties": {
    "Species":"Alseodaphne Elmeri Merr.",
    "Kolektor":"Arifin, Z",
    "Description":"Trees up to 20 m tall, c. 30 cm in diameter. Bark pale, more or less smooth. Twigs whitish. Petioles 1.5-2.5 cm long. Leaves elliptic, 20-30 cm long, 7-12 cm wide, base wedge-shaped, apex acute, secondary veins 7-12 pairs. Fruits ellipsoid, stalk red (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Common in primary and secondary lowland forest.",
    "Distribution":"",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Lauraceae-Alseodaphne%20elmeri-SMK03%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.4166667,1.416666667 ]
    },
    "properties": {
    "Species":"Aporosa Nitida Merr.",
    "Kolektor":"Arifin, Z & Suharja, I",
    "Description":"Diagnostics: Sub-canopy tree up to 25 m tall and 30 cm dbh. Stipules dropped early. Leaves alternate, simple, penni-veined, large, glabrous. Flowers ca. 0.3 mm in diameter, yellow, placed on club-shaped inflorescence. Fruits ca. 20 mm long, yellow-orange, dehiscent capsule, seeds with orange aril. Description: Shrub or tree, up to 25 m high, up to 30 cm diameter. Bark black, (dark) brown to (patchy) greyish, greenish, yellowish, or whitish, smooth or lenticellate; inner bark (pale) brownish, pale greenish, or (pale) yellowish to greyish white. Wood yellow to white. Twigs brown, young ones green, glabrous. Stipules not seen, early caducous. Petiole terete, adaxially lowly grooved, 13-36 by 1.5-2.5 mm, glabrous, lower pulvinus 3-6 by 2-3 mm, upper pulvinus 8-12 by 2.5-3.5 mm, both distinct. Leaves narrowly ovate to narrowly elliptic, 15-32.5 by 5-13 cm; base obtuse to acute, basal glands absent; margin lowly undulate to lowly glandular-crenate, marginal glands regular, distinct, brownish to black; apex acuminate to cuspidate; blade thick, young leaves lowly white granular on nerves, shiny, not brittle, drying greyish green or yellowish green above and beneath, glabrous; dots laxly set, fine, greyish, fading; disc-like glands minute, brownish, occasionally scattered along the margin and at base within marginal arches, often indistinct. Nervation: midrib prominent to flat above, prominent beneath; nerves 9-13 pairs, prominent to flat above, sometimes slightly sunken, prominent beneath, marginal arches distinct, 3-5 mm from the margin; tertiary veins and venation fading, rather densely reticulate, slightly prominent to flat. Inflorescences axillary or just below the leaves. Staminate inflorescences 2-5 clustered together, 12-36 by 3-8 mm, subglabrous; peduncle 2-24 by 0.7-1 mm; bracts broadly triangular, inconspicuous, 0.3-0.5 mm long, biglandular, glabrous, margin ciliate; glomerules ellipsoid, 2-3 by c. 1.5 mm, consisting of 9-13 densely set flowers, sometimes spaced at 0.5-1.5 mm at base of rachis, densely massed apically; pedicel c. 0.2 mm. Staminate flowers 0.3-0.7 mm long; sepals 4, narrowly obovate, 0.2-0.5 mm long, connate at base, sparsely hairy outside, glabrous inside; stamens 2, slightly exserted, 0.3-0.7 mm long; anthers 0.1-0.2 mm long, connective glabrous; pistillode absent. Pistillate inflorescences 2 or 3 clustered together, 2-4 by 0.8-1 mm, subglabrous; flowers single at apical end of rachis; bracts broadly triangular, 0.3-0.5 mm long, fleshy, glabrous outside, hairy at base only inside; bracteoles as bracts; pedicel 1.5-5 mm long, sparsely puberulous. Pistillate flowers 3-3.5 mm long; sepals 5 or 6, subequal, ovate, reflexed, 0.5-0.8 mm long, fleshy, glabrous, margin ciliate; ovary ellipsoid, 2-3 mm long, 4-6(-7)-locular, smooth, glabrous; stigmas sessile, broad, flattened on top of the ovary, straight, almost completely divided, 0.5-1 mm long, smooth to slightly ribbed above, glabrous, connate to the ovary beneath. Infructescences 9-12 by 1.2-2 mm, sparsely tomentose, glabrescent; fruiting pedicel 3-9 mm long, sparsely puberulous. Fruits globose, not stiped, not beaked, 21-28 by 22-27 mm, but recorded up to 27-30 mm diam. when fresh, smooth, drying light yellow to orange brown, glabrous; pericarp 3-5 mm thick, fleshy; septae and column glabrous. Seeds 3-6, half-terete, ellipsoid, 9-11 by 5-8 by 4-5 mm (Flora Malesiana).",
    "Habitus":"Tree",
    "Ecology":"Primary, secondary, riverine, or recently logged over forest; on hill sides, hill tops, ridges, road sides, and along river banks or swamps; in low or undulating country, rolling land, marshy or moist areas, or alluvial. Soil: clay, sandstone, sandy clay loam, loam with lime, silty clay, laterite, or stony, granodiorite derived, yellowish to reddish. Altitude: low to 1000 m.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Phyllanthaceae-Aporosa%20nitida-AA3734%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.55,0.183333333 ]
    },
    "properties": {
    "Species":"Amyxa Pluricornis (Radlk.) Domke",
    "Kolektor":"Sidiyasa, K",
    "Description":"Tree up to 15 m tall, up to 15 cm in diameter. Bole straight. Monopodial, somewhat horizontal branches. . Bark rough, brown, fibrous. Inflorescence pallid. Flowers pale green. Fruits green, softish, seed dark glossy brown, funicle partly very fleshy, aril-like, white, when mature the attractive seed with its contrasting colours will dangle out of the dehisced capsule hanging on the thin basal part of the funicle from the apex of the valve.",
    "Habitus":"Tree",
    "Ecology":"Pole diptercarp forest, disturbed primary forest and secondary forest. Gentle slope, 20-480 m altitude.",
    "Distribution":"Brunei, East and Central Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Thymelaceae-Amyxa%20pluricornis-S4179%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.4166667,0.5 ]
    },
    "properties": {
    "Species":"Baccaurea Angulata Merr.",
    "Kolektor":"A.J.M. Leeuwenberg, K. Sidiyasa, Daslim & Arbainsyah",
    "Description":"Tree up to 21 m tall. Almost glabrous except the inflorescences. Leaves oblong or oblanceolate, 15-45 cm long, 5-14 cm broad, chartaceous to coriaceous, obtuse to very shortly acominate, cuneate or occasionally rounded below, drying greenish ovate and ochraceous to chestnut-brown below, or greenish throughout, surface smooth but rather dull, nervation lax, petiole 5-13 cm long. Male inflorescences (previously undescribed) very slender, fascicled, cauline, up to 12 cm long, papillose-puberulous; bracts subulate, 1-2 mm long, not adnate; flowers in 3-flowered fascicles, pedicels 3-4 mm long, flower 1.5-2 mm diameter. Female inflorescences robust, cauline (occasionally ramiflorus), in small groups, up to 21 cm long; rachish angled, finely puberulous; pedicels spreading or deflexed 3-5 mm long; tepals narrowly oblong, 7-8 mm long,conduplicate, 1 mm wide (2 mm when opened flat), densely grey-papillose; ovary 3-locular, lageniform, 3 mm long, densely sericeous below, puberulous above, styles 3, very short, reflexed, coarsely papillose. Fruit elliptic-ovoid, 3-5 cm long, conspicuously beaked, red, fleshy, strongly though narrowly 6-winged, wings sinuate (The Euphorbiaceae of Borneo).",
    "Habitus":"Tree",
    "Ecology":"Primary lowland dipterocarp forest on sandstone or stony yellow soil, or on tufa, up to 780 m altitude.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Phyllanthaceae-Baccaurea%20angulata-LG14514%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.5333333,0.166666667 ]
    },
    "properties": {
    "Species":"Bridelia Glauca Blume",
    "Kolektor":"Sitepu, B.S.",
    "Description":"Treelet up to 15 m tall, or climbing shrub. Recognizable by the smooth, glaucescent (though minutely puberulous) undersurface of the leaves and the drupes distinctly and rather stoutly pedicelled fruits (The Euphorbiaceae of Borneo).",
    "Habitus":"Tree",
    "Ecology":"Mixed peat-swamp forest or primary forest on black rocky soil, yellow sandy loam, sandstone, or sand and limestone, up to 400 m altitude, ascending to 1500 m on Kinabalu and 1800 m on Trusmadi.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Phyllanthaceae-Bridelia%20glauca-BSS114%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.05 ]
    },
    "properties": {
    "Species":"Cotylelobium Melanoxylum (Hook.f.) Pierre",
    "Kolektor":"Wahyudi, A",
    "Description":"Trees 30-45 m tall, c. 60 cm in diamter, bole often twisted, buttresses low, rounded. Bark grey, at first smooth but prominently hooped, becoming irregularly, flaky, leaving a distinct scroll-marked surface below, outer bark thin, c. 0.5 mm thick, brittle, inner bark 1 cm thick, outer layer pale brown-red, inner layer dirty white, sapwood pale brown, heartwood light brown. Damar whitish or pale yellow. Twigs terete, slender, minutely striated with fine cracks. Stipules linear, small, up to 3 mm long, falling off early. Petioles up to 1.5 cm long. Leaves ovate to obovate, 8-12 cm long, 4-7 cm wide, base rounded to broadly wedge-shaped, apex acuminate, up to 8 mm long, densely brownish peltate beneath, secondary veins 10-13 pairs, curved, with more almost equal, corolla narrowly ovate, stamens 15, ovary ovoid, style needlelike, pubescent towards the base. Calyx persistently pubescent towards the base, glabrescent elsewhere, 2 longer calyx lobes up to 4.5 cm long, 1.2 cm wide, oblong, obtuse, 3 shorter lobes up to 1.5 cm long, 3 mm wide, hastate, acute, lobes united at base into a shallow cup, c. 8 mm diameter (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp and keranga forests with poor soils. Mostly on coastal hillsides and ridges, but also quite common along rivers, valleys, rocky to sandy, acid soils, especially on hills, but also on rentzinas over limestone and mountain ridges inland to elevations of 1.500 metres. Sometimes found in secondary forests.",
    "Distribution":"Thailand, Malay Peninsula, Sumatra, Borneo (Sarawak, Brunei, Sabah, West- and East-Kalimantan).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Cotylelobium%20melanoxylum-AW88%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.3,0.116666667 ]
    },
    "properties": {
    "Species":"Cotylelobium Burckii (Heim) Heim",
    "Kolektor":"Sidiyasa, K & ambriansyah",
    "Description":"Twig, bud, petiole, stipules outside, midrib beneath and raceme densely shortly persistently buff tomentose, slightly scabrid; leaf evenly densely ocherous tomentose beneath. Twig c. 1.5 mm diameter apically, slender, smooth. Bud 1.5-2 by 1.5 mm, small. Stipules to 8 mm long, narrowly deltoid, fugaceous. Leaves 8-12 by 3-4.5 cm, oblong-lanceolate; margin prominently revolute; base broadly cuneate or obtuse; acumen 2.5-7.5 mm long; nerves 10-12 pairs, indistinct, the intramarginal nerve comparatively straight and just within the margin; petiole 1.5-2 cm long. Panicle to 15 cm long; to 3-axillary, rarely terminal, terete or ribbed, irregularly doubly branched; hracteoles to 8 by 5 mm, elliptic, obtuse, shortly buff pubescent. Flower bud to 10 by 4 mm, ovoid-lanceolate, acute. 2 calyx lobes long, linear, obtuse; 3 short, lanceolate, acute; densely buff tomentose outside, more sparsely within. Corolla cream; petals large, narrowly oblong, obtuse, glabrous. Stamens 15, the inner 5 slightly longer than the others; filaments short, road at base, strongly tapering; anthers narrowly oblong, reaching half length of style, with sparsely setose lateral margins; appendage to connective | as long as anther, slender. Ovary ubglobose, densely tomentose; style slender, 3-4 times as long as ovary, shortly pubescent but for the glabrous apical ?. Fruit calyx as in C. melanoxylon but base more densely tomentose, longer lobes c. 1.5 cm broad, persistently shortly sparsely tomentose; 3 shorter lobes to 1.2 cm long, linear, shortly sparsely tomentose on both surfaces. Nut as in other species (Flora Malesiana).",
    "Habitus":"Tree",
    "Ecology":"Locally common on giant podsols, on raised beaches, rare on sandstone cuestas, near present and Pleistocene coastlines.",
    "Distribution":"Borneo: West Kutai, Lower Dayak, West Borneo, Malaysia, Sarawak and Brunei North-East to the Limbang.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Cotylelobium%20burckii-S1663%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8333333,1.133333333 ]
    },
    "properties": {
    "Species":"Crudia Reticulata Merr",
    "Kolektor":"Sidiyasa, K",
    "Description":"Tree up to 18 m tall, 20 cm diameter, sometimes schrub-like up to 4 m tall, rarely a climber(?). Stipules falcate, 5-6 mm long, caducous. Leaves each with (1-)2-3(-4) leaflets; petiole and rachis 0.5-2-(-4) cm long. Leaflets glabrous or rarely sparsely minutely hairy below; elliptic, elliptic-oblong, ovate-oblong or obovate-oblong, 10-29(-36)x3-8(12.5)cm, base cuneate, acute, obtuse or rounded, symmetrical or slightly asymmetrical, apex acuminate or rather abruptly caudate-acuminate, acumen slender, 1.5-2.5(-3.5) cm long; lateral veins 5-9 (or more) per side; petiolules 3-7 mm long. Inflorescences axillary, up to 10(-28) cm long, rachis puberlous; bracts subulate and long-drawn, or 3-lobed with the central lobe divided again and bristle-like, slight;y hairy, up to 8 mm long, sometimes many, aggregate, surrounding the base of the peduncle and brush-like, (semi-) persistent, puberlous outside slightly ciliate on the margins, those at the base of pedicel rather small, triangular, 0.3-1.5 mm long; bracteoles minute; pedicel 3-5 mm long. Flowers puberlous outside, glabrous inside; hypanthium c. 1 mm long; calyx lobes ovate or broadly ovate, 3.5-4x2-2.5 mm; stamen (8-)10, filaments usually 4-6 mm long; ovary usually 4-ovuled, style 4.5-5.5(-10) mm long. Fruits (young) ellipsoid or ovoid, 8.5-12.5x3-4 cm, densely shortly hairy. Seeds broadly ellipsoid or suborbicular, 2.6-3.3x2-2.4 cm; testa rusty scurfy, finely rugose (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In lowland primary mixed dipterocarp, periodically inundated freshwater swamp and peatswamp forests on sandy, loamy soils with coral limestone, occasionally in secondary forest, up to 250 m, once recorded at 1000 m altitude (Berau, Kalimantan). Flowering in January-April and July-September; fruiting in April and June-October",
    "Distribution":"Endemic to Borneo. In Sabah known for Sandakan (Sepilok), Lahad Datu, Kinabatangan (Lamag) and Tawau districts. In Sarawak recorded for northern region, Bintulu and Tatau districts. Also in Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Fabaceae-Crudia%20reticulata-S2851%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.1833333,1.916666667 ]
    },
    "properties": {
    "Species":"Crudia Tenuipes Merr",
    "Kolektor":"Kessler, P.J.A. ; Ambriansyah",
    "Description":"Tree up to 27 m tall, 40 cm diameter; buttresses steep, up to 1.5 m high and 30 cm extending outwards from the base. Stipules ovate, minute, caducous. Leaves each with 2-4 leaflets; petiole and rachis 1.5-7 cm long. Leaflets  glabrous on both surfaces; elliptic oblong or ovate-oblong, 7-20x3-7 cm, base cuneate, acute, obtuse, or rounded, symmetrical or  slightly asymmetrical, apex acuminate or rather abruptly acuminate; lateral veins 5-7 per side; petiolules c. 5 mm long, glabrous. Inflorescences axillary, up to 24 cm long, glabrous, bracts triangular, up to 1.5 mm long, glabrous, caducous; bracteoles minute, caducous; pedicel (7-)15-22(-30) mm long, glabrous. Flowers glabrous outside; hyphanthium c. 2 mm long; calyx lobes elliptic or ovate-oblong, 4-4.5x2-2.5 mm, inner surface often puberlous on the vertical, central part, glabrescent, sometimes almost glabrous; stamens (8-)10, filaments up to 12 mm long, glabrous; ovary (2-)4(-5)-ovuled, style up to 14 mm long. Fruits ellipsoid or fusiform, 5-8x2.5-3.5x1.8-2.5 cm, swollen, gradually narrowed from the middle towards both ends, shortly hairy, 1-2(-more)-seeded; valves coriaceous, hard. Seeds transverse-oblong or slightly reniform, 2-2.2x3-3.7(4.7)x1.8-2.3 cm, slightly swollen, smooth, shining (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Widespread in forests; sometimes found on limestone, coral rock, sandy yellow loam soils. From lowland up to 500 m altitude. Flowering in February-May, and October-November; fruiting in April-May, July-September, and December",
    "Distribution":"Endemic to Borneo. In Sabah known in Sandakan, Beaufort, Kota Kinabalu, Lahad Datu, Tenom, and Tawau districts. In Sarawak recorded for Kapit, Kuching, Marudi (Mt. Dulit), and Miri districts. Also in Brunei and Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Fabaceae-Crudia%20tenuipes-B1412%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.2333333,1.933333333 ]
    },
    "properties": {
    "Species":"Cleistanthus Podopyxis Airy Shaw",
    "Kolektor":"Ambriansyah",
    "Description":"Tree to 12 m tall. In Jablonszky's classification this seems clearly referable to Sect. Leiopyxis, the flowers being borne on special leafless branchlets. From almost all the species of that section, however (cf. Also C. praetermissus, below), it differs in having a manifestly stipitate (but non-pedicellate) capsule. In other respects the species shows no remarkable fatures. The leaves are mostly thinly chartaceous, but sometimes subcoriaceous, 6-14 x 2-6 cm, quite glabrous and with only 3-6 pairs of rather prominent nerves. The inflorescences are elongate and rather slender. the flowers are quite glabrous and are said to be fragrant (The Euphorbiaceae of Borneo).",
    "Habitus":"Tree",
    "Ecology":"Primary or secondary forest on black or clayey soil, or sanstone, or coral limestone rocks, up to 600 m altitude",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Phyllanthaceae-Cleisanthus%20podopyxis-B1291%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.5,0.2 ]
    },
    "properties": {
    "Species":"Caesalpinia Sappan L.",
    "Kolektor":"Priyanto",
    "Description":"Small thorny tree, 6-9 m in height and 15-25 cm in trunk diameter with a few prickly branches. Leaves are double-compound, alternately arranged, 20-45 cm long, 10-20 cm broad, with 8-16 pairs of up to 20 cm long side-stalks. Side-stalks are prickles at the base and with 10-20 pairs of oblong, 10-20 mm x 6-10 mm long leaflets, very oblique at base, rounded to notched at the tip. Yellow flowers are borne panicles in leaf axils and at the end of branches. Flowers fragrant, 2-3 cm long, 5-merous. Stamens are waxy-white, filaments densely woolly at the base. Fruits are woody pods, compressed with a hard recurved short beak, with 3-4 seeds.",
    "Habitus":"Tree",
    "Ecology":"PROSEA 5(3) Timber trees: lesser known species",
    "Distribution":"India, Burma, Thailand, Indo-China and southern China to Peninsular Malaysia. Cultivated and naturalized in many parts of Malesia (Indonesia, the Philippines, Papua New Guinea) and also in India, Sri Lanka, Taiwan, Solomon Islands, and Hawaii.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Fabaceae-Caesalpinia%20sappan-BSS198%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8666667,1.016666667 ]
    },
    "properties": {
    "Species":"Dacryodes Rostrata (Blume) H.J.Lam",
    "Kolektor":"Arifin, Z",
    "Description":"Trees 10-25 m tall, 20-50 cm in diameter. Buttresses small, steep. Bark cracking and scaly, often with smears of black resin. Inner bark pinkish to red, mottled, oozing little clear to white resin. Twigs glabrous except the rusty brown tomentose tip. Leaflets 2-8(-10) pairs, glabrous. Petioles terete, 6-15 cm long. Leaflets ovate to oblong, 3.5-20 cm long, 1.5-10 cm wide, rigid, parchment-like, base very oblique, apex usully abruptly acuminate, acumen up to 2 cm long, 1-2 mm wide, midrib and veins prominent beneath, veins 5-20 pairs. Panicles axillary, together usually pseudomterminal. Flowers tomentose, 2-4 mm long. Fruits ovoid to oblong, slghtly oblique, 1.75-3.5 cm long, 0.75-1.75 cm in diameter, somewhat contracted at the apex, ripening trough yellow to deep mauve-black (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"In primary forest up to 500 m altitude, usually on hillsides and ridges, occasionally in swamps.",
    "Distribution":"Endemic in Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Burseraceae-Dacryodes%20rostrata-FS115%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8166667,1.133333333 ]
    },
    "properties": {
    "Species":"Dipterocarpus Gracilis Blume",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 50 m tall, bole straight, up to 1 m diameter. Bole cylindrical, buttresses rather small to large, rounded. Bark grey with large reddish brown patches from which the scales have recently fallen, with star like lenticels, outer bark thin, inner bark dull pale pinkish brwn, thick, fibrous, sapwood pale ochre, heartwood red-wood red-brown, brown-grey or grey-brown-red. Damar white. Twigs 1-1.2 cm diameter, terete, becoming thinly flaky. Stipules up to 10 cm long, c. 2 cm wide, narrowly lanceolate. Petioles more than 5 cm long. Leaves broadly ovate, 20-28 cm long, 12-23 cm wide, parchment-like, base rounded to obtuse, apex obtuse to shortly acuminate, style shortly acuminate, veins c. 20 pairs. Calyx and corolla typical, stamens c. 40, ovary ovoid, conical, style short, pubescent except apex. Fruits sessile, calyx tube c. 4 cm diameter, glabrous, globolar, smooth, with 5 obtuse tubercles in the apical half, 2 longer calyx lobes up to 18 cm long, c. 5 cm wide, 3 shorter lobes up to 1.5 cm long, 1.5 cm wide, broadly ovate, base more or less heart-shaped, revolute. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"This species is widespread in seasonal semi-evergreen forest, becoming scattered and confined to fertile soil in everwet areas. In undisturbed mixed dipterocarp and seasonal forests up to 1200 m altitude. Can be found throughout the forest, from alluvial sites to dry hillsides and ridges. Also found on limestone.",
    "Distribution":"Andaman Islands, Burma, Thailand, Peninsular Malaysia, Sumatra, Java, Borneo, Philippines.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dipterocarpus%20gracilis-S3139%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.5 ]
    },
    "properties": {
    "Species":"Dipterocarpus Validus Blume",
    "Kolektor":"Kessler",
    "Description":"Large pale barked frequently buttressed trees. Twigs, leaf buds, stipules outside, petioles and base of inflorescence densely ? persistently evenly long rufous tomentose, becoming distinctly tufted as the twigs and stipules expand; nerves and midrib beneath and inflorescence sparsely evenly puberulent. Twigs c. 6-10 mm diameter, terete. Leaf buds to 9 by 1.3 cm, lanceolate; stipules to 20 by 3 cm, lorate. Leaves 1 5-25 by 7.5-12 cm (to 40 by 20 cm in young trees), elliptic-oblong to ovate, coriaceous; margin undulate, prominently sinuate distally; base cuneate to obtuse (narrowly peltate in young trees); apex acute to prominently narrowly acuminate, to 1 cm long; nerves 22-28 pairs, straight, ascending at c. 50, slender but prominent beneath, ? shallowly depressed above; tertiary nerves densely scalariform, very slender, evident but hardly elevated beneath; midrib prominent beneath, ? elevated above; petioles 3.5-5 cm long, prominently geniculate. Raceme to 14 cm long, ? unbranched, axillary, bearing to 7 flowers. Flower buds to 30 by 9 mm; stamens c. 30, slightly shorter than style at anthesis; filaments slender, c. ? length of filiform auriculate tapering anthers; appendage acicular, slender, c. ? length of anthers; ovary small, ovoid, hirsute as also the basal ? of style; style stoutly columnar, c. 4 times length of ovary. Fruit pedicel expanding into the to 4 by 3.5 cm smooth turbinate calyx tube; 2 longer lobes to 25 by 3.5 cm, lorate-spatulate, obtuse, c. 5 mm broad at base; 3 shorter lobes to 6 by 6 mm, suborbicular, small, ? recurved. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Common and frequently gregarious both in primary and secondary forest and occurs on flat land, in freshwater swamp and on river banks or occasionally on low hills up to 300 m altitude.",
    "Distribution":"Borneo and the Philippines; also as a palntation tree in the Philippines.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dipterocarpus%20validus-PK1101%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.2833333,2.083333333 ]
    },
    "properties": {
    "Species":"Dipterocarpus Grandiflorus (Blanco) Blanco",
    "Kolektor":"Kessler",
    "Description":"Upper canopy tree up to 49 m tall and 67 cm diameter. Stem with resin. Very large hardly buttressed tree. Leaf bud, outside of stipule, parts of petals exposed in bud, ovary apex and sometimes twig densely evenly pale buff pubescent, parts otherwise glabrous. Twigs to 12 mm diameter, stout, becoming grey-brown; internodes short, the leaves clustered around the twig endings. Buds to 2 by 1 cm, ovoid, acute; stipule to 18 by 5 cm, oblong-lanceolate, subacute. Leaves 10-18 by 5-12 cm, ovate, coriaceous, +/- applanate; base obtuse or subcordate; acumen to 1 cm long, short, nerves 15-17 pairs, prominent beneath, spreading; tertiary nerves remotely scalariform, barely elevated; petioles 3-9 cm long, very long, slender. Inflorescences to 18 cm long, very long, slender, axillary, borne in dense groups behind the leaves, unbranched, bearing to 3 remote distichous flowers. Flower buds to 35 by 13 mm, fusiform. Stamens 30, exceeding style at anthesis; filaments broad, compressed, tapering, c. 0.33 the length of the relatively short broadly linear-lanceolate tapering anthers; appendages acicular, c. 0.66 length of anthers. Ovary tapering into the short stoutly columnar style; ovary and style puberulent in the basal half. Fruit pedicel to 2 by 4 mm, stout. Calyx tube to 7 by 3.5 cm. ellipsoid, with 5 pruinose, to 1.5 cm wide, prominent coriaceous wings continuous from base to apex; 2 longer lobes to 22 by 3 cm, oblanceolate-spatulate, obtuse, tapering abruptly to c. 1.3 cm wide at base; 3 shorter lobes to 2 by 1.5 cm, elliptic, subrevolute. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed but also often in disturbed mixed to seasonal dipterocarp forests up to 700 m altitude. Quite often near coastal regions on hillsides and ridges with poor sandy, or ultrabasic soils.",
    "Distribution":"Andaman Islands, Thailand, Peninsular Malaysia, Sumatra, Borneo, Philippines.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dipterocarpus%20grandiflorus-PR1%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Dipterocarpus Kunstleri King",
    "Kolektor":"Wahyudi, A",
    "Description":"Upper canopy tree up to 50 m tall and 136 cm diameter. Stem with resin. Twig, lamina and petiole glabrous; leaf nervation puberulent or glabrous beneath: leaf bud and stipule outside persistently densely minutely pale grey adpressed puberulent, appearing grey lepidote. Twig to 5 mm apically, terete or slightly ribbed and compressed; stipule scars prominent. Bud 12-15 by 2-3.5 mm, narrowly falcate, acute. Stipule to 7 by 0.8 cm, linear. Leaves 13-22 by 7-10 cm, elliptic to broadly lanceolate, base cuneate; apex shortly acummate (more prominently acuminate in young trees): nerves 16-18 pairs, prominent beneath, at c. 40 to 50 degrees: petiole 2-3 cm long. Raceme to 22 cm long, terminal or axillary, slender, glabrous, somewhat compressed, singly branched. Flower bud 3.5 by 1.5 cm. Calyx and corolla typical, calyx glabrous. Stamens c. 30, somewhat longer than the style; filaments short, anthers linear, tapering: appendage to connective as long as anther, slender. Ovary ovoidconical, shortly densely pubescent: stylopodium and style about 5 times as long as the ovary, tapering from the base, shortly tomentose but for apical quarter. Fruit calyx glabrous; tube to 5 by 2.5 cm. ellipsoid, tapering gradually to the base and to the strongly constricted c. 1 cm diameter neck: 5-ribbed or almost winged, the ribs c. 1 mm thick and 4 mm broad apically, either confined to the apical half or continuing to the base as shallow rounded ridges, terminating +/- abruptly distally as obtuse tubercles; 2 longer lobes to 11 by 1.5 cm, of very variable length, sometimes no longer than shorter lobes, lanceolate, coriaceous, obtuse, tapering abruptly to the c. 5 mm broad base, 3-nerved, nerves indistinct: shorter lobes to 6 by 5 mm, small, recurved, somewhat thickened. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 100 m altitude. Often on alluvial sites, but also found on hillsides and ridges with sandy to clayey soils.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo, Philippines.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Dipterocarpaceae-Dipterocarpus%20kunstleri-AW33.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.08,1.5 ]
    },
    "properties": {
    "Species":"Dipterocarpus Humeratus Slooten",
    "Kolektor":"Kessler",
    "Description":"Trees up to 50 m tall, up to 80 cm diameter. Bole columnar, buttresses several, steep, rather small to pronounced. Bark grey, locally with large reddish brown patches from which the scales have recently fallen, with star-like lenticels, outer bark thin, inner bark dull pale pinkish brown, thick, fibrous, sapwood pale ochre, heartwood red-brown, brown-grey or grey-brown-red. Damar white. Twigs 1-1.2 cm diameter, terete, becoming thinly flaky. Stipules up to 10 cm long, c. 2 cm wide, narrowly lanceolate. Petioles more than 5 cm long. Leaves broadly ovate, 20-28 cm long, 12-23 cm wide, parchment-like, base rounded to obtuse, apex obtuse to shortly acuminate, veins c. 20 pairs. Calyx and corolla typical, stamens c. 40, ovary ovoid, conical, style short, pubescent except apex. Fruits sessile, calyx tube c. 4 cm diameter, glabrous, globular, smooth, with 5 obtuse tubercles in the apical half, 2 longer calyx lobes up to 18 cm long, c. 5 cm wide, 3 shorter lobes up to 1.5 cm long, c. 1.5 cm wide, broadly ovate, base more or less heart-shaped, revolute. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"tree",
    "Ecology":"This species is confined to well-drained flat or undulating land or hills, frequently common. In undisturbed mixed dipterocarp forests up to 600 m altitude. On hillsides and ridges with sandy to clayey soils.",
    "Distribution":"Sumatra, Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dipterocarpus%20humeratus-B843%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.08,1.5 ]
    },
    "properties": {
    "Species":"Dipterocarpus Caudiferus Merr.",
    "Kolektor":"Kessler",
    "Description":"Emergent tree up to 63 m tall and 140 cm diameter. Stem with resin. Twig, leaf beneath and margin, petiole, raceme and young leaf bud sparsely, 2-2.5 mm long, +/- fugaceous or caducous silky long tomentose; subpersistent on young trees, occasionally persistent on bud, twig, and petiole. Twig c. 5 mm diameter, rather stout, terete; frequently rather verrucose and sometimes (usually in young trees) papery. Bud 10-25 by 3-5 mm. lanceolate, somewhat compressed. Stipules c. 1 cm long, linear. Leaves 11-20 by 5-15 cm. elliptic, thinly coriaceous, base obtuse or cuneate. apex prominently to 8 mm long acuminate; margin frequently sinuate towards the apex; midrib beneath often slightly verrucose; nerves 12-20 pairs, dense, straight, at c. 40-50 ; tertiary nerves densely scalariform, slender; petiole 3-4 cm long, rather long and slender, persistently hispid on the knee. Raceme to 15 cm long, terminal or axillary, terete, becoming angular on drying, simple or singly branched; bracteoles to 30 by 2.5 mm, linear, glabrous, caducous. Flowers distichous; buds to 5 by 0.8 cm. Calyx and corolla typical, calyx glabrous. Stamens 25, shorter than the style; filaments short; anthers narrowly oblong, tapering apically; appendage to connective tapering, glabrous, slightly shorter than the anther. Ovary ovoid-conical, glabrescent; stylopodium twice as long as ovary, narrowly cylindrical, densely tomentose; style half as long as stylopodium, narrowly cylindrical, glabrous. Fruit calyx entirely glabrous; tube to 3.5 cm diameter and long, obturbinate, tapering abruptly at the base and gradually to the 0.8-1.3 cm neck; 3 longer lobes 12-17 by 2-3 cm, oblong- lanceolate, obtuse, tapering to c. 5 mm broad at the base, prominently 3-nerved; shorter lobes 4-6 by 5-7 mm, deltoid, obtuse, undulate. (Flora Malesiana)",
    "Habitus":"tree",
    "Ecology":"Common lowland and occurs on clay soils in mixed dipterocarp forest on undulating land and hillsides below 800 m altitude.",
    "Distribution":"Endemic in Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dipterocarpus%20caudiferus-B848%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Dipterocarpus Lowii Hook.F",
    "Kolektor":"Wahyudi, A",
    "Description":"Twig, midrib and nerves below ? densely ? caducously shortly pale golden-yellow pubescent. Twig 2-3 by 5-10 mm 0, compressed, with broad swollen stipule scars. Leaf hud c. 1.5 by 0.9 cm, broadly conical, frequently falcate, obtuse. Stipule to 4 by 3 cm, broadly deltoid, acute. Leaves 15-20 by 6-10 cm, ovate-lanceolate, thickly coriaceous, strongly folded between the 15-20 pairs of prominent nerves; margin revolute; base obtuse or cordate; apex obtuse or with to 6 mm long narrow acumen; petiole 1.5-3 cm long, stout, often wrinkled on drying. Raceme to 3 cm long, short, stout, terminal or axillary terete, simple or singly branched, flowers distichous; hracteoles to 15 by 10 mm, elliptic to ovate, subacute, densely shortly pubescent outside, puberulent within, fugaceous. Flower bud to 4 by 1.2 cm. Calyx densely golden-yellow pubescent, wings prominently undulate. Corolla typical. Stamens c. 30. shorter than the style: filaments short; anthers narrowly oblong; appendage to connective somewhat shorter than anther, stout at base, tapering. Ovary ovoid-conical, tapering, densely pubescent; stylopodium narrowly cylindrical, pubescent, tapering to the somewhat shorter glabrous filiform style. Fruit calyx glabrescent, tube c. 4 cm long and (including wings), globose, completely hidden by the intricate folds of the 5 wings; 2 longer calyx lobes to 14 by 3.5 cm, broadly oblong, obtuse, somewhat revolute,  hardly constricted at the base, concurrent with the wings of the tube, with one long median nerve and two shorter laterals; 3 shorter lobes 1.5-2 by 2 cm, broadly ovate, recurved and concurrent with the wings. (Flora Malesiana)",
    "Habitus":"tree",
    "Ecology":"Occurs on well-drained, leached, usually sandy soils in lowland dipterocarp forest up to 400 m altitude. It is locally common on ultrabasic soil in Sabah.",
    "Distribution":"Peninsular Malaysia, Sumatra and Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dipterocarpus%20lowii-AW30%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8166667,1.133333333 ]
    },
    "properties": {
    "Species":"Dipterocarpus Cornutus Dyer",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 40 m tall, c. 50 cm diameter. Bark pale greyish. Twigs c. 1 cm diameter, somewhat compressed, stout, densely persistently puberulent. Stipules up to 20 cm long, up to 4 cm wide, strap-shaped, long tufted tomentose. Petioles 5-8.5 cm long, c. 4 mm diameter stout. Leaves broadly elliptic to oblong-ovate, 15-30 cm long, 7.5-18 cm wide, thickly leathery, cream beneath, base obtuse, acumen obtuse, secondary veins 18-21 pairs. Calyx and corolla typical, stamens 30, ovary ovoid, style stoutly columnar, densely hirsute at base. Fruits almost sessile, calyx tube to 2.5 cm long, up to 3.7 cm diameter, densely warty lenticellate, 5 prominent apical tubercles present, 2 longer calyx lobes up to 21 cm long, up to 5 cm wide, oblong, revolute at base, 3 shorter lobes up to 1.5 cm wide, more or less circular, revolute. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia.)",
    "Habitus":"tree",
    "Ecology":"In undisturbed mixed dipterocarp and lowland forests up to 1000 m altitude. Mostly on ridges with well drained sandy soils, usually undulating land, common.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dipterocarpus%20cornutus%20S3158.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.516666667 ]
    },
    "properties": {
    "Species":"Dipterocarpus Palembanicus Sloot. ssp. Borneensis P.S.Ashton",
    "Kolektor":"Wahyudi, A",
    "Description":"Differing from ssp. palembanicus as follows: Twig, petiole, midrib (both surfaces) and nerves beneath densely shortly chestnut pubescent, caducous on twigs; persistent, long, on bud, stipule and petiole; lamina fugaceous pubescent. Leaves 7-11 by 3-6 cm, oblong to ovate, with 12-14 pairs of nerves; petiole c. 1 5 mm long. Fruit calyx tube to 5.5 by 2 cm. wings to 15 mm broad, undulate, auriculate at base and apex. (Flora Malesiana)",
    "Habitus":"tree",
    "Ecology":"Local, mixed dipterocarp forest on hills, clay soils, to 650 m altitude and sometimes growing together with ssp. palembanicus.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Dipterocarpaceae-Dipterocarpus%20palembanicus%20Slooten.%20ssp.%20borneensis%20P.S.Ashton-AW14.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.1666667,2.533333333 ]
    },
    "properties": {
    "Species":"Dipterocarpus Stellatus Vesque",
    "Kolektor":"Wahyudi, A",
    "Description":"Young twig, raceme, leaf bud. stipule outside, midrib on both surfaces and petiole ? densely persistently long rust-brown tomentose, sparsely so on leaf nervation beneath. Twig to 7 mm diameter, ? angular, with an uneven cracked surface and large round petiole scars. Leaf bud 5-8 by 3-5 mm. spherical, obtuse. Stipule c. 2 by 0.8 cm, deltoid, acute. Leaves 20-25 by 12-16 cm, ovate, thinly coriaceous; base cordate; acumen to 14 mm long, nerves 12-16 pairs, well spaced, at c. 55?-60?; petiole 4-5 cm long. Raceme to 20 cm long, axillary, angular on drying, unbranched or singly branched. Flower bud to 6 by 2 cm, large. Calyx and corolla typical, calyx glabrous. Stamens c. 30, subequal; filaments slender, compressed at base, tapering; anthers linear, ? twice as long as filaments, expanded into small lateral knobs at base, tapering; appendage to connective filiform, as long as anther, reaching almost to style apex. Ovary small, ovoid; style c. 5 x length of ovary, stoutly filiform, densely pubescent at base, sparsely so distally, glabrous in the apical ?. Fruit sessile or on to 2 mm long stout pedicel. Fruit calyx tube to 5 by 2 cm. obconical. the nut enclosed in the distal half, the basal c. 1 .4 cm a narrow central axis on which the wings are fused; glabrous, smooth, c. 2.5 cm diameter at neck (including wings); wings c. 1.2 cm wide, thin, undulate, ? bent over on one side at maturity, continuous from the base to the calyx lobes; concurrent with the margins of the lobes; 2 longer lobes c. 12 by 3 cm, oblong, obtuse, with undulate margin at the c. 1 .7 cm wide base; with 3 parallel nerves, close to the centre, continuing to the apex; 3 shorter lobes c. 1 cm long and broad, deltoid, obtuse, with an undulate revolute margin. (Flora Malesiana)",
    "Habitus":"tree",
    "Ecology":"Hill forests, 500-800 m, local.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/10c7a43ceaee1348b6ccbdf11a6334a6.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.9166667,0.333333333 ]
    },
    "properties": {
    "Species":"Durio Acutifolius (Mast.) Kosterm.",
    "Kolektor":"Kessler",
    "Description":"Trees up to 28 m tall, sometimes more or less shrub-like, bole straight, up to 50 cm in diameter. Buttresses up to 5 m high, out 50 cm. Bark surface fissured and scaly, strips c. 5 mm wide, outer bark pale brown, inner bark 5-10 mm thick, brown, inside paler, fibrous. Sapwood dirty white, 5-10 cm thick, heartwood light brown. Twigs more scales. Stipules unknown. Leaves elliptic-oblong, 6-15 cm long, 3-6 cm wide, papery, base rounded, apex acuminate, acumen c. 10 mm long, upper surface glabrous, lower surface covered with red-brown scales, secondary veins 7-9 pairs, distinctly looping near the margin, veins prominent, tertiary venation indistinct below. Petioles 1.5-2.5 cm long. Flowers small, c. 1 cm in diameter, axillary, usually solitary, epicalyx splitting into 2 persistent lobes, calyx of 3 sepals, petals 5 or 6, linear, pale yellow, stamens and staminodes many, free, filaments pale yellow, anthers with a pore at the top, ovary ovoid, densely covered with scales and few stellate hairs, abruptly narrowed into a glabrous style, stigma glabrous. Fruits wine-red, spindle-shaped, up to 6 cm long, 3-celled, spines up to 4 mm long, pyramidal, dehiscent on the tree. Seeds glossy , black, aril dark glossy red, covering only the lower part of the seed (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"tree",
    "Ecology":"Lowland primary forest, common on the sandy soil along the East coast of Kalimantan, up to 450 m altitude.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Malvaceae-Durio%20acutifolius-PK2126%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8333333,1.133333333 ]
    },
    "properties": {
    "Species":"Durio Dulcis Becc.",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 40 m tall, bole straight, up to 4 m high, out 1.2 m, concave. Bark surface superficially fissured, rough, hardly peeling off in small rectangular pieces, outer bark dark red-brown, 1-5 mm thick, inner bark 10-25 mm thick, pale red-brown with white spots. Sapwood white with faint reddish tinge, c. 10 cm thick, heartwood dark brown red. Twigs angular with small brown scales. Stipules unknown. Leaves elliptic to almost obovate-elliptic, 7-15 cm long, 3-7.5 cm wide, papery to thinly leathery, base more or less acute, apex acuminate or abruptly acuminate, acumen slender up to 5 mm long, upper surface glabrous, glossy, lower surface covered with fimbriate scales, secondary veins 11-14 pairs, distinctly looping near the margin, secondary veins and tertiary venation prominent below. Petioles 1-2 cm long. Flowers medium-sized, 3-4.5 cm long, in clusters behind the leaves, epicalyx splitting into 2 lobes, calyx 3-5 lobed, petals 5, pink, stamens in bundles, anthers kidney-shaped, opening by a slit, ovary ovoid, densely covered with closely packed, large scales, abruptly narrowed into a stellate-haired style, stigma glabrous. Fruits dark brown red, glabular, 15-20 cm in diameter, spines up to 4 cm long, slender, dropping unopened. Seeds glossy chestnut-brown, completely enclosed in a red, edible aril (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"tree",
    "Ecology":"In lowland Dipterocarp forest up to 200 m altitude.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Malvaceae-Durio%20dulcis-S3128%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.45,1.416666667 ]
    },
    "properties": {
    "Species":"Dillenia Excelsa (Jack) Gilg",
    "Kolektor":"Arifin, Z",
    "Description":"Large trees up to 40 m tall, up to 75 cm in diameter. Bole straight, up to 20 m, buttresses absent, sometimes ribbed. Bark grey to grey-brown, scurfy with radial striations; inner bark fleshy coloured to light brown, sapwood pale creamy yellow, hearwood red to dark brown. Leaves leathery, elliptic to oblong, 15-30 cm long, 7-10 cm wide, above glossy, beneath glabrous to sparsely pubescent, apex rounded to acute or slightly acuminate, base acute, often unequal, secondary veins 10-13 pairs. Petioles 2-5 cm long, not winged. Inflorescence a 3-12 flowered raceme, flowers with 5 bright yellow petals, 8-10 cm in diameter, stamens purple in two distinct rows. Fruits dehiscent, outside red, inside white, seeds dark brown with red membarnous arils.",
    "Habitus":"tree",
    "Ecology":"Secondary Forest Trees of Kalimantan, Indonesia",
    "Distribution":"Malay Peninsula, Sumatera, Bangka, West Java, Philippines (Balabac Is.); Borneo: Sabah, Brunei, West, Central and East Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Dilleniaceae-Dillenia%20excelsa-AA3715%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.3833333,1.116666667 ]
    },
    "properties": {
    "Species":"Dryobalanops Lanceolata Burck",
    "Kolektor":"Sidiyasa, K",
    "Description":"Emergent trees up to 69 m tall and 230 cm diameter. Stem with resin. Leaf bud and stipule sometimes shortly fugaceous tomentose, otherwise entirely glabrous. Twigs 1.5-2 mm apically, slender, dotted with minute pale brown lenticels, smooth but for the prominent ribs above the lateral bundles of the petiole. Bud 4 by 1 mm, narrowly lanceolate. Stipule to 12 by 1 mm, narrowly lanceolate. Leaves 7-10 by 2-3.5 cm, lanceolate, thinly coriaceous, base cuneate, with revolute margin, acumen to 1 cm long, slender; margin frequently undulate; petiole c. 1 cm long, slender. Panicle to 6 cm long; terminal or axillary, ribbed and angular on drying, glabrous; simple or singly branched. Flower bud to 12 by 5 mm, fusiform, obtuse. Calyx glabrous; lobes subequal, lanceolate, obtuse. Corolla white; petals lanceolate, acute, glabrescent. Stamens c. 30, subequal, shorter than the style; filaments compressed, slender, tapering, united at base; anthers linear; appendage to connective short, hardly exceeding anther apex. Ovary small, ovoid, glabrous; style filiform, c. 3 times length of ovary, glabrous. Fruit calyx with to 2 cm diameter, to 5 mm deep, shallow cup at base, impressed at the pedicel; with a shallow tubercle at the base of each calyx lobe; lobes to 9 by 2 cm, spatulate, equal, obtuse, tapering gradually to a 3-5 mm broad base. Nut to 2 cm long and diameter, ovoid to globose, glabrous, subacute. (Flora Malesiana)",
    "Habitus":"tree",
    "Ecology":"Widespread on fertile clay-rich soils, abundant on undulating land on basic volcanics and calcareous shale to 700 m.",
    "Distribution":"Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Dryobalanops%20lanceolata-S4601%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.016666667 ]
    },
    "properties": {
    "Species":"Elaeocarpus Cupreus Merr.",
    "Kolektor":"Ambri & Arifin",
    "Description":"Tree up to 25 m tall, up to 20 cm in diameter. Buttresses steep. Bark light brown to greyish, smooth, inner bark pale orange, yellow or brown, granular, sapwood yellowish. Petioles 2.5-6 cm long, thickened at apex. Stipules linear. Leaves elliptic, 9-17 cm long, 3-7.5 cm wide, base wedge-shaped, apex acuminate, velvety, margin vaguely toothed, secondary veins 9-12 pairs, tertiary veins transverse. Racemes 9-13 cm long. Flowers 5-merous, small, c. 7 mm in diameter, petals c.7 mm long, hairy all over, not divided into segments, stamens more than 40, ovary hairy. Fruits ellipsoid, c. 1.2 cm long, c. 0.9 cm in diameter, smooth, glabrous (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"tree",
    "Ecology":"In primary and rarely in secondary lowland forest",
    "Distribution":"Sarawak, Brunei Darussalam, Sabah, East and North Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Elaeocarpaceae-Elaeocarpus%20cupreus-W695%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.0163889,1.010277778 ]
    },
    "properties": {
    "Species":"Enderita Spectabilis Steenis & de Wit",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 20-35 (-80) m high, 37-50 (100) cm in diam., not or hardly buttressed. Leaves 2-4-jugate; petiole and rachis 7-24 cm long, glabrous. Leaflest chartaceous to subcoriaceous, elliptic, ovate, or broadly elliptic, sometimes obovate, 10-23 by 5-9.6 cm; apex shortly acuminate or acuminate, sometimes caudate; base obtuse, rotund, or slightly cunuate, rarely attenuate; glabrous on both surfaces; nerves 7-9 per side; veins obscurely reticulate on both surfaces; petiolules 5-8 (-11) mm. Inflorescences usually 10-20 (-26) cm long, puberulous; bracts and bracteoles triangular or deltoid, c. 1 mm long; pedicles 4-12 mm, articulated at the apical end. Hypantium 4-7 mm long, puberulous outside, subglabrous inside. Petals white or light yellowish when young, then red orange, suborbicular, obovate, flabellate, 4.5-5 by 2.5-4 mm, with distinctlateral veins, clawed at the basal part (c. 1 mm long), glabrous except ciliate on the margin. Stamens and staminodes 1.5-8 mm. Ovary 3 mm long, hirsute to densely lanate, sometimes only along the sutures, glabrescent or glabrous in the central part; style 4.5 -5.5 mm. Pods up to 26 (or more) by 4-7 cm, distinctly veined when young, smooth or nearly so when  old. Seeds 3-4.2 by 3 cm (Flora Malesiana).",
    "Habitus":"tree",
    "Ecology":"In lowland forest, sometimes found occurring on sandy, laom soil, or on limestone, up to 1000 m atlitude.",
    "Distribution":"Malesia: Borneo (Kalimantan).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Fabaceae-Endertia%20spectabilis-S3578%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.014215278 ]
    },
    "properties": {
    "Species":"Endospermum Diadenum (Miq.) Airy Shaw",
    "Kolektor":"Ambriansyah & Arifin",
    "Description":"Tree 15-35 m tall, 30-65 cm in diameter. (Adult) leaves never peltate, lamina obovate to broadly ovate, 7-25 cm long, 4-22 cm wide, base acute, truncate, rounded to heart-shaped, apex rounded to acute, palmately 3-9 veined, with or without glands at the secondary vein junctions beneath, not soft-hairy to touch. Petioles 5-25 cm long, often with 2 prominent glands at apex. Inflorescence simple. Fruits round or bilobed, fineliy yellowish velvety, wll with white sap.",
    "Habitus":"tree",
    "Ecology":"Secondary Forest Trees of Kalimantan, Indonesia",
    "Distribution":"Peninsular Thailand, Malay Peninsula, Sumatra; Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Endospermum%20diadenum-AA1689%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115,0.027777778 ]
    },
    "properties": {
    "Species":"Ficus Midotis Corner",
    "Kolektor":"Van Valkenburg",
    "Description":"Dioceous tree, up to 10 m tall (or epiphyte). Twigs up to 0.25 cm thick, yellowish brown. Stipules linear or lanceolate, up to 1.2 cm long, caducous.  Leaves spirally arranged, thin-coriaceous, glabrous, rough to the touch; ovate to elliptic or oblong, 8.5-18x2.5-8 cm, base symmetrical and cuneate, or asymmetrical and with tiny auricle on one side, margin faintly lobed or toothed or entire and plane, apex caudate, acumen 1-4.5 cm long; midrib flat or rarely raised below, sharply keeled below; lateral veins 5-7 pairs, well-spaced, curved, with short veins in between, raised below, faint or rarely sunken above, basal pair extending up to 1/3 the length of the blade, with a gland in the axils of one or both of the veins; intercostal venation reticulate, faint on both surfaces; petiole 0.3-1 cm long. Syconia paired or in clusters, axillary or borne on twigs behind the leaves or on stem, ripening yellow to red, subglobose, 0.16-1 cm diameter, apex umbonate; peduncle 0.3-2.5 cm long; basal bracts 1-2, minute, lateral bracts absent; internal bristles absent or few, minute. Tepals 5-7, whitish, oblong, puberlous, slightly united at the base. Achenes oblong, c. 1.5 mm long, somewhat compressed, keeled at the apex (Tree Flora of Sabah and Sarawak).",
    "Habitus":"tree",
    "Ecology":"In lowland mixed dipterocarp to upper montane forests, up to 2800 m altitude",
    "Distribution":"Endemic to Borneo. Uncommon in Sabah and Sarawak. Not known in Brunei and Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Moraceae-Ficus%20midotys-JVV1147%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0083178,0.005683611 ]
    },
    "properties": {
    "Species":"Flagellaria Indica L.",
    "Kolektor":"Arifin & Ambriansyah",
    "Description":"",
    "Habitus":"",
    "Ecology":"Flora Malesiana 4",
    "Distribution":"Cambodia, India, Indonesia, Japan (Ryukyu Islands), Malaysia, Myanmar, New Guinea, Philippines, Sri Lanka, Thailand, Vietnam; Africa, Australia, Pacific Islands",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Flagellariaceae-Flagellaria%20indica-AA1640%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,1.1 ]
    },
    "properties": {
    "Species":"Fagraea Racemosa Jack Ex Wall.",
    "Kolektor":"Mulyani",
    "Description":"Tress 5-8(-15 m tall, up to 30 cm in diameter. Leaves simple, opposite, entire, broadly ovate to elliptic, obovate-oblong, 15-30 cm long, 8-15 cm wide, leathery,base wedge-shaped to rounded, often distinctly heard-shaped, apex acute or acuminate, secondary veins 4-12 pairs, sunken above. Petioles 0.25-5 cm, usually stout. Stipules fused intoring-like, up to 0.75 cm high ochrea, which claps the twig. Inflorescence terminal, oten drooping, 2-60 cm long (including the 1-30 cm long stalk). Flowers actinomorphic, biosexual, 5 merous, calyx bell-shaped to almost globular, corolla tube 2-4 cm long, white, funnel-shaped, lobes overlapping, stamens inserted on corolla tube,ovary superior. Fruit a many-seeded berry with sticky exudate in the outer skin, up to 2 cm long.",
    "Habitus":"Tree",
    "Ecology":"0",
    "Distribution":"Indochina, Tahiland, Malay Peninsula, Sumatra, Borneo, Maluku, New guinea.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Gentianaceae-Fagraea%20racemosa-MS4%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0166667,0.000416667 ]
    },
    "properties": {
    "Species":"Fordia Splendidissima (Blume ex Miq.) Buijsen",
    "Kolektor":"Arifin",
    "Description":"Shrubs, treelets or trees up to 30 m tall, up to 30 cm in diameter. Bark smooth, whitish or grey to blackish, inner bark whitish, wood yellow. Stipules falling off early. Leaves alternate, compound, leaflets opposite, penni-veined, whitish to golden shiny below caused by tiny hairs. Rhachis 5.5-55 cm long, number or leaflets (-5)7-17(-27) cm, opposite, leaflets narrowly ovate to narrowly obovate ro ovate to obovate, 3-31 cm long,1-13 cm wide, glabrous or silky hairy, base rounded to acute , apex acuminate to caudate, secondary veins 4-19 pairs. Inflorescences in racemes, 3.5-40 cm long. Flowers 7-13 mm long, ca. 15 mm diameter, reddish purple. Fruits falcate, 4-15.5 cm long, 1.3-3 cm wide,  green, dehiscent, flattened pods. Seeds 5-14 mm long, 6-19 mm thick (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Secondary Forest Trees of Kalimantan, Indonesia.",
    "Distribution":"Endemic in Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Fabaceae-Fordia%20splendidissima-AA2118%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0138889,1.002222222 ]
    },
    "properties": {
    "Species":"Gluta Macrocarpsa (Engl.) Ding Hou",
    "Kolektor":"Sidiyasa, K",
    "Description":"A medium-sized to large tree up to 45 m tall, with bole up to 80 cm in diameter, buttresses occasionally present, up to 6 m high, bark surface smooth or scaly, reddish-grey; leaves elliptical-oblong to elliptical-lanceolate or obovate-oblong 8-9 cm x 3-8.5 cm, rounded to shortly acuminate at apex, glabrous, with 10-15 pairs of secondary veins, petiole up to 3 cm long; flowers with circumscissile calyx, petals 4-7 mm long, white, yellow at base, torus subglobose, c. 1 mm in diameter, staments (15-)20(-28), ovary glabrous; fruit subglobose, up to 4 cm in diameter, brownish, to purplish-black, smooth, with stalk up to 3 mm long, enlarged petals sometimes present, up to 15(-30) mm long; cotyledons free (Prosea).",
    "Habitus":"Tree",
    "Ecology":"In primary mixed dipterocarp forest up to 1200 m altitude, often on ridges, also on limestone and sandy soils.",
    "Distribution":"Peninsular Malaysia and Borneo (Sarawak, Sabah and East Kalimantan).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Anacardiaceae-Gluta%20macrocarpa-S3072%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 114.9,0.033333333 ]
    },
    "properties": {
    "Species":"Gonocaryum Minus Sleumer",
    "Kolektor":"Kessler",
    "Description":"Treelet up to 12 m, rarely tree up to 30 m, trunk up to 18 cm ?; Branchlets obtus-angular, very slender, glabrescent. Leaves elliptic-oblong, subcaudate-acuminate for 5-15 mm, tip blunt, base broadly cuneate or obtuse, subcori-aceous, glabrous, paler and often yellowish-green beneath in dry specimens, 6-12 by 3-4(-5) cm, midrib slightly impressed towards the base of the lamina above, prominent beneath, nerves 4-5 irregular pairs, suberect, a little raised on both faces, reticulation of veins and veinlets dense and finely raised above, generally less so beneath; Petals greenish, connate to a tube 4 by 1-1.5 mm, free and erecto-patent for the distal 1 mm. Ovary ovoid, densely short-hairy (Flora Malesiana).",
    "Habitus":"Tree",
    "Ecology":"Primary dipterocarps and old secondary forest, hilly sometimes intermixed with kerangas (Perenget) forest patches",
    "Distribution":"Malesia: Borneo (northern part).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Cardiopteridaceae-Gonocaryum%20minus-PK2503%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,0.000441667 ]
    },
    "properties": {
    "Species":"Gymnacranthera Ocellata R.T.A Schouten",
    "Kolektor":"Kessler",
    "Description":"Tree up to 25 m tall. Bark smooth or fissured or regularly cracked, sometimes flaky, grey to dark red-brown; inner bark 10-15 mm thick, brown. Sapwood whitish streaked with pale red; heartwood light brown to blackish brown. Twigs usually angular or compressed, stout, towards apex 2-3.5(-5) mm diameter, tomentose with apressed hairs c. 0.2 mm long, glabrescent; bark usually grey, smooth or finely cracked, including that of apical portion of the twig densely set with conspicuous lenticels of mixed sizes; at base of each seasonal shoot with distinct scars of cataphylls of bud scales. Terminal leaf buds rather stout, c. 10x3 mm, densely appressed pubescent. Leaves chartaceous or thinly coriaceous, upper surface drying olivaceous, often shining, lower surface with distinct more or less spaced appressed rusty brown hairs less than 0.5 mm long, glabrescent, grey-brown; ovate-elliptic to lanceolate, 10-25x4-9.5 cm, base short-attenuate to broadly rounded, margin plane, apex acute; midrib flat above; lateral veins 11-18 pairs, flat to slightly raised above, distinct but not prominent beneath, at an angle of c. 45 derajat with the midrib in the middle of the leaf; intercostal venation indistinct on both surfaces; petiole 0.9-1.8 cm long, 0.2-0.3 cm thick. Inflorescences broadly paniculate, pubescent with rusty hairs 0.3-0.5 mm long; bract c. 2.5x3 mm, caducous; males 3-8.5 cm long, many flowered; females up to 2 cm long, few-flowered. Flowers rusty pubescent on both sides with hairs 0.1(-0.2) mm long. Male flowers: pedicel 1.5-3.5 mm long; buds ellipsoid-oblong, 3-4(-5) mm long; perianth 3-4-lobed, at anthesis clefts to 1/3-1/2, tube 2-2.5 mm long; androecium more or less truncately ellipsoid, subsessile, 1.5-2.3 mm long; anthers 7-10, the free apices 0.4-0.5 mm long, more or less erect. Female flowers : Pedicel 1.5-2.5 mm long; buds narrowly ovoid, 2.7-3 mm long; ovary 1.2-1.5 mm diameter, minutely pubescent, stigma shallowly 2-lobed. Fruits 4-10 per infructescence, ovoid-ellipsoid with truncate base, 1.8-2.2x1.1-1.3 cm, short-pubescent with hairs 0.1-0.2 mm long, glabrescent; pericarp 0.7-1.3 mm thick; stalk 0.3-0.7 cm long",
    "Habitus":"Tree",
    "Ecology":"In primary well-drained forest on low hills and ridges, usually in lowland Dipterocarp forest, but also from kerangas kerangas forest, on tuff, sandy and sandy loam soils, up to 1300 m altitude. Flowering mainly in June-November; fruiting in July-December",
    "Distribution":"Endemic to Borneo (Sabah, Sarawak, Brunei, and Kalimantan)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Gymnacranthera%20ocellata-B872%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0055556,1.000277778 ]
    },
    "properties": {
    "Species":"Glochidion Calospermum Airy Shaw",
    "Kolektor":"Kessler",
    "Description":"Treelet or shrub up to 6 m tall and 7 cm dbh. Twigs up to 6 mm thick. Stipules very narrow, persistent, c. 2 cm long, acute. Leaves oblong or oblong-elliptic, 17-33 cm long, 5-9 cm wide, base rounded to wedge-shaped, apex acute to acuminate, coarsely hirsute to strigose beneath, secondary veins impressed, 10-15 pairs, looping c. 4 mm before the margin. Petioles c. 5 mm long, c. 3 mm in diameter, simple, penni-veined, hairy below, strong venation. Petioles c. 5 mm long, c. 3 mm in diameter. Flowers ca. 4 mm diameter, green-yellowish, placed in axillary bundles. Fruits ca. 12 mm long, pink-red, dehiscent capsules, seeds c. 5 mm long, orange red.",
    "Habitus":"Tree",
    "Ecology":"Undisturbed mixed dipterocarp and sub-montane forests up to 1700 m altitude. Mostly on hillsides and ridges with sandy soils, but also on limestone. In primary and secondary forests usually present as a pre-disturbance remnant tree.",
    "Distribution":"Endemic in Borneo, Sarawak, Sabah, West and East Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Phyllanthaceae-Glochidion%20calospermum-PK2877%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.016666667 ]
    },
    "properties": {
    "Species":"Gonystylus Consanguineus Airy Shaw",
    "Kolektor":"Ambri & Arifin",
    "Description":"A medium-sized to fairly large tree up to 40 m tall, bole brachless for up to 30 m, up to 40 m tall, bole branchless for up to 30 m, up to 80 cm diameter, fluted at base and with small buttresess, bark surface not fissured, smooth or with elongated scales, red-brown to dark brown, inner bark laminated, cream to ochre, sapwood pale yellow. Stipules absent. Leaves elliptical to oblong, 10-25 cm x 5-9 cm, broadly cuneate at base, abruptly caudate-acuminate at apex, glabrous or sparsely hairy on the midrib below, petiole 7-12 mm long. Inflorescence 10-14 cm long; calyx lobes finally reflexed, petals about 30, small, glabrous, brownish, placed in short panicles. Fruits ca. 44 mm diameter, green-brown, dehiscent capsule, exposing seeds with white aril.",
    "Habitus":"tree",
    "Ecology":"In undisturbed mixed dipterocarp forests and secondary forests usually present as a pre-disturbance remnant. Mostly on hillsides with sandy soils, loamy or clayey soils or also on limestone rocks, sometimes in periodically inundated locations, up to 400 m altitude.",
    "Distribution":"Borneo (Sarawak, Sabah, West- and East-Kalimantan).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Thymelaeaceae-Gonystylus%20consanguineus-W673%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0049269,2.004286389 ]
    },
    "properties": {
    "Species":"Goniothalamus Macriphyllus (Blume) Hook.f. & Thomson",
    "Kolektor":"Ambriansyah",
    "Description":"Sumatra, Peninsular Malaysia, Java and Borneo. In Borneo recorded from Sarawak and Kalimantan.",
    "Habitus":"tree",
    "Ecology":"Tree Flora of Sabah and Sarawak Volume 8",
    "Distribution":"Sumatra, Peninsular Malaysia, Java and Borneo. In Borneo recorded from Sarawak and Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Annonaceae-Goniothalamus%20macrophyllus-B428%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0049269,2.001519722 ]
    },
    "properties": {
    "Species":"Gluta Curtisii (Oliv.) Ding Hou",
    "Kolektor":"Arifin, Z",
    "Description":"A medium-sized tree up to 30(-34) m tall, with bole up to 70(-80) cm in diameter, buttresses usually small or absent, sometimes up to 2.5 m high, bark surface scaly,sometimes also dippled, usualy orange-red, inner bark reddish; leaves elliptical-oblong or oblanceolate, 5-14 cm x 2.5-5 cm, rounded, obtuse or shortly acuminate at apex (rarely emarginate), glabrous, with 6-14(-18) pairs of secondary veins, petiole up to 2.5 cm long; flowers with circumscissile calyx, petals 4.5-6 mm long, white or pale lilac, torus subglobose, c. 1 mm in diameter, staments (8-)10, ovary glabrous; fruit subglobose, c. 1 cm in diameter, with a c. 10 mm long stalk, with enlarged petals up to 9 cm long; cotyledons free (Prosea).",
    "Habitus":"tree",
    "Ecology":"Locally frequently in lowland mixed rain forest up to 1200 m altitude, most commonly on ridges at 300-700 m. The density of the wood is 620-945 kg/m3 at 15% moisture content.",
    "Distribution":"Peninsular Malaysia.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Anacardiaceae-Gluta%20curtisii-B576%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 114.8666667,0.066666667 ]
    },
    "properties": {
    "Species":"Hopea Bracteata Burck",
    "Kolektor":"Kessler",
    "Description":"Small, occasionally medium sized, tree. Twig, leaf bud. stipule and petiole shortly persistently greybrown puberulent. Twig to 0.7 mm diameter apically, slender, terete, much branched, becoming smooth, glabrous. Bud to 2.5 mm long, lanceolate. Stipule to 3 mm long, linear, fugaceous. Leaves 2.5-6 by 0.7-2 cm, thin, narrowly ovate, base cuneate; acumen to 1 .5 cm long; nerves c. 1 1 pairs, slender, hardly more distinct than secondaries, at 55?-65?, strongly curved; tertiary nerves slender, reticulate; midrib slender but raised beneath, narrow, depressed above; petiole 2-4 mm long, slender. Panicle to 9 cm long, terminal or axillary, very slender, lax. terete, glabrous; remotely irregularly singly or doubly branched, branchlets to 3 cm long, zigzag, bearing to 5 flowers; bracteoles to 1 mm long, deltoid, glabrous. Bud to 3 mm long, subglobose, distinctly pedicellate. Calyx lobes fimbriate, otherwise glabrous; outer lobes suborbicular, thin; inner lobes suborbicular, mucronate, thin. Petals oblong, acute, densely shortly tomentose on parts exposed in bud. dark red with pale tips. Stamens 15; filaments broad at base, tapering; anthers subglobose; appendage to connective c. 2 times length of anther, slender, joining abruptly with the distinctly broader connective and filament. Ovary and stylopodium glabrous, cylindrical, truncate, ovary only slightly the broader; style short, abrupt, glabrous. Fruit entirely glabrous. Calyx lobes to 5 by 5 mm, subequal, broadly ovate, obtuse, incrassate at base but for a chartaceous margin. Nut to 9 by 6 mm, ovoid; apex minutely truncate. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Locally abundant on spurs and ridges below 650 m altitude.",
    "Distribution":"Peninsular Malaysia and Borneo (Sarawak, Brunei, Sabah, south-eastern Kalimantan).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Hopea%20bracteata-PK2609%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.05 ]
    },
    "properties": {
    "Species":"Hopea Dryobalanoides Miq",
    "Kolektor":"Wahyudi, A.",
    "Description":"Trees up 50 m tall, c. 70 cm diameter. Bole cylindrical. Buttesses thin, steep, stiltroots present. Bark flaky or slightly fissured, inner bark pale brown, tinged pink, slightly lamellate, sapwood pale yellow. Damar often in tear-like stalactitic exudations, pale yellow. Twigs terete, glabrous. Stipules up to 2 mm long, falling off early. Petioles 5-10 mm long. Leaves ovate-lanceolate. 5-12 cm long, 1.5-4.5 cm wide, thinly leathery, base wedge-shaped, almost equal, apex long pointed up to 2 cm long, secondary veins 8-12 pairs, usually with scattered domatia. Flowers: 2 outer calyx lobes ovate, 3 inner lobes more or less circular, petals narrowly lanceolate, stamens 15, ovary ovoid, glabrous, style short, base setose. Fruit calyx glabrous, 2 longer lobes up to 6.5 cm long, c. 1.5 cm wide, spatula-shaped, pronouncedly twisted, 3 shorter lobes up to 8 mm long, c. 6 mm wide, base saccate, nut broadly ovoid, up to 10 mm long, c. 8 mm diameter, glabrous. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 600 m altitude. Mostly on hillsides and ridges, but also on alluvial sites. Usually on clay soils, but also growing on sand. Widespread, locally frequent, clay-rich fertile soils on undulating or well drained flat land, or ridges; common on basalt and intermediate igneous and volcanic rocks on slopes and ridges.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo, Philippines.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Hopea%20dryobalanoides-AW61%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0138889,1.002222222 ]
    },
    "properties": {
    "Species":"Hopea Mengerawan Miq.",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 50 m, up to 75 cm in diamter. Bole straight, flying buttresses 1-3 m high. Bark fissured, dark brown to black, outer bark thick, lamellate, inner bark light brown, tinged pink, sapwood pale. Damar yellow. Twigs terete, smooth. Stipules falling off early, becoming markedly recurved before falling. Petioles 9-20 mm long. Leaves elliptic to ovate, 10-15 cm long, 5-7 cm wide, leathery, drying yellowish brown, base broadly wedge-shaped, acumen up to 1.5 cm long, venation dryobalanoid, secondary veins many (more than 20). Calyx patent, petals sericeous on parts exposed in bud, stamens 15, ovary ovoid, glabrous, style long, villous at base. Fruits: pedicel to 2 mm long, 2 longer calyx lobes up to 7 cm long, c. 12 mm wide, 3 shorter ones to 6 mm long, nut glabrous, narrowly ovoid, apiculate. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed or In lowland dipterocarp forest on flat land and base of hills up to 500 m altitude. Usually on ridges and hillsides with poor sandy to clayey soils, also on ultrabasic.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Hopea%20mengerawan-S3174%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.016666667 ]
    },
    "properties": {
    "Species":"Hopea Ferruginea Parijs",
    "Kolektor":"Ambriansyah",
    "Description":"Upper canopy tree up to 41 m tall and 59 cm diameter. Medium-sized flaky barked tree with stilt roots and living buttresses. Stem with resin. Twig endings, petioles, midrib above and panicles densely +/- persistently greyish puberulent, petals outside densely cream pubescent. Twig c. 1 mm diameter apically, terete, becoming dark brown, smooth; internodes short; stipule scars obscure. Leaf hud minute; stipules minute, fugaceous. Leaves 4.5-7.5 by 1.5-4 cm, ovate to lanceolate, subcoriaceous; base cuneate, shortly decurrent; acumen to 1.5 cm long, slender, caudate; nervation dryobalanoid, main nerves c. 14 pairs with many subequal secondaries, distinct and frequently with +/- prominent axillary pubescent domatia especially in young trees; midrib slender but distinctly elevated on both surfaces; petiole 6-10 mm long, slender. Panicles to 2 cm long, axillary, slender, short, with to 8 mm long short branchlets bearing to 4 secund pale yellow flowers. Flower bud to 3 by 2 mm, ellipsoid. Sepals ovate, the 3 outer somewhat longer, acute or subacuminate, the inner acute. Stamens 15, unequal; filaments broadly compressed at base, tapering and filiform distally; appendage very slender, c. twice length of the subglobose anthers. Ovary ovoid, style somewhat longer, columnar, tapering, villous towards base. Fruit pedicel to 2 cm long, very slender; 2 longer fruit calyx lobes to 3 by 0.5 cm, spatulate, narrowly obtuse, c. 1.5 cm broad above the to 4 by 2.5 mm ovate saccate thickened base; 3 shorter lobes to 8 by 4 mm, ovate-acuminate, closely enveloping nut. Nut to 7 by 4 mm, ovoid, apiculate. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 1500 m altitude. Mostly on hillsides and ridges, but also on alluvial sites. On clayey to sandy soils, also on limestone and ultramafic soils. Usually on deep fertile soils.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo, Philippines.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Hopea%20ferruginea-AA1374%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Hopea Pachycarpa (Heim) Symington",
    "Kolektor":"Wahyudi, A.",
    "Description":"Young twig, leaf bud. stipule outside (glabrous within) and petiole shortly persistently pale fawn tomentose; leaf glabrous. Twig to 2 mm diameter apically, terete, becoming smooth. Bud to 2.5 by 2 mm, ovoid to globose. Stipule to 4 mm long, linear, fugaceous. Leaves 13-22 by 4-7 cm, thinly coriaceous, elliptic to lanceolate, with or without silvery lepidote undersurface; base subequal. cuneate on one side, obtuse on the other; acumen to 1 cm long, narrow; nerves (10-) 13-17 pairs, slender but distinctly raised beneath, at 45?-55? but curving round to run parallel to the margin before terminating at it, with small tomentose domatia; tertiary nerves slender, densely scalariform, sinuate, diagonal to nerves; midrib rounded, raised on both surfaces; petiole 7-10 mm long, short, stout. Panicle to 8 cm long, axillary to ramiflorous, terete, puberulent or glabrescent. to 2-axillary, rarely branched; bracteoles to 2 mm long, linear, not at first caducous. Flower hud to 4 by 2.5 mm, broadly ellipsoid. Calyx glabrous but for the fimbriate margin; 2 outer lobes broadly ovate, sub acute; 3 inner lobes broader, slightly shorter, subacu minate. Petals broadly oblong, glabrescent, strongly contorted in bud. Stamens 15, in 3 unequal verticils, the 5 inner an anthefs length longer than the 10 outer; filaments broad at base, tapering, filiform distally; anthers subglobose; appendage to connective slender, 2-3 times length of anther, glabrous. Ovary small, ovoid, glabrous; style and stylopodium spindle shaped, glandular-papillose towards apex, tapering into short glabrous style. Fruit entirely glabrous. 5 calyx lobes subequal. to 2 by 1.5 cm, ovate, subacute, thickened, deeply saccate, closely adpressed to nut; apex of nut visible only at 5 mm diameter apical gap. Nut to 1.5 cm diameter, subglobose; style remnant short, abrupt, acute. (Flora Malesiana)",
    "Habitus":"tree",
    "Ecology":"Locally abundant on moist soils on lower hillsides and alluvium in Mixed Dipterocarp forest.",
    "Distribution":"Malaysia, Central and West Sumatra, Sarawak, Brunei, Central and East Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Hopea%20pachycarpa%20AW13.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0049269,0.034853056 ]
    },
    "properties": {
    "Species":"Hopea Kerangaensis P.S.Ashton",
    "Kolektor":"Kessler & Arifin",
    "Description":"Medium-sized smooth barked tree with thin flying buttresses. Twigs, petiole, buds, midrib above and domatia beneath shortly evenly persistently pale tawny pubescent, sometimes glabrescent. Twig c. 1 mm diameter apically, much branched, terete, becoming smooth. Bud to 1 mm, minute, globose. Stipule fugaceous. Leaves 1.5-4.5 by 1-3 cm, small, ovate, chartaceous, with broadly cuneate base; acumen to 1 cm long, caudate; nervation dryobalanoid, obscure, main nerves c. 6 pairs: midrib slightly depressed above, slender but prominent beneath, with to 6 pairs of prominent large pale fulvous pubescent domatia; petiole 3-5 mm long, slender. Panicle to 12 mm long, axillary, small, terete, sparsely buff puberulous; singly branched, branchlets to 4 mm long, bearing to 3 distichous flowers; bracteoles minute, linear, fugaceous. Flower bud c. 1 .5 by 1 mm, ovoid. Sepals ovate, acuminate, glabrous; the inner 3 shorter, relatively narrower at apex, relatively broader medially, than the outer. Petals lanceolate, puberulent on parts exposed in bud. Stamens 15, in 3 unequal verticils; filaments compressed at base, tapering and filiform below the subglobose anthers; appendage to connective slender, 2-3 times length of anther, reaching almost to style apex at anthesis. Ovary ovoid, glabrous; style as long as ovary, columnar, tapering. Fruit glabrous. Pedicel to 1 mm long, short. Calyx lobes to 6 by 5 mm, subequal, ovate, acute, saccate, thickened, the 2 outer shorter, narrower and more incrassate than the 3 inner. Nut to 8 by 5 mm, ovoid, subacute. (Flora Malesiana)",
    "Habitus":"tree",
    "Ecology":"Very local; there abundant, on leached soil in Mixed Dipterocarp and Heath forests on low hills.",
    "Distribution":"Malaya (Pahang. Trengganu); Sumatra (Indragiri); Borneo (Sarawak west of the Lupar; Central and East Kalimantan: Upper Barito).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Hopea%20kerangensis-B521%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0055556,0.015833333 ]
    },
    "properties": {
    "Species":"Hopea Rudiformis P.S.Ashton",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 35 m tall, c. 50 cm diameter. Bark flaky, buttresses thin, sometimes stiltroots present. Twigs terete, pale tawny puberulent. Stipules dropped early (unknown). Petioles 8-13 mm long. Leaves ovate to broadly lanceolate, 6,5-14 cm long, 3.5-7.5 cm wide, thinly leathery, glabrescent, base broadly wedge-shaped, apex acuminate, acumen c. 1.5 cm long, venation ladder-like, veins 11-13 pairs. Flowers: stamens 15, ovary ovoid, style short, base ciliate. Fruit glabrous, 2 longer calyx lobes up to 9 cm long, 2 cm wide, broadly spatula-shaped, base saccate, 3 shorter lobes up to 8 mm long, up to 8 mm wide, ovate, reaching apex of nut and appressed to it, nut to 8 mm long, up  to 8 mm diameter, ovoid. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"",
    "Distribution":"Endemic in Sabah and Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Hopea%20rudiformis-S3862%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.016666667 ]
    },
    "properties": {
    "Species":"Horsfieldia Motleyi Warb",
    "Kolektor":"Ambri & Arifin",
    "Description":"Tree up to 25 m tall; bole sometimes with steep buttresses up to 5 m high, c. 30 cm out, c. 10 cm thick. Bark usually distinctly fissured, often scaly, strips 3-4 cm wide, up to 10 cm thick, dark brown, chocolate, or red-brown; inner bark 10-12 mm thick, undulate in cross section, dark brown or brown-red, laminated; sap red, watery or sometimes sticky, appearing fast. Sapwood whitish, reddish white; heartwood reddish or pinkish or brown. Twigs terete, towards apex(2.5-)3-5(-10) mm diameter; at first rusty tomentose with hairs 0.5(-1) mm long, late-glabrescent; lenticels not conspicuous; older twigs not flaky. Leaf buds 15-20 mm long, pubescent with hairs c. 0.5 mm long. Leaves distichous, membranous, surface not scabrous, upper surface drying olivaceous to brown, glabrous not bullate, lower surface rather densely tomentose with persistent hairs 0.3-1 mm long, without blackish dots or streaks; elliptic to oblong, 9-27x4-12 cm, base rounded to attenuate, apex somewhat obtuse to acute-acuminate; midrib flattish above, sometimes late-glabrescent; lateral veins 9-21 pairs, above late-glabrescent, usually sunken; petiole 1.3-2.2 cm long, late-glabrescent. Inflorescences yellow-brown to rusty pubescent with hairs 0.5-1 mm long; bract 2-5 mm long, caducous; males 12-20x10-14 cm, peduncle 20-40 mm long; females 3-6(-10) cm long. Flowers : perianth 3-lobed; pedicel at base not articulated; persistent pubescence comprising hairs 0.1-0.3 mm long. Male flowers : pedicel 1-1.5 mm long; buds subglobose or broadly obovoid, 0.8-1x0.7-1 mm; perianth at anthesis clefts to about halfway; androecium (including androphore) depressed obovoid, 0.5-0.7x(0.3-)0.5-0.6 mm; anthers 5, almost sessile, 0.2-0.4 mm long, column with apical cavity to c. 1/10 deep; androphore conspicuous, about as long as the anthers. Female flowers pubescent; buds c. 2.4x1.8-2 mm; ovary glabrous. Fruits 5-15 per infructescence, broadly ellipsoid, 1.9-2.3x1.6-1.8 cm, glabrous; dry pericarp c. 3 mm thick; stalk 2-4 mm long; perianth not persistent. Seeds ellipsoid (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In various types of primary and disturbed mixed dipterocarp forest on well-drained sandy or sandy clays soils, often on ridge tops, up to 750 m altitude. Flowering and fruiting troughout the year",
    "Distribution":"Endemic to Borneo (Sabah, Sarawak and Kalimantan)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Horsfieldia%20motleyi-W806%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.016666667 ]
    },
    "properties": {
    "Species":"Horsfieldia Reticulata Warb",
    "Kolektor":"Ambri & Arifin",
    "Description":"Tree up to 20 m tall. Bark rough, dark brown, lenticellate; inner bark red. Twigs terete, not ridged, towards apex 2.5-6(-9) mm diameter, tomentose with hairs 0.5-1 mm long, late-glabrescent; bark when old dark grey, cracked but not flaky; lenticels inconspicuous. Leaf buds 10-15 mm long, pubescent with hairs 0.5-1 mm long. Leaves distichous, membranous or chartaceous, both surfaces not scarbous, sometimes bullate, upper surface drying brown, glabrous, lower surface sparsely tomentose with subpersistent, mixed sessile and dendroid hairs 0.5-1 mm long, without blackish dots or streaks; elliptic-oblong to lanceolate, 18-35x4-11 cm, base rounded to attenuate, apex acute-acuminate; midrib flattish or slightly raised above, often late-glabrescent; lateral veins (9-)17-20 pairs, slender, sunken or raised above; petiole (0.7-)1.2-2 cm long, pubescent. Inflorescences pubescent with shaggy hairs 0.5-2 mm long; bract 3-9 mm long, caducous; males 12-25x8-14 cm, peduncle 15-60 mm long. Male flowers : pedicel slender, 0.5-2 mm long, glabrous, at base articulated; buds depressed globose, 1.2-2x1.5-2(-2.5) mm; perianth glabrous, 3-5-lobed, at anthesis clefts to 1/4-1/3; androecium depressed globose, more or less circular in transverse section, 0.6-0.8x1-1.5 mm; anthers 10-12(-15), sesille; apical cavity of column up to halfway deep; androphore 0.2-0.4 mm long, hidden or not by the anthers. Female flowers not seen. Fruits 4-7 per infructescence, ellipsoid, 2.3-2.7x1.7-2.1 cm, glabrous, drying brown, pale wart-lie tubercles present; dry pericarp 1.5-2 mm thick; stalk 3-4 mm long; perianth persistent. Seeds ellipsoid (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In lowland and hill mixed dipterocarp forests on alluvial, sandy clay, and sandstone-derived soils, up to 600 m altitude. Flowering in May-November; fruiting in July",
    "Distribution":"Endemic to Borneo (Sarawak, Brunei and Kalimantan)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Horsfieldia%20reticulata-W301%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0136111,1.001388889 ]
    },
    "properties": {
    "Species":"Horsfieldia Borneensis W.J. de Wilde",
    "Kolektor":"Sidiyasa, K",
    "Description":"Tree up to 30 m tall. Bark rough, deeply fissured, flaking in squares, usually dark brown or reddish or blackish, strips or flakes up to 5 cm wide, up to 1 cm thick; inner bark 5-10 mm thick, red-brown; sap red. Sapwood reddish with to pale red; heartwood red-brown. Twigs subterete, not conspicuously hollow, not ridged, towards apex (1.5-)2-4(-10) mm diameter, brown, not contrasting with the drying petiole, rusty tomentose with hairs 0.2-0.4 mm long, glabrescent; lower down finely striate, not distinctly lenticellate, when older finely cracked or flaky or not. Leaf buds 10-17x2-4 mm, densely pubescent with hairs c. 0.3 mm long. Leaves distichous, chartaceous to thinly coriaceous, upper surface drying dull olivaceous to brown, not bullate, not scabrous, glabrous, lower surface drying pale brown or chocolate, tomentose with shortish densely branched dendroid hairs 0.3-0.4 mm long (especially on the midrib), early glabrescent, without golden hair scars, always with scattered blackish dots; elliptic-oblong-lanceolate, 7-18x2-6 cm, base short-attenuate, apex acute to short-acuminate; midrib slightly raised above, early or late-glabrescent; lateral veins 10-16 pairs, flat or sunken (or close to the midrib slightly raised) or in thinner-leaved specimens slightly raised above; intercostal venation hardly visible on both surfaces; petiole 1.2-2.5 cm long, late-glabrescent. Inflorescences on older twigs behind the leaves, woolly pubescent with rusty hairs up to 0.7 mm long; bract 1.5-5 mm, caducous; males fairly large, c. 4-times branched, (-8)13-20x(5-)10-18 cm, peduncle 15-35 mm long; females stout, on olders twigs c. 1.5 cm thick well below the leaves, rather many-flowered, 8-10x4-5 cm, peduncle c. 15 mm long. Male flowers in loose clusters of 2-6; pedicel 1-1.5 mm long, glabrous, articulated at base; buds subglobose to broadly ellipsoid or obovoid, 1.3-1.8x1.2-1.7 mm, apex broadly rounded, base narrowly rounded; perianth glabrous, 3-lobed, at anthesis clefts to c. 1/3 to nearly 1/2, not collapsing on drying; androecium subglobose, 0.7-1.2x0.6-1.3 mm, circular to rounded-subtriangular in cross section, sessile, apex broadly rounded, slightly impressed in the centre to 1/5-1/4 or less; anthers 7-10, almost completely sessile and entirely connate, at apex incurved over the cavity of the column. Female flowers solitary or 2-4 together; pedicel rather thick, 1-1.5 mm long, at base articulated; buds subglobose or broadly ellipsoid, c. 3-3.5x3 mm; ovary subglobose 2(-2.5)x2 mm, glabrous. Infructescences up to 13 cm long. Fruits 1-7 per infructescence, ovoid, somewhat laterally flattened and slightly flanged, apex and base rounded, 4-6x3-4.5 cm, glabrous, drying often with a glaucous tinge, rather smooth; dry pericarp 10-15 mm thick; stalk stout, 4-6 mm long; perianth not persistent. Seeds ellipsoid; aril orange (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In primary lowland mixed dipterocarp forest and swamp forest, on sandy clay soils, up to 200 m altitude. Flowering in April and August-September; fruiting troughout the year",
    "Distribution":"Endemic to Borneo (Sabah, Sarawak, E and NE Kalimantan)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Horsfieldia%20borneensis-S2939%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0161111,0.016111111 ]
    },
    "properties": {
    "Species":"Helminthostachys Zeylanica (L.) Hook.",
    "Kolektor":"Arifin, Z",
    "Description":"",
    "Habitus":"Fern",
    "Ecology":"Ferns of Malaya",
    "Distribution":"China, India, Sri Lanka, Thailand, Malaysia, Indonesia, Australia, New Caledonia.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Ophioglossceae-Helminthostachys%20zeylanica-SMK1%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.0144444,1.011944444 ]
    },
    "properties": {
    "Species":"Huberantha Rumphii (Blume ex Hensch.) Chaowasku",
    "Kolektor":"Sidiyasa, K",
    "Description":"Sub-canopy tree up to 26 m tall and 45 cm dbh. Stipules absent. Leaves alternate, simple, penni-veined. Flowers with ca. 38 mm long petals, green-yellowish, placed on the branches. Fruitlets ca. 8 mm long, green-yellow-purple, placed in apocarp, fruitlets 1-seeded.",
    "Habitus":"TRee",
    "Ecology":"",
    "Distribution":"Peninsular Malaysia, Sumatra, Java, Borneo (Sarawak, Brunei, Sabah, West-, Central-, South- and East-Kalimantan), Philippines, Celebes, Moluccas, New Guinea and the Solomon islands.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Annonaceae-Huberantha%20rumphii-S4871%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0047222,0.034722222 ]
    },
    "properties": {
    "Species":"Koilodepas Breviper Merr.",
    "Kolektor":"Kessler",
    "Description":"Undershrubs to small trees, up to 10 m high, d.b.h. up to 20 cm; flowering branches 2-3 mm in diameter. Outer bark smooth, white to light brown; inner white to pale grey; sapwood white to yellowish, hard. Stipules triangular 3.7?10 by 0.7?1.2 mm, margin often erose, basally generally a round, black, shiny gland on one side. Leaves: petiole 3?7 mm long, round to channelled above; blade (somewhat ovate to) elliptic to oblong, 8?32.5 by 2?11 cm, length/width ratio 2.7?5, drying brownish, base truncate to rounded (to cuneate), poculiform (convex), margin coarsely serrulate with glandular teeth, strongly recurved at base; apex caudate, mucronate, lower surface subglabrous to somewhat hairy on venation, nerves 13?15 per side, somewhat bullate between the nerves. Inflorescences up to 10.5 cm long, greenish brown. Staminate flowers 1.3?1.7 mm in diameter, green to pale white-yellow to yellow to yellowish grey to white, fragrant with smell of lemon; bracts triangular, 0.6?2.2 by 1?2.2 mm, margin often with teeth, at base with round, shiny extrafloral nectariesn; pedicels 0.3?0.8 mm long; calyx 1.3?2.2 mm high, with 3 or 4 lobes, latter 0.6?1 by 0.7?1 mm; stamens 6?8, androphore 0.6?1.5 mm long, filaments 0.7?0.9 mm long, sulcate, anthers c. 0.3 by 0.3?0.4 mm; pistillode 0.3?0.7 mm long. Pistillate flowers c. 2.2 mm in diameter; bracts triangular 2?3.5 by 1?2 mm, margin serrate, basally with glands; bracteoles like bracts, smaller, 1?1.5 by 0.3?0.5 mm; pedicel c. 0.3 mm long, lengthening in fruit up to 16 mm; calyx with 6, 8 or 10 free to basally connate lobes, latter triangular, 1.5?1.8 by 0.7?0.8 mm when young, extending in fruit up to 12 by 2 mm, basally and often halfway along margin with round, shiny extrafloral nectaries, not well visible when young, distinct in fruit; ovary 3(4)-locular, 1.8?2 by 1?1.3 mm, style 1?3 mm long, stigma 1.8?3 mm long, top split twice to several times, usually with 2 or 3 main lobes, stigmas individually visible. Fruits lobed rhegmas, 14?18 by 8?11 mm, red to reddish black to golden brown; wall c. 0.8 mm thick; columella 7?8 by 8?9 mm. Seeds c. 7 by 6.5-6.8 by 6-6.5 mm  (Flora Malesiana).",
    "Habitus":"Tree",
    "Ecology":"Primary forest (in tact or recently logged) or disturbed forest, on flat to undulating terrain or ridges and along roadsides; soil dark red-brow to yellowish black, sandy loam or sandstone. Altitude: Sea level up to 330 m.",
    "Distribution":"Malesia: Borneo (endemic)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Koilodepas%20brevipes-B333%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 118.7220833,1.148472222 ]
    },
    "properties": {
    "Species":"Koilodepas Pectinatum Airy Shaw",
    "Kolektor":"Ningsih, M.K.",
    "Description":"Trees up to 10 m tall, up to 25 cm in diameter. Bark smooth, greyish black, inner bark red, wood hard. Leaves spiral, oblong-oblanceolate, 8-18 cm  long, 2-5.5 cm wide, base wedge-shaped or rounded, apex acuminate to long pointed, margin shallowly toothed, parchment-like, secondary veins c. 14 pairs, with stellate hairs below. Stipules elongate, 9-12 mm long, deeply and finely pectinate. Flowers unisexual (male and female flowers on the same plant), in axillary, pendulous, racemes, petals absent. Male flowers: sepals 4, valvate, stamens 4, shortly fused, pistil reduced, minute. Female flowers: 1 or 2 at base of raceme, calyx big, cup-like with 8 or 9 lobes, ovary 3-celled, styles joined, erect, much-branched. Fruit a capsule, c. 2 cm in diameter, splitting into three parts, seated on a papery, broadly enlarged calyx (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Primary and secondary lowland forest",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Koilodepas%20pectinatum-M186%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0041667,0.016111111 ]
    },
    "properties": {
    "Species":"Knema Oblongata Merr",
    "Kolektor":"Kessler",
    "Description":"Shrub or tree up to 20 m tall. Bark smooth, sometimes scaly or slightly fissured; inner bark red-brown, beef-red, or pinkish. Sapwood pale yellowish, brownish, or whitish. Twigs towards apex 2-8 mm diameter, at first tomentose with hairs 0.2-0.6 mm long, glabrescent; bark drying brownish or blackish, lower down not cracked or flaky. Leaves chartaceous to coriaceous, lower surface finely papillose, without reddish brown dots, with persistent or partially late-glabrescent tomentum consisting of mixed sessile and stalked stellate and dendroid hairs; elliptic to oblong or lanceolate, 11-45x2.5-14 cm, base subattenuate to rounded, or shallowly cordate; midrib raised above; lateral veins (10-)18-26 pairs, raised to slightly sunken above; petiole late-glabrescent, 1-2.5 cm long. Inflorescences simple or forked, up to 0.5 cm diameter, 5-25-flowered in males; peduncle 0-4 mm long; flowers pubescent with hairs 0.1-1(-2) mm long. Male flowers : pedicel 2-8 mm long; bracteole usually caducous, attached to the pedicel at the middle or subapically; buds depressed globose-obovoid, 2.5-5x2-5.5 mm, tapering in the lower half; perianth at sutures 0.5-1 mm thick, at anthesis clefts to 1/2-2/3(-3/4); staminal disc including anthers subcircular, 1.4-2.5 mm diameter; anthers 7-9 or 13-18(-21), sessile to slightly stiped; staminal column 1-2 mm long. Female flowers : pedicel 2.5-10 mm long; bracteole attached to the pedicel at or above the middle; buds ellipsoid to obovoid, 6-7.5 mm long. Fruits 1-3 per infructescence, ovoid to obovoid, 2-3.8x1.5-2 cm, pubescent with hairs 1-1.5 mm long; dry pericarp 2-4 mm thick; stalk 3-10 mm long (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In primary and degraded lowland mixed dipterocarp to lower montane forests, on various types of soils, up to 1200 m altitude. Flowering mainly in June-August; fruiting mainly in October-December",
    "Distribution":"Endemic to Borneo (Sabah, Sarawak and E Kalimantan)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Knema%20oblongata-B1621%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0104842,0.013526111 ]
    },
    "properties": {
    "Species":"Knema Psilantha W.J. de Wilde",
    "Kolektor":"Ambri, Arifin & Arbainsyah",
    "Description":"Tree up to 10 m tall. Bark smooth, finely lenticellate, brittle; inner bark white mottled with reddish. Twigs fairly stout, sometimes angled, towards apex 3-5 mm diameter, tomentose with woolly yellowish brown hairs 0.5-1 mm long, soon glabrescent; bark cracked and flaky. Leaves thinly coriaceous, upper surface drying greenish brown, lower surface glabrous, finely papillose, without blackish dots; lanceolate, 20-48x3.5-9.5 cm, base obtuse to broadly rounded; midrib raised above; lateral veins 30-35 pairs, raised above; petiole late-glabrescent, 0.5-1.5 cm long. Inflorescences sessile, simple or warted, 0.2-0.5 cm diameter, 5-25-flowered in males, 1-5-flowered in females; flowers tomentose with pale hairs 0.5-0.7 mm long, early glabrescent in the upper half of more. Male flowers : pedicel 2-3 mm long; bracteole subpersistent, attached about halfway or on the upper part of the pedicel; buds ellipsoid-obovoid, 4.5-5x3-3.5 mm, inside red; perianth at anthesis clefts to 3/4-4/5; staminal disc flattish, including anthers circular, c. 1.5 mm diameter; anthers 6-7, stiped; staminal column 1-1.2 mm long. Female flowers : pedicel 1-2 mm long; buds larger than that of male flowers, ovoid, 8-9 mm long. Fruits 1-3 per infructescence, subellipsoid, 2.5-3x2 cm, pubescent with persistent rough yellowish hairs c. 1 mm long; dry pericarp c. 3 mm thick; stalk c. 2 mm long (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In mixed dipterocarp forest on ridges and hill sides, at 50-300 m altitude. Flowering in August-September; fruiting in June",
    "Distribution":"Endemic to Borneo (Sabah, Sarawak and E Kalimantan)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Knema%20psilantha-AA1738%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0049269,0.034853056 ]
    },
    "properties": {
    "Species":"Knema Subhirtella W.J. de Wilde",
    "Kolektor":"E. Goverse & Adriansyah",
    "Description":"Tree up to 25 m tall. Bark dark brown or chocolate-brown, smooth or dippled, not furrowed, brittle; inner bark pink-cream, fibrous; sap pink to blood-red. Sapwood cream. Twigs bluntly triangular, towards apex 1.5-2(-2.5) mm diameter, pubescent with hairs c. 0.1 mm long, mixed with sparse hairs up to 0.3 mm long, glabrescent; bark drying brown or blackish, not flaky. Leaf buds tomentose with hairs 0.1(-0.3) mm long. Leaves membranous,, upper surface drying olivaceous, lower surface greyish, without dark dots, with persistent tomentum of scattered stellate-dendroid hairs 0.1-0.2(0.3) mm long; elliptic-oblong to lanceolate, 9-20x(1.5-)2-5.5 cm, base cuneate; midrib raised above; lateral veins 15-25 pairs, flattish to raised above; intercostal venation coarse and distinct above; petiole 0.8-1.2 cm long. Inflorescences simple or forked, up to 0.4 cm diameter; peduncle up to 1 mm long; in males 4-7-flowered, in females 1-4-flowered; perianth at the sutures up to 1 mm thic. Male flowers tomentose with hairs 0.1-0.2(-0.3) mm long; pedicel 2-5 mm long; bracteole late-caducous, attached to the pedicel at 0.5-1.5 mm below the perianth; buds broadly obovoid, 2.5-3.5(-4)x2.5-3.5 mm; perianth at anthesis clefts to 1/2-3/4; staminal disc circular, flat or somewhat convex, including anthers 1.2-1.5(-2) mm diameter; anthers (7-)9-13(-15); staminal column 1-1.5 mm long, (almost) glabrous. Female flowers : pedicel 4-7(-10) mm long; buds obovoid, c. 5 mm long. Fruits solitary or 2 per infructescence, broadly ellipsoid 2-2.7x1.5-2 cm, tomentose with persistent hairs c. 0.1 mm long; dry pericarp c. 1.5 mm thick; stalk 4-10 mm long (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In mixed hill dipterocarp forest on slopes and ridges, on sandy clay, loamy and basalt- or shales-derived soils, up to 800(-1200) m altitude. Flowering in March-May(-August); fruiting mainly in September-October",
    "Distribution":"Endemic to Borneo (Sabah and Sarawak)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Knema%20subhirtella-B472%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0036111,0.030555556 ]
    },
    "properties": {
    "Species":"Lophopetalun Beccarianum Pierre",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 40 m tall and 60 cm diameter. Bole straight or sinuous, buttresses absent. Bark grey-brown, smooth, hooped. Inner bark pale brown. Sapwood pale yellow. Twigs dark brown to black, rounded. Leaves ovate, elliptic or oblong, drying to greenish brown above, with abundant black gland-dots bellow, 11-15 cm long, 3.5-7 cm wide, base wedge-shaped, apex usually obtuse, acute, sometimes short acuminate, pointed or blunt; midrib raised above; secondary veins 5-8 pairs, ascending, arching, slightly raised below, faint or frequently depressed above, often pinkish when dried; intercostal veins very faint. Petioles 7-15 mm long. Flowers yellowish, in axillary panicles to 15 cm long; buds flat; pedicels c. 5 mm long; calyx lobes triangular or suborbicular; petals suborbicular or broadly ovate, usually without appendages on inner side, sometimes with disrinct veins; disc dish-shaped, 5-lobed; stamen filaments with cushion-like thickening at base; ovary pyramidal, style and stigma obscure. Fruits 5 2-11 x 3-3.2 cm, fruit wall leathery. Seeds 4.5 cm long, 1.5-1.2 cm wide (including the wing).",
    "Habitus":"Tree",
    "Ecology":"Lowland mixed dipterocarp forest to submontane forest, 400-1800 m altitude. Mainly on ridges and hillsides on clay-rich soils.",
    "Distribution":"Peninsular Malaysia, Brunei and Borneo. In Sabah and Sarawak frequent.",
    "Manfaat":"Possibly the commonest species in Malaysian Borneo, it is unfortunately usually of small size, but may prove to be utilisable in future.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Celasteraceae-Lophopetalum%20beccarianum-B1319%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.0083947,0.042408611 ]
    },
    "properties": {
    "Species":"Litsea Garciae Vidal",
    "Kolektor":"Kessler",
    "Description":"Trees up to 35 m tall, c. 50 cm in diameter. Bark smooth lenticellate, greyish white, inner bark hard, with distinct, short fibres, sapwood white. Twings stout c. 5 mm in diameter. Petioles 1-2 cm long, c. 5 mm in diameter. Cataphylls large, up to 10 cm long, silky hairy. Leaves spiral, oblong-lanceolate, or oblong,15-50 cm long, 5-12 cm wide, base wedge-sharped to almost heart-shaped, decurrent, secondary veins15-20 pairs. Inflorescences usually in the axils of fallen leaves. Fruits depressed globular, c. 3 cm long, c. 4 cm in diameter, pink becoming purple-black, perianth tube fleshy, green (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Sometimes in secondary forest, or ever planted",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"The fruits are eaten after boiling in hot water",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Lauraceae-Litsea%20garciae-PK1863%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0047222,0.034722222 ]
    },
    "properties": {
    "Species":"Lepisanthes Amoena (Hassk.) Leenh.",
    "Kolektor":"Kessler",
    "Description":"",
    "Habitus":"Tree",
    "Ecology":"Secondary Forest Trees of Kalimantan, Indonesia",
    "Distribution":"Sumatra, Malay Peninsula, West Java, Timor; Borneo: Sabah, Sarawak, Kalimantan",
    "Manfaat":"Common in primary but more frequent in secondary vegetation, even in scrub or bamboo forest, often along rivers, up to 1650 m altitude.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Sapindaceae-Lepisanthes%20amonea-B273%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117,0.016666667 ]
    },
    "properties": {
    "Species":"Melanochyla Fulvinervis (Blume) Ding Hou",
    "Kolektor":"Ambri & Arifin",
    "Description":"Medium-sized trees 10-32 m tall and 20-46 cm in diameter, buttresses up to 2 m tall, 2 m long. Bark red-brown to grey-brown, smooth, inner bark reddish with black sap. Stipules absent. Leaves  simple, alternate or obovate to oblanceolate, 10-38 cm long, 3.5-14 cm wide, leathery, glabrous and shining on upper side, pubescent beneath, papillae distinct, separated by veins and veinlets into groups on the lower surface, base more or less heart-shaped, or rarely truncate, apex long pointed, sometimes cuspidate, secondary veins 19-22 pairs, tertiary venation net- to ladder-like, distinct beneath. Petioles 0.5-1.2 cm long. Panicles terminal, up to 18 cm long. Flowers ca. 9 mm in diameter, white-yellow coloured, placed in panicles. Fruits orange coloured, warty, edible fleshy drupe. Drupes ellipsoid or almost globular 2-4 cm long, 2.5-3 cm in diameter, with dense, rusty hairy, insectgall-like processes up to c. 7 mm long.",
    "Habitus":"Tree",
    "Ecology":"In undisturbed lowland forests up to 500 m altitude, but occasionally found up to 1200 m. In secondary forests on dry land or in swamp, usually present as a pre-disturbance remnant.",
    "Distribution":"Peninsular Malaysia and Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Anacardiaceae-Melanochyla%20fulvineris-W388%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115,0.027777778 ]
    },
    "properties": {
    "Species":"Mangifera Pajang Kosterm",
    "Kolektor":"Valkenburg",
    "Description":"Medium-sized tree to 30 m tall, 70 cm diameter. Bark dark brown, smooth to shallowly fissured; inner bark brownish with creamy latex. Twigs tout, 1-2 cm thick, angular. Leaves usually spirally arranged, sometimes in pseudowhorls, drying brownish, thick-coriaceous; elliptic to oblong or obovate, 15-28 x 5.5-12.5 cm; base cuneate, apex obtuse; midrib usually finely grooved on the under surface, lateral veins 13-25 pairs, raised on both surfaces, intercostal veins invisible on both surfaces; petioles 3.5-9 cm long, strongly swollen at base, upper surface flattened and concave at base, irregularly rugose below. Inflorescences terminal or appearing in the axils of upper leaves, to 30 cm long. Flowers 5-merous; calyx glaborous, dark purple; petals purplish inside, pinkish white outside, each with 3 ridges; stamens 5, fertile stamens 1-2, filamens free; disk stalk-like; ovary whitish, style eccentric. Fruits rugose, brownish, globose to ellipsoid, 10-12 x 8.5-10 cm; epicarp thick and can be peeled off lke a banana skin; pilp deep orange-yellow, sweet (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Lowland forest to 500 m, often in swampy and riverine habitats.",
    "Distribution":"Endemic to Borneo. In Sabah and Sarawak, uncommon in the forest, often cultivated for its fruit; also in Brunei and Kalimantan.",
    "Manfaat":"The fruit is edible and is in great demand.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Anacardiaceae-Mangifera%20pajang-JVV1203%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.0163889,1.010277778 ]
    },
    "properties": {
    "Species":"Moonon Erianthoides (Airy Shaw) B.Xue & R.M.K.Saunders",
    "Kolektor":"Sidiyasa, K",
    "Description":"Tree to 30 m tall. Twigs densely golden hairy when young. Leaves chartaceous, drying green or brown; blades oblong-elliptic to sublanceolate, 12-40 x 6-13 cm, base rounded to obtuse, apex acute-acuminate; midrib immersed above, prominent below, hairy above and below; lateral veins 10-20 pairs, widely spaced, looping obscurely; petioles 10-15 mm long, c. 4 mm thick, tomentose. Inflorescences caudiflorus to near the ground or ramiflorous on woody tubercles, axis to 7 cm long, relatively straght, with many bracts and pedicel-scars giving a banded appearance, densely tomentose, 1-3-flowered. Flowers: pedicels 1-5 cm long, c. 2 mm thick, densely pale brown hairy, dring brown; medial bracts amplexicaulous, to 7 mm long, hairy outside, glabrous inside; perianth whorls imbricate; sepals coriaceous, not persistent in fruit, broadly triangular or ovate, to 15 x 10 mm, apex obtuse, brown hairy outside with faintly visible lingitudinal ridges, glabrous within; petals thickly fleshy, not drying black; outer petals ligulate to obovate, c. 5 x 1.2 cm; inner petals concave towards apex, similar in length to outer petals but slightly narrower, densely covered with soft pale tomentum; stamens c. 3 mm long; carpels c. 20, c. 4 mm long, densely hairy. Fruiting pedicels 1.5-7 cm long. Monocarps to 7, sessile, ellipsidal, to 4.5 cm long, to 2.5 cm diameter, densely golden hairy, prominently beaked; pericarp relatively thick, c. 1 mm. Seeds ellipsoidal, c. 3 cm long, c. 1.5 cm diameter, drying golden brown hairy (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Lowland and hill forest at altitudes to 900 m.",
    "Distribution":"Endemic in Borneo. Besides the type no other collections from Sarawak, more widely collected In Sabah, also from Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Annonaceae-Monoon%20erianthoides-S3577%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0030556,1.014722222 ]
    },
    "properties": {
    "Species":"Moonon Paradoxum (Becc.) B.Xue & R.M.K.Saunders",
    "Kolektor":"Kessler",
    "Description":"Treelet or tree to 30 m tall, to 45 cm diameter. Twigs drying pale grey or grey-brown, longitudinally wrinkled, pale to dark brown; young twigs with very short but dense and quite persistent tomentum. Leaves chartaceous, drying brown (light to dark, often mixed shades on the same leaf), brown or grey-brown below; midrib and lateral veins flush above, raised below, glabrous above except for short hairs along midrib, glabrous or with short hairs along main veins below; blades narrowly elliptic, oblong-elliptic, oblong-obovate or oblanceolate, (10-)25-38 x (3-)6.5-16 cm, base acute, obtuse, rounded to slightly cordate, apex short-acuminate (but lost in most specimens) lateral veins (14-)20-27 (or mores) pairs, arching forward and looping obscurely within margin; intercostal venation (sub) scalariform; petioles 5-10 mm long, 1.5-4 mm thick, short brown pubescent. Inflorescences in axils of attached or fallen leaves when mostly singel-flowered, or cauliflorous when few-flowered. Flowers fragrant; pedicels 7-30 mm long, c. 1 mm thick, widening distally, drying longitudinally wrinkled, densely short brown hairy; medial bracts broadly ovate, c. 4 x 4 mm, short brown hairy outside, glabrous within, longitudinal veins visible; perianth whorls imbricate; sepals coriaceous, not persisting in fruit, broadly ovate, c. 5 x 7 mm, rather irregulary ridged and wrinkled externally, densely short brown hairy outside, glabrous inside; petals thickly fleshy, white, cream or pale yellow, not drying black; outer petals spathulate and slightly waisted to more or less linear, to 5 x 1.8 cm, covered in short pale brown, rather shiny hairs outside, densest near the base, inside hairs sparser and rather short near apex; inner petals oblanceolate, similar in length to the outer ones, though appearing shorter as apex curves inwards, narrower, densely hairy near base and around margins outside, elsewhere more sparsely hairy; stamens c. 3 mm long. Fruiting pedicels 1-3.5 cm long, drying brown, longitudinally wrinkled with very short brown pubescence. Monocarps to 17, ellipsoidal, c. 30 cm long, c. 18 mm diameter, drying balck to brown, smooth or minutely pimpled, brown hairy, hairs sometimes very short and sparse giving a glabrous appearance, without pronounced beak; pericarp very thin, less than 0.5 mm thick (in dry specimens often break); stipes to 1.5 cm long, c. 3 mm thick (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Lowland and submontane forest at altitudes to 1500 m.",
    "Distribution":"Endemic in Borneo, known from Sabah, Sarawak and Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Annonaceae-Monoon%20paradoxum-B1387%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0036111,0.000427778 ]
    },
    "properties": {
    "Species":"Miliusa Macropoda Miq.",
    "Kolektor":"Kade Sidiyasa",
    "Description":"Tree to 20 m tall. Twigs drying pale grey, longitudinally wrinkled or latticed; younger parts covered with brown or pale, more or less erect hairs. Leaves chartaceous, drying brown, grey-brown or greenish above, similar below though generally paler, glabrous above except for a fringe of hairs along midrib, sometimes with pale hairs along main lateral veins below, otherwise more or less glabrous; blades ovate to elliptic, 6-23 x 3-7 cm, base obtuse, rounded to truncate, apex obtuse to acuminate; midrib flush above, prominent below; lateral veins 8-11 pairs, slightly raised above, prominent below; petioles 3-5 mm long, c. 2 mm thick, hairy. Inflorescences terminal, axillary or ramiflorus, one-or more-flowered. Flowers: pedicels very long and thin, 9-23 cm long, 0.5-1 mm thick, drying brown, striate, glabrous or with scattered short pale hairs; sepals tiny, triangular, c. 1 x 1 mm, short pale hairy outside, glabrous within; outer petals triangular, c. 2 x 1 mm, hairy outside, glabrous within; inner petals coriaceous, ovate, c. 12 x 7 mm, drying dark brown, veins faintly visible particularly near the base putside, minutely bumpy and sparsely pale short-hairy outside, hairs dense on the edges, inside smoother and glabrous; stamens c. 1 mm long, wit a slight apical projection; carpels hairy, c. 1 mm long, stigma globose. Fruiting pedicels to 25 cm long, c. 2 mm thick. Monocarps to 25 or more, to 2.5 cm long, to 1.5 cm diameter, drying dull brown, minutely pimpled, apex rounded to slightly beaked; stipes to 4 cm long, c. 2 mm thick. Seeds c. 4 in each monocarp, ellipsoidal, c. 9 mm long, c. 7 mm wide, c. 5 mm thick, light brown, slightly wrinked (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Lowland forest, including that on limestone.",
    "Distribution":"Endemic in Borneo; known from Sabah, Sarawak and Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Annonaceae-Miliusa%20macropoda-B1244%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0141667,1.001666667 ]
    },
    "properties": {
    "Species":"Macaranga Depressa",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 20 m tall, up to 40 cm in diameter. Bark smooth, hooped, whitish grey, latex clear, turning pink to red. Twigs solid, long hairy, hairs on twigs (at least tips), petioles and main leaf-nerves below. Stipules c. 1.3 cm long, c. 1 cm, erect, semi-persistent, greenish brown. Leaves peltate, intermediate, 3-5-lobed (seedlings not lobed), 15-25 cm long, 11-25 cm wide, base round, apex acuminate, margin toothed, upper and lower surface long hairy, hairy to glabrous beneath, gland dotted. Petioles 9-19 cm long, golden hairy. Staminate inflorescences branched. Fruits 4- or 5-lobed, c. 0.6 cm in diameter, often with horn like appendages, not spiny (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Up to 1200 m altitude. In primary and secondary forest, also in swamp forest. Along roads, streams, forest edges. On sandstone to red clayey loam soils.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Macaranga%20depressa-S2961%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0047222,0.034722222 ]
    },
    "properties": {
    "Species":"Macaranga Pearsonii Merr.",
    "Kolektor":"Kessler",
    "Description":"Trees up to 35 m tall, dbh up to 65 cm. Bole straight. Bark slightly fissured, hooped, smooth, lenticelled, sap red. Twigs solid to hollow, whitish, glabrous to hairy (when young). Stipules early falling off, papery, erect, caducous, apex acute, green to reddish. Leaves sometimes slightly peltate, , deeply 3-lobed (unlobed in seedlings), 9-21 cm long, 10-22 cm wide, base round with conspicous large glands along the margin, apex acute to shortly acuminate, margin entire to slightly toothed with glands, glaucous, beneath, granular glands yellow, under surface usually slightly glaucous, sometimes hairy. Petioles 10-30 cm long. Inflorescence branches with tawny, soft, spreading hairs. Staminate inflorescences barnched. Fruits spherical, 2-locular, not spiny, c. 4 mm in diameter, glandular (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Up to 1200 m altitude. In primary forest in disturbed sites (gaps) and secondary forest to scrub, along roads. Sometimes in periodically flooded areas, usually on dry places. Quite often inhabited by ant.",
    "Distribution":"Sabah, Sarawak, Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Macaranga%20pearsonii-B277%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0047222,0.034722222 ]
    },
    "properties": {
    "Species":"Macaranga Aetheadenia Airy Shaw",
    "Kolektor":"Kessler",
    "Description":"Trees up to 20 m tall, up to 40 cm in diameter. Bark smooth, hooped, glaucous, purplish grey. Sap red. Twigs whitish, hollow, usually with ant openings. Stipules recurved, c. 0.8 cm long, c. 0.3 cm wide, half to completely surrounding the twig, red, abruptly bent backwards. Leaves peltate, shallowly-broadly 3- (or 5-) lobed, 13-25 cm long, 10-15 cm wide, base with very large hollow glands along the margin, lamina glaucous or not, glabrous or with few hairs, granular glands yellow, base broadly truncate, sometimes, rounded, margins serrate, each tooth with a massive crater-like gland. Petioles 13-25 cm long, 3 mm in diameter. Staminate inflorescences branched. Fruits in heads, depressed-spherical, c. 1 cm in diameter, shortly horned, 4-lobed, with yellow glandular bands, without spines (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Mixed dipterocarp forest on basalt-derived or clay-rich shale-derived soils at 150-300 m altitude. In disturbed places in primary forest (gaps) or sometimes also recorded from primary forest and not common in secondary forest or in secondary (logged) forest, often along roads or skid trails. Usually inhabited by ants.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Macaranga%20aetheadenia-B357%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 114.8666667,0.066666667 ]
    },
    "properties": {
    "Species":"Macaranga Beccariana Merr.",
    "Kolektor":"Kessler",
    "Description":"Trees up to 15 m tall, up to 30 cm in diameter. Bole straight. Bark smooth, hooped,  greyish green, latex clear to red. Twigs hollow, white, usually with ant openings. Stipules triangular, c. 0.8 cm long, c. 0.3 cm wide, spreading to erect, apex pointed (looking spine-like on living individuals), same colour as stem or twigs. Leaves peltate, deeply-narrowly 3-lobed, 13-25 cm long, 10-15 cm wide, central lobe 3.5-5 times longer than wide, not overlapping with lateral lobes, under surface glaucous, glabrous, lamina white beneath, glabrous, base rounded, margin entire to laxly crenate. Petioles 13-25 cm long, 3 mm in diameter. Staminate inflorescences branched. Fruits in panicles, depressed-spherical, 3- (or 4-) lobed, c. 0.6 cm in diameter, without spines (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Up to 900 m altitude. In disturbed places in primary forest (gaps) and locally common in secondary forests, often along roads. Usually inhabited by ants.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Macaranga%20beccariana-PK2649%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.2691667,2.217777778 ]
    },
    "properties": {
    "Species":"Macaranga Motleyana",
    "Kolektor":"Ferry Slik",
    "Description":"Trees up to 33 m tall, usually much smaller (10 m), up to 30 cm in diameter. Bole straight. Bark hooped, smooth, greyish, latex clear, turning red. Twigs hollow, whitish, usually with and openings. Stipules early falling off, bent blackwards, recurved, not completely surrounding the twigs, green or red. Leaves peltate, shallowly, broadly or deeply 3-lobed (unlobed in seedlings), 12-28 cm long, 10.5-20 cm wide, leathery, base round, apex acute to acuminate, margin toothed with few glands, under surface usually slightly glaucous, glabrous, with galndular bands yellow. Petioles 16-21 cm long. Fruits depressed spherical, style persistent, with 4 yellow grandular bands (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Up to 400 m altitude. In primary forest in disturbed sites (gaps) and in secondary forest, along river banks and roads. On dry to swampy places. On limestone to red loamy clay. Usually ant inhabited.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Macaranga%20motleyana-B582%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0049269,2.001519722 ]
    },
    "properties": {
    "Species":"Mallotus Eucaustus Airy Shaw",
    "Kolektor":"Arifin",
    "Description":"Shrub to small trees up to 23 m tall, dbh up to 20 cm. Bole straight. Outer bark smooth, hooped, rugose, mottled; sapwood hard. Indumentum dense, whitish to yellowish, most parts densely short simple haired. Branches smooth, glabrescent. Stipules caducous to semi-persistent, triangular to narrowly triangular, 4-11 by 1-1.8 mm, margin entire, apex acute, hairy, puncticulate to clavate glands few to absent. Leaves in one plane. Non-reduced leaves; petiole 3-11 by 1-2 mm, hairy, clavate glands few to numerous; blade subovate to elliptic (to obovate), 7-24.5 by 1.5-7 cm, length-width ratio 2.7-5, coriaceous, base cuneate to acute to obtuse, slightly oblique, margin entire to slightly wavy to apically dentate, apex acuminate to aristate, upper surface smooth, hairy on the midrib, glabrescent, puncticulate glands few, inconspicuous, lower surface smooth, hairy, especially on veins, puncticulate to clavate glands numerous, inconspicuous, domatia absent; venation  pinnate, 11-17 secondary veins per side, ending parallel to the margin. Stipuliform leaves narrowly triangular, 4-8.3 by 1.5 mm, hairy, margin entire, apex acute. Staminate inflorescences with several fruits develoving, up to 3.5 cm long, basally 0.3-0.8 mm thick, unbranched, hairy, puncticulate to clavate glands present, nodes up to 16 per inplorescence; bracts narrowly triangular, 2.5-5.5 by 0.6-0.8 mm, margin entire, apex acute, hairy abaxially, glabrous (to few hairs) inside, puncticulate glands present. Buds globose with acute apex, hairy. Stamninate flowerss c. 3.5 mm diameter, reddish yellow to red; bracteoles absent; pedicels 1-4 mm long, hairy; sepals 3, persistent, basally connate to free, elliptic to orbicular, c. 3 by 2.5 mm, margin entire to irregular, apex acute, hairy abaxially, glabrous adaxially; stamens up to 46, filamens up to 1.5 mm long, glabrous; anther c. 0.5 by 0.6 mm, basifixed; connective more or less widened. Pistillate inflorescences up to 7 cm long, basally 0.9-1 mm thick, unbranched, hairy, puncticulate glands few, inconspicuous, nodes up to 11 per inflorescence; bracts persistent, narrowly ovate to narrowly triangular, 1.8-4 by 0.6-0.8 mm, margin entire, apex acute, hairy abaxially, glabrous to hairy adaxially, puncticulate glands few, inconspicuous. Pistillate flowers: bracteoles absent; pedicels 2.5-5 mm long, hairy, punctculate gland few to absent; sepals 5 or 6, free, narrowly triangular, 2.5-4 by c. 0.6 mm, margin entire, apex acute, hairy abaxially, glabrous to hairy adaxially, puncticulate to clavate glands few, inconspicuous; ovary 3-(or 4-)locular, echinate, densely wooly hairy, spines 0.5-1 mm long, with long hairs; style 0.5-1 mm long, hairy; stigmas 7-10 mm long, densely covered with plumose to finely granulate papillae on the inside, hairy abaxially, clavate glands absent or present. Fruits a shortly echinate, lobed capsule, 8-15 by 5-8 mm, green to light red, hairy; carpels glabrous to hairy adaxially; column c. 4 by 3.5 mm. Seeds glossy, globose, c. 4 by 5 mm; hilum elliptic to slightly deltoid, c. 1 by 0.5 mm (Blumea).",
    "Habitus":"Tree",
    "Ecology":"Mainly a locally common understorey tree in primary forest, but  also disturbed secondary forest below storey or in lightly (selectively logged); mostly on well-drained, sandy to (red) clayey loam soils. Altitude up to 340 m.",
    "Distribution":"Borneo",
    "Manfaat":"Firewood (hence its name eucautus, which means easy to burn).",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Euphorbiaceae-Mallotus%20eucaustus-B563%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.4166667,1.416666667 ]
    },
    "properties": {
    "Species":"Magnolia Lasia Noot.",
    "Kolektor":"Arifin, Z & Suharja, I",
    "Description":"Tress up to 25 m tall, up to 25 cm in diameter. Bark smooth, greyish, lenticellate. Young twigs densely very long villous. Petioles 4-10 cm long, stipule scars from halfway to up to the apex. Leaves elliptic to abovate, 25-60 cm long, 11-25 cm wide. glabrous, base wedge-shaped, apex hardly acuminte, secondary veins 16-22 pairs. Pedunle densely long villous, 4-15 cm long. Flowers fragrant, tepals, glabrous, yellowish, 6-10 cm long, stamen 25-30 mm long. carpels densely long villous, with very long styles, more than 100. Fruits 10-15 cm long 7-8 cm in diameter, stylar spine recurved, c. 0.5 cm long (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"In undisturbed to slightly disturbed mixed dipterocarp, kerangas and lowland to sub-montane forests up to 1200 m altitude. Usually on hillsides and ridges with sandy soils. In secondary forests usually present as a pre-disturbance remnant tree.",
    "Distribution":"Endemic in kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Magnoliaceae-Magnolia%20lasia-AA3737%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8,1.083333333 ]
    },
    "properties": {
    "Species":"Microcos Cinnamomifolia (Burret) Stapf ex P.S.Ashton",
    "Kolektor":"Slik, J.W.F. ; Arifin, z",
    "Description":"Trees 20-25 (-60) m tall, c. 30 cm in diameter. Bark smooth. Inner bark fibrous, reddish brown. Twigs glabrous, selender, c. 2 mm in diameter, with few stellate hairs when young, very soon wearing off. Stipules entire, linear, minute. Leaves ovate-oblong or elliptic, 6-12 cm long, 2-6 cm wide; base rounded to slightly wedge-shaped; apex acuminate; margin entire; 3-veined from base, the lateral veins ending in the leaf apex, secondary veins absent; glabrous or with few stellate hairs. Petioles 10-20 mm long, c. 1 mm in diameter. Inflorescences axillary or terminal, few-flowered; Sepals oblong, c. 5 mm long, petals elliptisc c. 2 mm long, stamens many, on a raised torus, ovary globular, glabrous; bracts entire, linear, minute. Fruit pear-shaped, c. 12 by 6 mm, glabrous, orange.",
    "Habitus":"Tree",
    "Ecology":"On riverbanks and in swamps.",
    "Distribution":"Brunei, Sarawak and Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Malvaceae-Microcos%20cinnamomifolia-FS107%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.3,0.95 ]
    },
    "properties": {
    "Species":"Microcos Crassifolia Burret",
    "Kolektor":"Arbainsyah",
    "Description":"Trees up to 25 m tall, c. 35 cm in diameter. Bark smooth. Twigs glabrous, stout, c. mm in diameter. Stipules entire, obovate, conspicuous. Leaves elliptic-oblong or obovate, 11-30 cm long, 4-14 cm wide; base rounded to broad acute or slightly wedge-shaped; apex rounded to acuminate; margin entire; 3-veined from base, the lateral veins not reaching the leaf apex; secondary veins 6-10 (including basal pair), glabrous. Petioles 6-25 mm long, c. 3 mm in diameter. Inflorescences axillary or terminal, few-flowered; bracts entire, obovate, conspicuous. Fruits ovoid to pear-shaped or orbicular, c. 30 mm long, 17-25 mm in diameter, smooth, glabrous, pink-green (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"In lowland mixed Dipterocarp forest, primary and secondary forests",
    "Distribution":"Endemic in Borneo: Sabah, Sarawak and East Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Malvaceae-Microcos%20crassifolia-AA3227%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.2333333,1.966666667 ]
    },
    "properties": {
    "Species":"Myristica Smythiesii J. Sinclair",
    "Kolektor":"Kessler, P.J.A. ; Arbainsyah",
    "Description":"Tree  up to 18 m tall; sometimes with small buttresses or stilt roots. Bark smooth, with fine longitudinal striation or narrowly fissured or flaky, dark grey or brown-black; inner bark soft, red-brown. Sapwood soft, orange-yellow; heartwood deep red. Twigs slender, towards apex 2-3 mm diameter, pubescent with hairs 0.3-0.5 mm long, glabrescent; bark lower down bark brown or blackish, longitudinally cracked, sometimes flaky; lenticels absent. Terminal leaf buds pubescent with coarse hairs 0.5(-1) mm long. Leaves thinly coriaceous, upper surface drying olivaceous, late-glabrescent on midrib towards the base, lower surface grey or cinnamon tomentose with persistent hairs 0.1-0.2 mm long, mixed with scattered emergent hairs 0.3-0.4 mm long, indistinctly papillose; elliptic-oblong or oblong-lanceolate, 8-20x2-6 cm, base rounded or shortly acute, apex acute-acuminate (sometimes somewhat blunt); midrib raised above; lateral veins 12-15(-18) pairs, faint, flat or sunken above, interarching veins indistinct; intercostal venation indistinct or invisible; petiole 0.7-1.5 cm long. Inflorescences simple or forked brachyblast, sessile or with stalk 1-1.5 mm long, pubescent with brown-red hairs 0.5(-1) mm long; males up to 0.6(-1) cm long, at apex with few flower buds of varying stages of development; bracts minute, caducous; flowers pubescent with hairs 0.3-0.5(-1) mm long. Male flowers (immature) : pedicel (2-)3 mm long; bracteole subcircular faintly 3-lobed, c. 1.5x2 mm, subpersistent; bud ovoid to ellipsoid-oblong, 3-3.5x2 mm, apex rounded; perianth at anthesis clefts to 1/4(-1/3);androecium c. 1.5x0.4 mm; synandrium 1-1.2 mm long, anthers 5-6, sterile apex blunt, c. 0.2 mm long; androphore c. 0.3 mm long, pubescent with dense hairs c. 0.2 mm long. Female flowers not seen. Fruits solitary, almost sessile, broadly ellipsoid, 2.5-3.5(-3.8)x2-2.4 cm, densely pubescent with scurfy hairs 0.2-0.3(-0.5) mm long; dry pericarp 1(-2) mm thick; stalk rather stout, 3-6  mm long. Seeds broadly ellipsoid, c. 2.5 cm long red-brown, shining; aril red (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In primary mixed dipterocarp forest on hill slopes, also in kerangas and peatswamp forests, on yellow sandy clay or loam soils and shallow peat overlying clay, up to 700 m altitude. Flowering and fruiting in April-July",
    "Distribution":"Endemic to Borneo (Sarawak and Brunei)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Myristica%20smythiesii-B1397%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.0077778,1.012222222 ]
    },
    "properties": {
    "Species":"Myristica Villosa Warb",
    "Kolektor":"Sidiyasa, K. ; Arifin, Z.",
    "Description":"Tree up to 40 m tall, occasionally with stilt roots. Bark hard,rough, sometimes smooth or finely scaly, blackish, flaking into strips (1.5-)2-3 mm wide and long, and c. 1 mm thick; inner bark reddish brown. Sapwood cream or pale brown; sap red. Twigs stout, towards apex 5-10 mm diameter, at first villose with hairs (1-)2-3(-4) mm long, glabrescent; bark lower down coarsely and longitudinally cracked and flaky; lenticels absent. Terminal leaf buds conspicuously pubescent with hairs (1-)2-3(-4) mm long. Leaves chartaceous or thinly coriaceously, upper surface drying olivaceous or brown, lower surface late-glabrescent (old leaves) or with persistent tomentum of dense, grey or cinnamon hairs 0.1-0.2 mm long mixed with spaced unbranched uniseriate emergent hairs 1-3 mm long, indistinctly papillose; elliptic-oblong or oblong, (15-)20-38(-40)x6-12.5(-13) cm, base acute to rounded, apex acute-acuminate; midrib raised above; lateral veins 20-25 pairs, sunken above, interarching veins usually distinct; intercostal venation distinct; petiole (1.2-)2-2.5 cm long, late-glabrescent. Inflorescences a sessile scar-covered brachyblast, pubescent; males simple or 2-4-furcate, 0.5-1.3x0.5-1 cm, at apices with 1-3 subsessile flowers; bracts minute, caducous; female similar, shorter, with 1 or 2 flowers more or less hidden in coarse pubescence; perianth coriaceous, tomentose with villose hairs 1-2 mm long; bracteole late-caducous. Male flowers : pedicel rather thick, 3-4(-5) mm long; buds ovoid or ovoid-ellipsoid, 6-8x4-5(-6) mm, apex somewhat blunt; perianth at anthesis clefts to c. 2/3; androecium slender, 4-5 mm long; synandrium narrowly cylindrical, 3.5-4.5x0.6 mm; anthers c. 6, sterile apex somewhat blunt, (0.2-)0.3-0.5 mm long; androphore slender, c. (0.5-)1 mm long, at base with a collar of pale hairs c. 1 mm long. Female flowers : pedicel c. 1 mm long; buds ovoid, c. 8(-10)x(-5)6-8 mm ; ovary ovoid, 5-6x4 mm, pubescent with hairs 1-1.5 mm long. Fruits 1 or 2 per infructescence, subsessile, broadly ovoid-ellipsoid, 4-6(-8)x2.5-4(-4.5) cm, apex often gradually narrowed with the tip somewhat uncinate, pubescent with hispid hairs 2-3(-4) mm long; dry pericarp 3-6(-8) mm thick; stalk up to 5 mm long. Seeds broadly ellipsoid, 3-5 cm long; aril red, coarsely laciniate, the laciniate finely divided at the top (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In primary hill mixed dipterocarp forest, marshy forest, and kerangas forest, on various types of soils, up to 1200 m altitude. Flowering in February, June and August-September; fruiting in May-September",
    "Distribution":"Endemic to Borneo (Sabah, Sarawak, Brunei, and Kalimantan)",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myristicaceae-Myristica%20villosa-S2190%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.4,1.116666667 ]
    },
    "properties": {
    "Species":"Pentace Erectinervia Kosterm.",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 40 m tall, up to 100 cm in diameter. Buttresses symmetrical, up to 1.6 m high. Bark finely fissured, flaky, brown to greyish; sapwood bright yellow. Hardwood brown to red-yellow. Twigs glabrescent with peltate scales, soon wearing off. Leaves obovate-elliptic to elliptic, 6-11 cm long, 3-6 cm wide; base rounded, symmetric or asymmetric, uqual or unequal; apex acuminate or vaquely toothed; margin obscurely glandular-toothed in apical part; 3- or 5- veined from base, secondary veins c. 5 pairs, prominent. Petioles 1-2 cm long. Inflorescences panicles, up to 15 cm long, staminodes strap-sheped, ovary pilose stellate and scaly. Stamens numerous. Fruits unknown (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"In secondary forest, lowland Dipterocarp forest and mix forest up to 600 m altitude",
    "Distribution":"Sarawak and East Kalimantan",
    "Manfaat":"According to Konstermans (1964) the timber is easy to work and in high esteem for construction purpose.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Malvaceae-Pentace%20erectinervia-S4594%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0022953,1.014192222 ]
    },
    "properties": {
    "Species":"Pternandra Cogniauxii M.P.Nayar",
    "Kolektor":"Kessler",
    "Description":"Epiphytic or hanging shrub or trees up to 5 m tall, up to 7 cm in diameter. Bark grey to light brown, inner bark white. Twigs somewhat flattened and grooved on two faces beneath the upper node, becoming cylindrical, epidermis flaking off and leaving a smooth, greyish surface. Leaves broadly to narrowly ovate, 14-20 cm long, 5.5-12 cm wide, base broadly rounded heart-shaped, apex acuminate, 5-veined from base, slightly leathery, glabrous. Petioles 1.5-3 mm long. Inflorescence mostly at the nodes on the branches well beneath the leaves, flowers solitary or fascicled. Calyx tube c.4.5 mm long, 3-4 mm wide, densely covered with wartly scales, calyx cap conical, splitting into 4 persistent lobes. Fruits urn-shaped (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Primary and secondary forests",
    "Distribution":"Endemic in Borneo: Sarawak, Sabah, West and East Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Melastomataceae-Ptenandra%20cogniauxii-B44%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0049269,2.001519722 ]
    },
    "properties": {
    "Species":"Prunus Beccarii (Ridley) Kalkam, Blumea",
    "Kolektor":"Kessler & Arifin Zainal",
    "Description":"Trees up to 27 m tall. Bark brown, smooth, inner bark smelling of bitter almods. Leaves simple, entire, spiral, elliptic or elliptic-ovate, 8-12 by 5.5.-8 cm, abse acute to rounded or decurrent, apex rounded to obtusenor shortly and bluntly acuminate, drying reddish brown and brittle, veins 4-7 pairs, prominent beneath, basal glands absent, usually several flat glands along the margin. Stipules small, 5-6 by up to 5 mm wide, outer surface with one large,hollowed gland. Inflorescences an axillary receme. Flowers actinomorphic, bisexual, perianth segments 6-8, densely hairy, stamens 15-40, ovary superior with apical style, glabrous expect some hairs at the base. Fruits a drupe, transversely ellipsoid, c. 7 mm long, up to 10 mm in diameter (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Scattered in lowland dipterocarp forest, up to 600 m altitude.",
    "Distribution":"Endemic in Borneo. Of the genus prunus eleven species are repoted for kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Rosaceae-Prunus%20beccarii-B522%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115,1.011111111 ]
    },
    "properties": {
    "Species":"Praravinia Borneensis (Merr.) Bremek",
    "Kolektor":"Van Valkenburg",
    "Description":"Treelet 3 m high. Horizontal branching. Leaves opposite with short to elongate stipule placed between the opposite leaves, most vegetative parts hairy, shining green below with orange hairs. Leaf venetion nicely curved and eventually looping to ending parallel to the leaf margin. Young leaves pink. Young shoots and  petiole with orange-brown hairs. Inflorescences in the axils of leaves, forming small branched bundles of white flowers, calyx yellow-orange with red hairs, corolla white. Fruits small, berries, orange with red hairs.",
    "Habitus":"Tree",
    "Ecology":"Ridge forest and In undisturbed to slightly disturbed forests.",
    "Distribution":"Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Rubiaceae-Praravinia%20borneensis-JVV1226%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.0085703,0.013506389 ]
    },
    "properties": {
    "Species":"Rhodamnia Cinerea Jack",
    "Kolektor":"Arifin, Ambri & Arbainsyah",
    "Description":"Tree to 20 m tall, to 20 cm diameter, hardly buttressed; crown diffuse, distinctly pale from beneath, with horizontal to slightly pendent twigs bearing leaves in a plane. Exposed living parts, includinng leaf undersurface, persistently and densely silvery or pale rust-brown puberulent. Bark smooth, mauve-brown, eventually scantily cracked. Twigs 1-2 mm diameter apically, slender, sometimes quadrangular beneath nodes, otherwise round in cross-section. Leaves thin, drying wrinkled; blades elliptic to sometimes loanceolate, 7-20 x 2-6 cm, base widge-shaped and shortly tapering, apex sharply slender-acuminate; midrib and 2 main lateral veins equal, slender, furrowed above, distinctly raised beneath; intercotal venation distinct, lax; intramarginal vein c. 0.5 mm within margin; petioles slender, c. 7 mm long. Flowers in dense axillary or sometimes terminal many-flowered dichasial clusters, recuded to 1-2 flowers at anthesis; buds subsessile; peduncle slender, to 6 mm long; hypanthium cup-shaped, c. 2 mm long, c. 2 mm diameter, with 5, c. 2 x 2 mm hemispherical calyx lobes; petals sparsely silky outside, glabrous inside; stamens c. 20, barely exserted, with slender sinous filaments. Fruits juicy, ripening purplish, spherical, to 8 mm diameter, crowned with the persisting leafy calyx lobes. Seeds 4-10(-25), angular.",
    "Habitus":"Tree",
    "Ecology":"Frequent in secondary forest on degraded land, usually on in fertile pale yellow or sandy soils; also on landslips and, occasionally, large treefall gaps in primary forests; at altitudes to 1000 m, sometimes to 2000 m in the Mt. Kinabalu foothills.",
    "Distribution":"Australia, Myanmar, Peninsular Thailand, Sumatra, Peninsular Malaysia, Java, Borneo and the Philippines (Palawan only). ",
    "Manfaat":"The wood is used for small objects; the leaves and sometimes roots are used in a decoction after childbirth; the bark yields a black dye, and for tanning nets; and the fruit is edible.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myrtaceae-Rhodamnia%20cinerea-AA1714%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.1666667,0.85 ]
    },
    "properties": {
    "Species":"Semecarpus Glaucus Engl.",
    "Kolektor":"Kessler",
    "Description":"Small to medium-sized tree to 25 m tall, 20 cm diameter.  Twigs grey or grey-brown, densely brown short-hairy when young. Leaves spirally arranged, well-spaced; lower surface distinctly or slightly glaucous, uniformly covered with distinct papillae, upper surface glabrous, except for the midrib and lateral veins which are tomentose; elliptic to oblong or oblanceolate, 7-26.5 x 2.5-13 cm, the length less than 4 times the width; base cuneate, margin plane, not recurved, not pale whitish, apex acute; midrib usually sunken above, not pale yellow on drying, lateral veins 7-17 pairs, looping and joining near margin, raised below, visible above, intercostal veins reticulate, visible on both surfaces; petioles 0.5-4.8 cm long, not pale yellow on drying. Inflorescences terminal panicles, 11-35 cm long, hairy; bracts linear, 1.5-3 mm long. Flowers: buds oblong or ellipsoid; pedicels to 2.5 mm long; calyx lobes triangular; petals white, hairy outside with several longitudinal veins; ovary velvery hairy. Fruits (young) broadly ellipsoid, c. 1 x 0.7 cm, hairy, glabrescent, with almost rounded apex; hypocarp discoid (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Lowland forest to 450 m, in a variety of habitats including peat swamp, fresh-water swamp and limestone.",
    "Distribution":"Endemic to Borneo. Widely distributed in Sabah and Sarawak but nowhere abundant; also in Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Anacardiaceae-Semecarpus%20glaucus-B1579%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.9833333,1.45 ]
    },
    "properties": {
    "Species":"Santiria Apiculata A.W.Benn. Var. Pilosa (Engl.) Kalkman",
    "Kolektor":"Sidiyasa, K",
    "Description":"Small to medium-sized tree rarely more than 30 m tall. Bark grey or brown, smooth to scaly; inner bark pinkish with droplets of white sap and with strong resinous smell. Sapwood pale yellow. Twigs pale or whitish pale or whitish, glabrous or densely brownish hairy. Leaves trifolite or with 2-5 pairs of leaflets; blade glabrous, drying greenish or hairy below and drying brownish, , elliptic or lanceolate, 3.5-16 x 1.5-7 cm; base broadly cuneate, apex pointed with long tip; midrib flattened to slightly sunken above, distinctly grooved below, lateral veins 5-14 pairs, distinct below, faint above, curving and joining of few millimeters away from margin; intercostal veins reticulate, faintly visible below, faint to invisible above; with a strong resinous smell when freshly crushed; petiolules usually whitish, glabrous or hairy, 0.5-3 cm long. Flowers yellow or reddish, usually in short axillary inflorescences, glabrous. Fruits globose or ellipsoid, 1-2 x 1 cm, stigma usually more than 90? excentric, sometimes near the pedicel (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In Sabah and Sarawak widely distributed from lowland to submontane forest but less common compared to var. apiculata.",
    "Distribution":"Endemic to Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Burseraceae-Santiria%20apiculata%20var%20pilosa-S3470%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8333333,1.133333333 ]
    },
    "properties": {
    "Species":"Shorea Ovalis (Korth.) Blume",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 60 m tall, 1.2 m diameter. Buttresses prominent, rather sharp, small, up to 1.5 m tall, c. 1 m long. Crown with many rather small, radiating and slender branches. Damar opaque, pale olive-brown with a yellow crust. Bark grey-brown, V-section fissured, bark falling in rather narrow scales. Outer bark grey brown or dull purple brown with black portions, rather hard, inner bark fibrous, yellowish brown, sapwood pale yellow, heartwood dark red. Twigs stout, terete, becoming smooth. Stipules c. 13 mm long, c. 7 mm wide, ovate, more or less persistent. Petioles 7-9 mm long. Leaves oblong or narrowly ovate, 8-18 cm long, 3-7 cm wide, scabrid, leathery, base obtuse, apex acuminate, up to 8 mm long, margin revoulute, secondary veins (20-)22-24 pairs, tertiary veins ladder-like. Calyx densely golden brown pubescent outside, petals narrowly oblong, stamens 50-70, ovary narrowly conical, style short, glabrous. Fruit calyx sparsely pubescent, 3 longer lobes up to 11 cm wide, linear, c. 1.4 cm wide, spathulate, two shorter lobes up to 6 cm long, c. 0.4 cm wide, linear. Nut c. 2.2 cm long, c. 1.3 cm diameter, ovoid, densely rufous pubescent, style remnant acute. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 700 m altitude. Usually on hillsides and ridges, rarely alluvial. Mostly on (coarse) sandy to clayey soils.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo.",
    "Manfaat":"A light red meranti, suitable for indoor construction and plywood.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20ovalis-S3224%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.58432,0.5979 ]
    },
    "properties": {
    "Species":"Shorea Balangeran (Korth.) Burck",
    "Kolektor":"Ningsih, M.K.",
    "Description":"Trees up to 30 m tall, diameter. Buttresses up to 1.2 m high. Crown thin, open. Damar whitish-yellowish. Bark reddish white to reddish black, deeply fissured. Outer bark light or rusty red, sapwood reddish-or rusty-brown, heartwood dark red. Twigs slender, terete. Stipules 10-15 mm long, 3.5-7 mm wide, ovate, falling off early. Petioles 2-3 cm long. Leaves oblong-elliptic to lanceolate, 7-18 cm long, 3-8 cm wide, drying yellowish beneath, scaly, leathery, base wedge-shaped to obtuse, apex acuminate, up to 1.5 cm long, secondary veins 13-18 pairs, tertiary veins densely ladder-like. Petals narrowly oblong, stamens 15, ovary, ovoid, style columnar, pubescent at base. Fruits pedicel to 2 mm long, calyx sparsely pubescent, 3 longer lobes up to 5 cm long, c. 7 mm wide, spatula-shaped, two shorter lobes up to 1.5 cm long, c. 0.2 cm wide. Nut c. 6 mm long, c. 4 mm diameter, ovoid, apiculate. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia.)",
    "Habitus":"Tree",
    "Ecology":"Locally common, often gregarious, in undisturbed kerangas or (peat)-swamp forests near the coast up to 100 m altitude. Mostly on poor sandy soils on alluvial sites or hillsides.",
    "Distribution":"Sumatra, Borneo.",
    "Manfaat":"In former times a major timber in Indonesia Borneo, now due to over-exploitation tall trees are almost extinct.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20balangeran-M300%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.58487,0.59831 ]
    },
    "properties": {
    "Species":"Shorea Seminis (de Vriese) Slooten",
    "Kolektor":"Suharja, I.; Farhazakia, N.; Ariyanto",
    "Description":"Trees up to 55 m high, up to 1.2 m diameter. Bole usually short, often twisted. Buttresses distinct, short and sharp, or up to 3 m tall, 4.5 m long. Crown rounded, spreading widely, dense, damar never observed. Bark surface dark brown with lighter patches, rather smooth but closely lenticelled, or rough with scales, not fissured, older trees scaling in rather large flakes. Outer bark usually thin, inner bark dull brown, sapwood pale yellow, heartwood dark brown. Twigs slender, frequently ribbed when young. Stipules c. 7 mm long, c. 3.5 mm wide, oblong, falling off early. Petioles 1-1.5 cm long. Leaves oblong-ovate to lanceolate, 9-18 by 2.5-8 cm, glabrous or greyish scaly beneath, thinly leathery, base rounded or acute, sometimes unequal, apex acuminate, 0.8-2 cm long, narrow, secondary veins 9-15 pairs, rather straight, tertiary veins densely ladder-like. Calyx lobes almost equal, ovate, obtuse, the inner 2 somewhat narrower and thinner than the outer 3, corolla hardly twisted, stamens 30-40, ovary conical to hourglass-shaped, style short, glabrous. Fruit calyx greyish buff pubescent, lobes almost equal, up to 2 by 1.8 cm, circular. Nut c. 1 cm diameter, ovoid or globular, style remnant to 12 mm long, stout. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"",
    "Distribution":"Peninsular Malaysia, Borneo, Philippines.",
    "Manfaat":"The fruit are prepared in Borneo as a source of illipe butter, but are too small to be valued for export. The timber is very hard and is used for all contructions where strength required.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20seminis-M304%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Shorea Macrophylla (de Vriese) P.S.Ashton",
    "Kolektor":"Wahyudi, A.",
    "Description":"Medium-sized to large tree. Young twig, leaf bud, stipules, petiole, leaf beneath and midrib above persistently densely evenly caducous pale brown pubescent. Twig 1.5-4 by 2-3 mm diameter apically, compressed, becoming smooth, glabrous; stipule scars to 1 mm thick, amplexicaul, pale cream, ? horizontal, smooth, glabrous. Bud 1 2-1 8 by 4-6 mm, compressed, hastate, narrowly obtuse. Stipule to 5 by 1.3 cm, broadly hastate, obtuse, constricted at base. Leaves 17-35 by 10-14 cm, elliptic-oblong, ? coriaceous; base obtuse or subcordate; acumen to 1.5 cm long; nerves 11-20 pairs, prominent beneath, well spaced, at 55?-65?; tertiary nerves distinct, well spaced, scalariform, at 90? to nerves; midrib prominent, rounded, beneath, broad and applanate above; petiole 1.5-3 cm long. Panicle to 17 cm long, terminal or axillary, ribbed and compressed when dry, shortly evenly persistently buff pubescent, singly branched; bracteoles to 1.2 by 0.5 cm, oblong, subacute. Flower bud to 8 by 5 mm,  broadly or narrowly ellipsoid. Calyx lobes densely pale brown pubescent outside, glabrous within; lobes subequal, broadly elliptic to deltoid, obtuse to acuminate. Petals pale pink, broadly ovate, obtuse, densely pubescent on parts exposed in bud. Stamens 15, of 2 lengths, the inner 5 an anther's length longer than the outer 10; filaments broad, compressed, united in a tube round the ovary, tapering distally and filiform below the oblong anthers; appendage to connective c. 2 x length of anther, slender, glabrous. Ovary ovoid, densely pubescent in the distal half; stylopodium and style glabrous, spindle shaped, as long as ovary. Fruit calyx glabrous; 3 longer lobes to 11 by 3 cm, coriaceous, oblong, obtuse, to 1.5 cm broad above the to 1.8 by 2.3 cm horizontally elliptic deeply saccate thickened base; 2 shorter lobes to 8 by 1.5 cm, similar at base, base obscured by larger lobes. Nut to 6 by 4 cm, obovoid, persistently evenly shortly pale buff pubescent; style remnant, small, short, acute. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"S. macrophylla is one of the fastest growing Shorea species and is common along water courses and on clay-rich periodically flooded land below 600 m altitude.",
    "Distribution":"Endemic Borneo",
    "Manfaat":"The timber is used as light red meranti. Being  one of the lightest in this trade group it is sometimes regarded as a white meranti or trade separately as \"kawang jantong\". S. macrophylla is one the most important sources of illipe nuts.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20macrophylla-AW34%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.9666667,1.416666667 ]
    },
    "properties": {
    "Species":"Shorea Leprosula Miq.",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 60 m tall, c. 1 m diameter. Buttresses prominent, but usually not very large, c. 1.5 m tall and long. Crown wide, umbrella-shaped. Damar Yellow. Bark greyish brown, shallowly fissured, V-shaped. Outer bark dull purple brown, rather hard, brittle, inner bark fibrous, yellowish brown, sapwood pale, hearwood dark red. Twigs slender, terete, ridged when young, smooth. Stipules c. 10 mm long, c. 3.5 mm wide, oblong, falling off early. Petioles 1-1.5 cm long. Leaves elliptic to  ovate, 8-14 cm long, 3.5-5.5 cm wide, cream scaly, thinly leathery, base obtuse, apex acuminate, up to 8 mm long, secondary veins 12-15 pairs, tertiary veins densely ladder-like, domatia confluent, at least in young trees present. Calyx densely pale brown pubescent outside. Petals narrowly oblong, stamens 15, ovary ovoid, style filiform, glabrous. Fruit pedicel to 2 mm long, calyx sparsely pubescent, 3 longer lobes up to 10 cm long, c. 2 cm wide, spatula-like, two shorter lobes up to  5.5 cm long, c. 0.3 cm wide. Nut c. 2 cm long, c. 1.3 cm diameter, ovoid, pale buff pubescent, style remnant acute (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"A light red meranti which is quite important.",
    "Distribution":"Thailand, Peninsular Malaysia, Sumatra, Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20leprosula-S3181%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Shorea Macroptera Dyer",
    "Kolektor":"Wahyudi, A.",
    "Description":"Large tree. Young twig, panicle, leaf bud, stipule outside (puberulent within), petiole, midrib above at base and nervation beneath densely evenly shortly pale brown pubescent. Twig to 2 mm diameter  apically. frequently slightly compressed, becoming terete, glabrous; stipule scars short, narrowly cuneate, ? horizontal. Bud 4-6 by 2.5-4 mm, ovoid, subacute. Stipules to 8 by 3 mm, oblong, subacute, fugaceous. Leaves 10-15 by 3-5 cm, elliptic or oblong, coriaceous; base broadly cuneate; acumen to 1 cm long: nerves 12-15(-18) pairs, prominent beneath, curved, at 40?-50?; tertiary nerves slender, densely scalariform, sinuate, diagonal to nerves; midrib prominent and terete beneath, slightly depressed above; petiole 1 5 cm long. Panicle to 10 cm long, terminal or axillary, slightly compressed or terete, lax; singly branched or doubly branched near base, the branchlets bearing to 7 distichous flowers; bracteoles to 3.5 by 2.5 mm, elliptic, obtuse, shortly yellowish brown pubescent outside, glabrous within, fugaceous. Flower bud to 5 by 3 mm, ovoid. Calyx outside densely shortly pale yellowish brown pubescent, glabrescent within; lobes subequal, ovate, the 3 outer acuminate, the 2 inner acute. Petals cream to pink at base, linear, acute, twisted, yellow pubescent on parts exposed in bud. Stamens 15, of 3 lengths, the longest reaching just above the ovary; filaments tapering gradually; anthers broadly oblong; appendage to connective short, becoming reflexed. Ovary and stylopodium ? conical, densely pale grey pubescent, glabrous near base; style c. 12 length of ovary, slender, glabrous. Fruit calyx shortly sparsely puberulent, glabrescent; 3 longer lobes to 1 2 by 2.3 cm, spatulate, obtuse, to 1 cm broad above base; base with to 7 by 5 mm ovoid saccate thickened centre and 2 lateral narrow auricles, the whole to 1 .2 cm broad, abruptly tapering at pedicel; 2 shorter lobes to 6 by 0.6 cm, narrowly oblong, similar at base. Nut to 1.8 by 1.2 cm, ovoid, densely evenly shortly pale buff pubescent; style remnant 2 mm long, acute. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"A very variable species with 4 subspecies and occurs on well-drained clay soils on undulating land and hillsides up to 900 m altitude.",
    "Distribution":"Thailand, Peninsular Malaysia, eastern Sumatra and Borneo.",
    "Manfaat":"The timber is a valuable source of light red meranti and is sometimes traded separately as \"melantai\". A resin called \"damar batu\" or \"damar daging\" has been collected but is little value. The bark is favoured locally for walls, floors and roofs.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20macroptera%20Dyer%20ssp.%20Sandakanensis-AW22%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.1,2.033333333 ]
    },
    "properties": {
    "Species":"Shorea Mecistopteryx Ridley",
    "Kolektor":"Wahyudi, A.",
    "Description":"Large tree. Young twig, panicle, leaf bud, stipule outside, petiole and leaf beneath shortly evenly ? persistently gold-tomentose. Twig to 6 by 2.5 mm diameter apically, compressed, becoming terete, smooth; stipule scars initially to 2.5 mm long, cuneate, horizontal. Leaf bud 5-8 by 2.5-5 mm, ovoid, compressed, obtuse. Stipule to 25 by 7 mm, hastate, acute. Leaves 13-20(-30) by 6-10(-12) cm, oblong, chartaceous; base cordate; acumen to 8 mm long, broad; nerves 16-20 pairs, curved, at 45?-65? along midrib and to 120? at base; tertiary nerves densely scalariform, at 90 to nerves; midrib prominent and terete beneath, rather narrow, ? applanate above; petiole 2.5-3.5 cm long. Panicle to 12 cm long, terete or compressed, terminal or axillary, singly branched; bracteoles to 7 by 2 mm, oblong, subacute, densely pubescent outside, sparsely so within. Flower bud to 12 by 4 mm, lanceolate. Calyx densely shortly greyish pubescent outside, glabrous within; lobes narrowly deltoid, subequal, ? patent, the 2 inner slightly shorter, thinner, slightly expanded at base. Corolla shortly pubescent on parts exposed in bud; petals linear, subacute. Stamens 15, the 5 inner somewhat longer than the others; filaments united in the basal half, tapering to the anthers in the distal half; anthers oblong; appendage to connective over twice as long as anthers, not reflexed. Ovary narrowly ovoid-conical, glabrous; stylopodium somewhat longer than ovary, thickened in the distal half; style stout. Fruit pedicel to 6 mm long, stout. Fruit calyx glabrescent or persistently puberulent at base; 3 longer lobes to 23 by 3.3 cm, spatulate, narrowly obtuse, to 1 .8 cm broad above the to 2 by 2.5 cm broadly ovate saccate thickened base; 2 shorter lobes to 1 5 by 1 .2 cm, linear, similar at base, base enveloped by larger lobes. Nut to 4.2 by 2.5 cm, ovoid, persistently shortly evenly yellowish buff pubescent; style remnant acute. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Occurs locally on yellow sandy clay soils on low hills up to 400 m latitude.",
    "Distribution":"Endemic Borneo",
    "Manfaat":"The timber is used as light red meranti. The wood yield a dark brown dammar of good quality. The fruits are small and only collected locally as ellipe nuts.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Dipterocarpaceae-Shorea%20mecistopteryx-AW138.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0055556,0.015833333 ]
    },
    "properties": {
    "Species":"Shorea Pinanga Scheff.",
    "Kolektor":"Sidiyasa, K",
    "Description":"Trees up to 45 m tall, up to 1 m diameter. Bole straight, cylindrical. Buttresses small. Bark smooth, scaly to flaky, hooped, dark grey. Twigs glabrescent, compressed. Stipules hastate, up to 5 cm long, almost persistent. Petioles 1.5-2 cm long, slender. Leaves elliptic to narrowly ovate, 11-24 cm long, 4-9 cm wide, glabrous, thinly leathery, base wedge-shaped to more or less heart-shaped, apex acuminate, c. 1.5 cm long, secondary veins 10-20 pairs, tertiary venation ladder like. Clyx glabrous or pubescent, lobes almost equal, linear, petals linear-lancelate, stamens 15, ovary almost globular, style long, glabrous. Fruit calyx glabrescent, 3 longer lobes up to 28 cm long, c. 3.5 cm wide, spatula-shaped, 2 shorter lobes up to 17 cm long, c. 1.2 cm wide, base thickened, saccate. Nut broadly ovoid, c. 2.3 cm diameter, buff pubescent. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 1300 m altitude. Mostly on ridges with clay to sandy soils.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"Important source of flywood timber and a good producer of illipe nuts.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20pinanga-S3827%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0066667,1.002222222 ]
    },
    "properties": {
    "Species":"Shorea Bracteolata Dyer",
    "Kolektor":"Sidiyasa, K",
    "Description":"Medium-sized to large tree up to 51 m tall and 103 cm diameter. Stem with resin.All parts at first sparsely pale brown pubescent, surfaces covered with a scurfy waxy deposit; becoming glabrous except for the pubescent bud and panicle. Twig to 2 mm diameter apically, somewhat compressed, becoming smooth, glabrous; stipule scars short, inconspicuous. Bud 3-5 by 2 mm, shortly falcate, compressed, subacute. Stipule c. 1 cm long, linear, fugaceous. Leaf 9-14 by 4-6 cm, oblong-ovate to elliptic. +/- thinly coriaceous; base obtuse; acumen 8-15 mm long; nerves 12-15 pairs, slender, curved, at c. 60-70; tertiary nerves distant, scalariform to subreticulate; petiole 1-2 cm long, slender. Panicle to 10 cm long, terminal or axillary, slender, terete, straight, usually singly branched; bracteoles to 12 by 5 mm, lanceolate, sparsely pubescent. Flower bud to 10 by 5 mm, ellipsoid, obtuse. Calyx densely pubescent outside, sparsely so within; 3 outer lobes broadly ovate-hastate, obtuse; 2 inner lobes narrowly ovate, acuminate, slightly shorter, thinner. Petals pale yellow tinged pink at base within, large, oblong-lanceolate, obtuse, shortly pubescent on parts exposed in bud. Stamens 15, the inner 5 somewhat longer than the outer 10; filaments broad, compressed at base, tapering gradually and filiform distally; anthers narrowly oblong; appendage to connective 3-4 times length of anther, slender, scabrous. Ovary ovoid, sparsely pubescent towards apex; style c. 2 times length of ovary, distinctly trifid towards apex. Fruit calyx puberulent, +/- glabrescent; 3 longer lobes to 10 by 1.7 cm, spatulate, obtuse, to 4-5 mm broad above the c. 10 by 7 mm thickened saccate base; 2 shorter lobes 5-8 by 0.7 cm, unequal and sometimes almost as long as the larger lobes, spatulate, obtuse, similar at base. Nut c. 2 by 1 cm, narrowly ovoid; style remnant to 4 mm long, acute, short. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 600 m altitude. Usually on alluvial sites and swamps, sometimes on hillsides and ridges. On clay soils and deep well drained soils.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20bracteolata-S4566%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.0075,1.006944444 ]
    },
    "properties": {
    "Species":"Shorea Parvifolia Dyer",
    "Kolektor":"Arifin, Z. & Suharja, I.",
    "Description":"Large tree up to 49 m tall and 104 cm diameter. Stem with resin. Young twig, panicle, leaf bud, stipule, petiole and midrib above shortly evenly persistently pale brown pubescent or glabrous, otherwise glabrous. Twig c. 2 mm apically, terete, much branched, becoming glabrous, smooth; stipule scars short, inconspicuous. Bud 4-7 by 3-5 mm, ovoid, compressed, obtuse. Stipule to 12 by 4 mm, oblong to ovate, obtuse. Leaves 5-9 by 2.5-5 cm. broadly ovate, thinly coriaceous, base obtuse or cordate with occasionally a pair of large pale scale-like domatia: acumen to 1 cm long, margin slightly revolute; nerves 10-13 pairs, slightly curved, slender, hardly elevated beneath; tertiary nerves slender, closely scalariform diagonal to nerves, midrib narrow and depressed above; petiole 1-1.5 cm long. Panicle to 12 cm long, terminal or axillary, slender, terete or slightly compressed; regularly singly, rarely doubly, branched, branchlets short, compact, bearing to 8 +/- secund flowers; bracteoles to 6 by 3 mm, elliptic-oblong, obtuse, shortly sparsely pale buff pubescent. Bud to 7 by 5 mm. broadly ovoid to subglobose, obtuse. Calyx densely pubescent outside, glabrous within; 3 outer lobes deltoid-ovate; 2 inner lobes smaller, broad ovate, acute, thin at base. Petals cream suffused with pink at base, oblong, obtuse, shortly pubescent on parts exposed in bud. Stamens 15, of 3 lengths, the 5 inner about twice length of others; filaments tapering gradually; anther subglobose; appendage to connective short, slender, becoming reflexed. Ovary and stylopodium ovoid to conical, densely pubescent except at base; style shorter than ovary, glabrous. Fruit calyx shortly sparsely pale brown pubescent; 3 longer lobes to 9 by 1.5 cm, thin, spatulate, obtuse, c. 4 mm broad above the c. 5.5 by 5 mm elliptic thickened saccate base; 2 shorter lobes to 3.5 by 0.2 cm. linear, subequal, similarly saccate at base. Nut to 14 by 7 mm, ovoid, shortly buff pubescent, style remnant c. 2.5 mm long, tapering, acute. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 1100 m altitude. On alluvial (swamps and riversides) and dry (hillsides and ridges) sites with clayey to sandy soils.",
    "Distribution":"Thailand, Peninsular Malaysia, Sumatra, Borneo.",
    "Manfaat":"The timber is used.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20parvifolia-AA3717%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Shorea Agamii P.S.Ashton ssp. agamii",
    "Kolektor":"Wahyudi, A.",
    "Description":"Large tree. Young twig, panicle, bud, stipule, petiole and midrib beneath caducous pale brown pubescent. Twig 2-3 mm diameter at the apex, becoming smooth, terete; stipule scars short, inconspicuous. Bud c. 4 by 2.5 mm, ovoid to falcate, slightly pubescent or glabrous, obtuse. Stipule c. 10 by 3 mm, oblong, obtuse, shortly caducous pubescent outside, glabrous within. Leaves 10-15 by 6-10 cm, broadly ovate to oblong, coriaceous; base obtuse or subcordate; acumen 0.5-1 cm long, broad; nerves 9-13 pairs, well spaced, curved, at c. 90? at the leaf base, c. 40? at the apex; tertiary nerves densely scalariform, at 90? to nerves; petiole 1-1.5 cm long. Panicle 6-10 cm long, terminal or axillary, terete to angular apically; singly or doubly irregularly branched, branchlets short, bearing to 5 flowers; bracts fugaceous; bracteoles to 3 mm long, narrowly elliptic, subacute, shortly pale buff-tawny puberulent, caducous. Flower bud to 5 by 2.5 mm, small, narrowly ellipsoid, subacute. Calyx densely shortly pale yellowish buff pubescent; 3 outer lobes narrowly ovate, subacuminate; 2 inner lobes 2/3 as long, narrow, prominently caudate. Petals small, ovate-elliptic, acute, densely pubescent on parts exposed in bud, puberulent elsewhere on outer surface. Stamens 1 5 in 3 subequal verticils; filaments ? same length as anthers, rather narrow, tapering; anthers oblong, somewhat tapering; appendage to connective c. 3 times length of anther, slender, extending to style apex. Ovary ovoid, densely pubescent; style slightly longer than the ovary, sparsely pubescent in the basal half, glabrous distally, stoutly filiform, tapering, obscurely trifurcate. Fruit calyx shortly fugaceous pubescent; 3 longer lobes 10-12 by 1.5-2.2 cm, spatulate, obtuse, tapering to 5 mm broad above the 1-1.5 cm broad strongly saccate thickened base; 2 shorter lobes to 6 by 0.4 cm, linear, unequal, similar at base. Nut to 2 by 1.5 cm, ovoid, glabrescent; style remnant 3-4 mm long, acute; base of fruit impressed at the short pedicel. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Leached soils on undulating land and shale hills below 700 m.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20agamii-AW17%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Shorea Angustifolia P.S.Ashton",
    "Kolektor":"Wahyudi, A.",
    "Description":"Small to medium-sized tree. Young twig and stipule sparsely shortly caducous pale brown pubescent; bud, panicle and petiole persistently so. Twig to 2 mm diameter apically, straight, terete, superficially cracked, rugose and coming away in small papery flakes. Leafbud 0.5 by 1 mm, small, ovoid, obtuse. Stipule to 3 mm long, linear, fugaceous. Leaves 8-14 by 2.5-4 cm, deep violet when opening, ovate to lanceolate, coriaceous; base cuneate; acumen to 1.5 cm long; nerves 8-10 pairs, hardly raised beneath, curved, well spaced, at c. 50?-60?; midrib beneath hardly elevated; tertiary nerves densely scalariform; petiole 6-8 mm long, finely cracked and drying distinct pale brown to cream-grey. Panicle to 10 cm long, terminal or axillary, slender, lax, terete; regularly singly or doubly branched, branchlets to 2 cm long, bearing to 8 distichous flowers; bracteoles small, fugaceous. Flower bud to 2.5 by 1.5 mm, lanceolate, acute. Calyx shortly pubescent outside, glabrous within; lobes ovate, acute, the 2 inner lobes thinner, more constricted at base than 3 outer. Petals cream, linear, shortly pubescent on parts exposed in bud, imbricate and cupped at base on opening, twisted and spreading distally. Stamens 15, in 3 unequal verticils; filaments broad at base, tapering and filiform distally; anthers oblong; appendage to connective 1-2 times length of anther, ciliate towards apex, as long as style. Ovary ovoid, shortly pubescent except at base; stylopodium conical; style short, glabrous; style and stylopodium as long as ovary. Fruit calyx lobes to 5 by 5 mm, subequal, broadly ovate, incrassate, obtuse. Nut to 8 by 9 mm, obovoid, acute, shortly buff pubescent. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Local, on shale ridges at 500-1200 m (rarely lower).",
    "Distribution":"Sarawak, Sabah, Tidung (East Kalimantan), Upper Dyak in South Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20angustifolia-AW23%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.3666667,2.15 ]
    },
    "properties": {
    "Species":"Shorea Confusa P.S.Ashton",
    "Kolektor":"Wahyudi. A.",
    "Description":"Large tree. Leaf bud, panicle, stipule outside, petiole, and very young twig caducous pubescent. Twig 2-3.5 mm diameter apically, frequently rugulose; stipule scar short, obscure. Bud ?<-4 by 2 mm, conical, acute. Stipule c . 8 by 3 mm, linear to deltoid, subacute. Leaves 6-12 by 3.5-3 cm, elliptic to slightly obovate; base obtuse; acumen broad, 0.5-1.0 cm long; nerves (10-) 13- 18 pairs, curved, at 90? at the base, c. 40? at the apex; tertiary nerves densely scalariform, at 90 to nerves; petiole 1-1.5 cm long, c. 1 mm diameter, rather slender. Panicle to 22 cm long, terminal or axillary, terete, lax; singly or doubly branched, branchlets to 1 cm long, bearing to 6 flowers; bracts and bracteoles unknown. Flower bud to 9 by 5 mm, narrowly ovoid, obtuse. Calyx puberulent outside, glabrous within; lobes equal, narrowly deltoid, obtuse. Petals large, narrowly ovate, acute, puberulent on parts exposed in bud. Stamens 15, in 3 subequal verticils; filaments c. 1?x length of anther, slender, tapering gradually; anthers oblong, tapering; appendage to connective c. 3 x length of anther, reaching f length of style. Ovary small, ovoid, puberulent; style stoutly filiform, c. 3 X length of ovary, glabrous in the apical 5, otherwise puberulent, shallowly trifurcate. Fruit pedicel stout. Calyx glabrous; 3 longer lobes to 12 by 1.5 cm, narrowly spatulate, obtuse, hardly tapering, slightly broadening at the thickened saccate base; 2 shorter lobes to 6 by 0.5 cm, unequal, linear, similar at base; base of calyx obconical, tapering into the pedicel. Nut to 2 cm long, ovoid, glabrescent; style remnant c. 6 mm long slender. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Scattered, undulating land and hills below 650 m, on leached clay soils in Mixed Dipterocarp forest.",
    "Distribution":"North East Borneo (North East Sarawak, Sabah South East to Sangkulirang-Berau).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Dipterocarpaceae-Shorea%20confusa-AW44.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.3333333,0.95 ]
    },
    "properties": {
    "Species":"Shorea Mujongensis P.S.Ashton",
    "Kolektor":"Sidiyasa, K.",
    "Description":"Trees up to 50 m tall, up to 1 m diameter. Buttresses present. Twigs terete. Stipules dropped early (unknown). Petioles 10-16 mm long. Leaves ovate or elliptic, 6-14 cm long, 2.5-5.5 cm wide, thinly leathery, base wedge-shaped, apex acuminate, c. 8 mm long, margin revolute, secondary veins 8-13 pairs. Sepals ovate, petals unknown, stamens 15, ovary pear-shaped, style glabrous. Calyx lobes glabrescent, 3 longer one spatula-shaped, up to 7 cm long, c. 1.5 cm wide, 2 shorter ones up to 4.5 cm long, c. 0.7 cm wide, base tuberculate, nut narrowly ovoid, up to 2.2 cm long, pale buff pubescent. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 1100 m altitude. On hillsides and ridges. On fertile soils.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Dipterocarpaceae-Shorea%20confusa-AW44.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.1666667,2.066666667 ]
    },
    "properties": {
    "Species":"Shorea Ochracea Symington",
    "Kolektor":"Wahyudi, A.",
    "Description":"Small tree to 10 m tall, 10 cm diameter. Bark brownish; inner bark pale brown. Twigs rounded. Leaves unifoliolate, stalk 8-24 mm long, 1.5-2 mm thick, leaflet stalk 3-6 mm long, 1.5-3 mm thick; blades elliptic to oblong, 7.5-19.5 x 4-10 cm, adaxial surface glabrous, abaxial surface rusty-pubescent to velvety; base obtuse to rounded, margin slightly wavy and curved towards the abaxial surface, apex acuminate; lateral veins 6-9 pairs, abaxial surface prominent; intercostal veins net-like, prominent. Inflorescences 1-2 panicles together, erect to pendulous, compact to elongate, branched in comb-like way, many-flowered, 7-64 cm long, rusty-velvety. Flower stalk with proximal part 4-8 mm long, distal part 0.5-1 mm long; sepals reddish brown, obovate, 2.5-3 x 2-3 mm, apex rounded to retuse, rusty-puberulous on the abaxial surface, puberulous in fruit; petals scarlet, darker at apex, obovate to lanceolate, 6-8 x 1.5-2 mm, apex obtuse to rounded, 1.5-2.0-mm-long-clawed; filament in short-styled form c. 2.5 mm and 3.5 mm long, in long-styled form 1.5-2 mm and 2-2.5 mm long; ovary subglobose, rusty hairy, styles in short-styled form 0.5-1 mm long, in long-styled form 2-2.5 mm long. Fruits bright red, subglobose to oblong with rounded apex 8-15 x 6-15 mm. Seeds 1-2 per fruit, 5-7 x 3-4.5 mm, testa wrinkled (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In mixed dipterocarp forest on pale yellow infertile clay soils. Flowering and fruiting in April-October.",
    "Distribution":"Borneo. In Sarawak uncommon (Miri, Bintulu and Tatau).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Dipterocarpaceae-Shorea%20ochracea-AW141.jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.65,0.1 ]
    },
    "properties": {
    "Species":"Shorea Patoiensis P.S.Ashton",
    "Kolektor":"Sitepu, B.S.",
    "Description":"Trees up to 40 m tall, up to 90 cm diameter. Buttresses steep. Bark tawny brown, flaky, inner bark yellowish brown, sapwood pale yellow, heartwood brownish. Twigs slender, terete, glabrous. Stipule c. 8 mm long, oblong, glabrous but for the margin. Petioles 7-10 mm long. Leaves ovate, 5-8 cm long, 2-3.5 cm wide, parchment-like, frequently sickle-shaped, base broadly wedge-shaped, apex acuminate, c. 1 cm long, secondary veins 7-9 pairs. Calyx lobes very small, more or less circular, the inner two something thinner, petals linear, overlapping, forming a cup at base, stamens 15, ovary ovoid, style short, glabrous. Fruit calyx shorter than nut, lobes broadly ovate, 3-5 mm long, almost equal, more or less appressed to the base of the nut and united at the base forming a cup, c. 5 mm diameter. Nut oblong-ellipsoid, c. 15 mm long, striated, glabrescent, with a minute style remnant. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forest up to 1000 m altitude. On hillsides and ridges with sandy to clay soils, also often on limestone. Prefers fertile soils.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20patoiensis-BSS192%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8166667,1.133333333 ]
    },
    "properties": {
    "Species":"Shorea Pauciflora King",
    "Kolektor":"Sidiyasa, K.",
    "Description":"Trees up to 45 m tall, up to 1 m diameter. Bole straight, cylindrical. Buttresses small. Bark deeply fissured, dark grey, inner bark red. Twigs terete, glabrescent. Stipules hastate, up to 13 mm long, falling of early. Petioles 1.3-1.8 cm long. Leaves ovate, 9-15 by 4-5.5 cm, glabrous, thinly leathery, base broadly wedge-shaped, apex acuminate, up to 1.2 cm long, secondary veins 8 or 9 pairs, tertiary venation ladder-like. Calyx densely pale yellowish buff pubescent, petals oblong, stamens 15, ovary ovoid to conical, style glabrous. Fruits almost sessile, 3 longer calyx lobes up to 9 by c. 1.5 cm, spatula-shaped, 2 shorter lobes up to 5 by c. 0.5 cm, linear, base thickened, saccate. Nut broadly ovoid, c. 1.4 cm diameter. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 900 m altitude. Mostly on hillsides with clay to sandy soils. On deep soils on undulating land and hills.",
    "Distribution":"Peninsular Malaysia, Sumatra, Borneo.",
    "Manfaat":"A valuable, heavy red meranti.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20pauciflora-S3151%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 114.95,0.1 ]
    },
    "properties": {
    "Species":"Shorea Peltata Symington",
    "Kolektor":"Kessler, P.J.A",
    "Description":"Small tree. Panicles, petals outside and nut persistently densely buff puberulent, calyx outside caducously so, parts of petals exposed in bud puberulent; other parts glabrous. Twig c. 2 mm diameter apically, terete, smooth. Buds minute, ovoid, acute. Stipules unknown. Leaves 8-16 by 4-7.5 cm, oblong, chartaceous, prominently peltate; acumen to 1 cm long, cuspidate; nerves 8-9 pairs the first 3 of which arise from the petiole insertion, arched, slender but distinctly raised beneath, elevated above as also the subreticulatc tertiaries and terete midrib; petiole 1.8-3 cm long, slender. Panicle to 14 cm long, terminal or subterminal axillary, with to 1 cm long branchlets bearing to 5 secund flowers. Flower buds to 6 mm long, lanceolate; sepals ovate, acute, subequal; petals yelllow; stamens 15, in 3 unequal verticils; filaments broad at base, tapering and filiform beneath the broadly ellipsoid anthers; appendages c. 1? times length of anther, scabrous towards the apex, slender; ovary ovoid, sericeous distally, crowned by a glabrous columnar style equal in length. Fruit subsessile; calyx lobes to 8 by 5 mm, short, subequal, ovate, acute, incrassate, tuberculate; nut to 30 by 9 mm, fusiform, tapering, acute. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Locally common or even gregarious, on well-drained flat land or low hills in Mixed Dipterocarp forest.",
    "Distribution":"South East Malaya (North East Johore), E. Sumatra (Indragiri Uplands), West Borneo and East Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20peltata-PK2529%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.55294,0.59069 ]
    },
    "properties": {
    "Species":"Shorea Stenoptera Burck",
    "Kolektor":"Ningsih, M.K.",
    "Description":"Small tree. Twig apex, petiole and midrib above sometimes densely ocherous pubescent (immature tree?), more commonly glabrous; stipule outside occasionally sparsely pubescent. Twig 3-4 mm diameter apically, somewhat compressed to terete, becoming smooth; stipule scars pale, prominent, descending, amplexicaul. Bud Ahy 3 mm, ellipsoid, obtuse, usually obscured by stipules. Stipule to 2 by 1 cm, ovate, deltoid, obtuse, subauriculate at base, subpersistent. Leaves 18-40 by 8-22 cm, large, oblong, thickly coriaceous; base broadly cuneate to cordate; acumen to 2 cm long, ? prominent; nerves 10-14 pairs, stout, prominent, beneath, at 45?-60? along the midrib, to 110? near its base; tertiary nerves remotely scalariform; midrib evident but applanate above, prominent and terete beneath; petiole 2.3-4.5 cm long, stout. Panicle to 35 cm long, terminal or axillary, glabrous or (rarely) sparsely pubescent towards the base; borne behind the twig apices in the axils of fugaceous rudimentary leaves, a chain of short internodes being concealed in a dense profusion of the straight terete inflorescences with ascending branchlets; branchlets to 10 cm long; bracts and bracteoles to 6 by 4 mm, identical, ovate, acute, glabrous, not at first caducous. Flower bud to 7 by 3 mm. lanceolate. Sepals deltoid, acute, densely pubescent outside, sparsely so within; inner 2 smaller, relatively narrower than outer 3. Petals deep pink, lanceolate, sparsely pubescent on parts exposed in bud. Stamens 15, the inner 5 somewhat longer than the others and exceeding the style apex; filaments compressed, lorate, connate at margins along ? of their length, tapering abruptly below the ellipsoid anthers; appendage to connective slender, 3-4 x length of anther, sericeous towards the apex. Ovary narrowly ovoid, glabrous; style and stylopodium spindle-shaped, slender, glabrous. Fruit pedicel to 4 mm long and 0, prominent. Calyx glabrous; 3 longer lobes to 7.5 by 2 cm, spatulate, obtuse, to 1 cm broad above the to 2.5 by 2 cm ovate thickened saccate base; 2 shorter lobes to 5.5 by 0.8 cm, lorate-spatulate, obtuse, similar at base. Nut to 5 by 3 cm. ovoid, apiculate, large, densely shortly evenly buff pubescent. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Locally common in heath forest on poorly drained sandy soils and podzols at low altitudes.",
    "Distribution":"Western Borneo",
    "Manfaat":"The timber is used as red meranti. The illipe nuts are the largest known and S. stenoptera has been palnted deliberately for the fruits.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20stenoptera-M273%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.4836111,2.289444444 ]
    },
    "properties": {
    "Species":"Shorea Tenuiramulosa P.S.Ashton",
    "Kolektor":"Kessler",
    "Description":"Small to medium-sized tree. Panicles caducous greyish puberulent; bracts persistently so, parts of petals exposed in bud and ovary persistently densely so. Twig 1-2 mm diameter apically, terete, pale greyish brown, rugulose. Buds and stipules not seen. Leaves 9-24 by 4-11 cm, elliptic to lanceolate, thinly coriaceous drying pale greyish brown; margin undulate, somewhat revolute; base broadly cuneate to obtuse; apex shortly broadly acuminate; nerves 8-9(-11) pairs, arched, at 55?-60?. very slender but distinctly elevated beneath, slightly so above, as also the laxly reticulate tertiary nerves; midrib prominent on both surfaces; petioles 11-20 mm long, drying creambrown at the ends, otherwise blackish. Panicles to 18 cm long, terminal or to 3-axillary or ramifiorous, slender, many flowered; doubly branched, branchlets to 2 cm long; bracts to 2 mm long, elliptic, fugaceous. Flower buds to 5 by 2 mm. Sepals ovate-deltoid, incrassate, subacute, glabrous, subequal. Stamens 15, in 3 unequal verticils; filaments dilated at base, tapering and filiform distally; appendages slender, villous distally, c. 1? times as long as the narrowly ellipsoid anthers. Ovary ovoid, tapering into the somewhat shorter stout columnar style; style villous in the basal ?. Fruit pedicel to 2 by 2 mm; sepals to 6 by 5 mm, equal, ovate, subacuminate, thickened; nut to 25 by 8 mm, fusiform-lanceolate. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Locally frequent on dry rocky ultrabasic ridges near coast.",
    "Distribution":"North East Borneo & East Kalimantan",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Shorea%20tenuiramulosa-B901%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.2833333,1.016666667 ]
    },
    "properties": {
    "Species":"Sterculia Stipulata Korth.",
    "Kolektor":"Arbainsyah",
    "Description":"Tree to 15 m tall, to 20 cm diameter; buttresses absent. Bark smooth, lenticellate, pale to light brown; inner brown; inner bark dark brown to reddish. Sapwood pale red to whitish. Twigs 0.6-1 cm diameter, rouh, with dense rusty stellate hairs, becoming glabrous. Stipules persistent, lanceolate, large, 1.5-4.5 x 0.4-1.6 cm, sub-glabrous. Leaves spirally arranged, crowded at the apex of twigs, simple; blades papery, oblong-elliptic to obovate,(15-)20-50 x 9-16 cm, base gradually tapering, symmetric, triveined but faintly so, apex acute or acuminate; upper surface glabrous but often with stellate hairs on midrib, lower surface sub-glabrous to stellate hairy; lateral veins (excluding basal ones) 13-20 pairs; petioles to 1 cm long (or leaf almost sessile), sub-glabrous or with dense hairs.Inflorescences sub-terminal, racemose to paniculate,10-50 cm long, hanging, often much-brandched, with sparse to dense stellate hairs. Flowers unisexual, pink-red; calyx tubular to deeply campanulate, to 12 mm long, outer surface with sparse to dense stellate hairs, inner surface glabrous, 5-lobed, lobes triangular or lanceolate, 6-10 mm long, margin with dense to sparse hairs, diverging or converging, joined at apex or not. Male flowers: androgynophore 1.5-2.5 mm long; anthers 10, forming a globose head at apex of androgynophore. Female flowers: androgynophore 1-2 mm long, glabrous; carpels 5, with dense stellate hairs, styles coherent, hairy, stigma curved. Fruit a cluster of 3-5 red woody follicles; follicles oblong, 6-14 cm long,  2-3 cm wide, with dense stellate hairs. Seeds 10 in each follicle, ellipsoid 1.2-1.5 cm long, 0.5-0.8 cm diameter, brown-black (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Primary lowland forest below 1400 m altitude. Usually along streams on sandstone.",
    "Distribution":"Endemic to Borneo. In Sabah widespread; known from Beaufort, Keniangau, Kinabatangan, Kota Belud, Kota Kinabalu,Kota Marudu, Kudat, Labuk Sungut, Lahad Datu, Pensiangan, Ranau, Sandakan, Semporna, Sipitang, Tambunan, Tawau and Tenom districts.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Malvaceae-Sterculia%20stipulata-AA3213%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8333333,1.133333333 ]
    },
    "properties": {
    "Species":"Sandorium Borneense Miq",
    "Kolektor":"Sidiyisa, K",
    "Description":"Tree, 7-20 m tall; bole to 15 m tall and 20-40(-60) cm diameter, unbuttresses. Bark smooth, pale brown, with small lenticels; inner bark light brown or pinkish. Sapwood white. Twigs 3-4(-5) mm diameter apically, smooth, often pale when dry. Indumentum restricted to innovations. Leaves 22-38 cm long, red when young; petioles 4-10 cm long, terete to somewhat flattened adaxially near base; leaflets glabrous; blades elliptical to lanceolate-ovate, 8-22x3.5-8.5 cm, apical leaflet not conspicuously larger than lateral ones, base obtuse to rounded, those of lateral leaflets often markedly asymmetrical, apex acuminate; lateral veins 9-12 on each side of midrib, arising almost at right angles from midrib, very weakly arcuate and looped at margin; petiolules 3-5(-10) mm long on lateral leaflets, 20-45 mm on apical leaflets. Inflorescences 10-16 cm long, more or less erect, narrow; primary branches to 6 cm long, subsquarrose to weakly ascending, the secondaries c. 1.5 cm long, bearing cymules of 1-5 flowers; bracts narrowly triangular, c. 8 mm long, to foliaceous, when lanceolate to oblanceolate, c. 2 cm long and petiole, caducous. Flowers fragrant ; bracteoles narrowly triangular, c. 4 mm long, caducous; pedicels 3-7 mm long, glabrous to subpuberlous; calyx shallowly cup-shaped, 1.5-2 mm tall, more or less puberlous, pale green, splitting irregularly into 5 obtuse lobes c. 0.5 mm deep; petals 5, linear-oblong, 6-8 mm long, glabrous, creamy-green to pinkish, apex acute; staminal tube creamy-green to pinkish, glabrous and with c. 20 ribs outside, villous inside, margin 10-lobed, each lobe more or less bifid, anthers c. 0.5 mm long in two ranks, alternating with the lobes, apiculate, weakly exserted; disc c. 2 mm tall, glabrous, margin 5-lobed, the lobes more or less bifid; ovary and style glabrous, stigmatic lobes c. 1 mm long. Fruits subglobose to pyriform, 2.5-4 cm diameter, velutinous, buff-yellow to orangeish, obscurely longitudinally ribbed, usually solitary; pericarp with milky latex; mesocarp sweet but mealy; endocarp tough; pyrenes 2-5. Seeds c. 14x9 mm (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Riverbanks, subject to inundation, from 330 m down to just above tidal influence. The fruits fall into the water and are devoured by fish, which appear to spit out the pyrenes: whether or not such leads to effective dispersal is unrecorded",
    "Distribution":"Endemic in Borneo. Known in Sabah from Beaufort, Kota Belud, Papar, Sandakan, Sipitang and Tawau districts (e.g., SAN 27996, SAN 72288  and SAN 78172) and in Sarawak from Bau, Belaga, Bintulu, Kapit, Kuching, Lubok Antu, Lundu, Marudi, Miri and Tatau districts (e.g., S 19929, S 29970, S 39662, S 45140 and S 50094). Also occuring in Brunei (e.g., BRUN 152 and SAN 17051) and Kalimantan (e.g., Veldkamp 8377)",
    "Manfaat":"In Sarawak, the wood is used for making sape, an Iban musical instrument",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Meliaceae-Sandoricum%20borneense-S2852%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 114.8666667,0.066666667 ]
    },
    "properties": {
    "Species":"Syzygium Myrtilloides Merr. & L.M.Perry",
    "Kolektor":"Kessler",
    "Description":"Small tree or shrub. Young parts glabrous. Twigs c. 1 mm diameter aplically,slender, at first 4-ribbed but soon become round in cross-section, flaky or smooth, grey-brown. Leaves thinly leathery, with scattered pimples above and brown dots beneath, drying dull grey-brown above, tawny beneath; blades elliptic to sometimes obovate, 4.5-8 x 2-4.5 cm, base wedge-shaped tapering into petioloe, margin entire, narrowly recurved, apex caudate, acumen c. 6 mm long; lateral veins subequal, c. 50 pairs, evident beneath otherwise obscure, hardly raised, spreading; intercostal venation more or less obscure; intramarginal vein 1, close to margin, hardly looped; petioles slender, c. 6 m long. Inflorescences paniculate, c. 4 cm long; rachis c. 1 mm diameter at base, very slender, 2x-branched; bracteoles linear, c. 2 mm long caducous. Flowers: buds shortly clove-shaped, c. 6 mm long, c. 3 mm diameter, with a 3 mm slender tapering pseudostalk; calyx lobes 4, ovate, subacute, thick to margin, clasping corolla; stamens many, at antheis exserted to 3 mm long, anther locules parallel; ovary at the distal end of flower bud. Fruits spherical, c. 15 mm diameter, with small apical calyx rim (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"In ridge forest at 1000-1500 m altitude on Mt. Kinabalu, sometimes over ultramafic rock.",
    "Distribution":"Endemic to Borneo; very rare, known with certainty only from Mt. Kinabalu",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Myrtaceae-Syzygium%20myrtilloides-PK2668%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.4666667,2.15 ]
    },
    "properties": {
    "Species":"Sarcotheca Rubrinervis Hallier F.",
    "Kolektor":"Kessler",
    "Description":"Small to medium-sized tree to 20 m tall, 30 cm diamter; no buttresses. Bark smooth, thin, reddish to reddish brown; inner bark yellow or yellowish brown, sometimes with a pink tinge, fibrous. Sapwood white or pale yellow. Twigs rounded. Leaves unifoliolate, stalk 6-20 mm long, 1.5-2 mm thick, leaflet stalk 2-4 mm long, 1.5-2 mm thick; blades oblong to lanceolate, 6.5-15 x 2-6 cm, glabrou, abaxial surface not or sometimes slightly glaucous; base obtuse to rounded, apex acute to acuminate; lateral veins 4-11 pairs, often with reddish tinge, more or less looping and joining near margin; intercostal veins irregular, the more prominent ones running from vein to vein or from vein to midrib, fainter ones net-like. Inflorescences 1-2 panicles together, elongate, lax, pendulous, 6-36 cm long, rusty puberulous. Flower stalk with proximal part 3-5 mm long, distal part up to 1 mm long; sepals ovate to lanceolate, 1.5-2.5 x 1-1.5 mm, apex acute to emarginate, minutely rusty hairy at base, puberulous in fruit; petals red or rarely white, lanceolate, twice as long as sepals, apex rounded to emarginate, 0.5-1 mm-long-clawed; filament in short-styled form 1.5-2 mm and 2.5-3 mm long, in long-styled form 0.5-1 mm and 1-1.5 mm long; ovary subglobose, densely hairy, styles in short-styled form c. 0.5 mm long, in long-styled form 1.5-2 mm long. Fruits pink to bright red, subglobose, 6-10 x 5-10 mm, glaucous to glossy. Seeds to 6.5 x 5 mm, testa smooth to more or less wrinkled (Tree Flora of Sabah and Sarawak).",
    "Habitus":"Tree",
    "Ecology":"Primary and secondary forests near rivers on loamy soils of flat to undulating lands. Flowering and fruiting in March-December.",
    "Distribution":"Borneo (Sabah and Kalimantan). In Sabah only known from Tawau.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Oxalidaceae-Sarcotheca%20rubinervis-B1574%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8333333,1 ]
    },
    "properties": {
    "Species":"Scaphium Macropodum (Miq). Beumee ex Heyne",
    "Kolektor":"Sidiyasa, K",
    "Description":"Upper canopy tree up to 41 m tall and 87 cm dbh. Leaves alternate, simple, tripli-veined, usually glabrous, leaf base sometimes cordate. Young trees with palmately-lobed leaves, number of leaf lobes is reduced when tree ages (adult trees with unlobed leaves). Flowers ca. 5 mm diameter, white-yellow, placed in panicles. Fruits ca. 207 mm long, green-yellow-brown, winged nuts (nut ca. 22 mm long), wings boat-shaped.",
    "Habitus":"Tree",
    "Ecology":"Prosea 5",
    "Distribution":"Cambodia, Thailand, Peninsular Malaysia, Sumatra and Borneo (throughout the island).",
    "Manfaat":"Secondary and primary forests",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Malvaceae-Scaphium%20macropodum-S3221%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 115.55,0.166666667 ]
    },
    "properties": {
    "Species":"Schima Wallichii (DC.) Korth.",
    "Kolektor":"Priyono",
    "Description":"Trees up to 45 m tall, up to 1.25 cm in diameter. Buttresses, if present, steep, up to 1.8 m tall. Bark dark grey, scaly or cracked in small thick pieces. Inner bark red, with dark spots, the fibre ends appearing as golden silky hairs, more or less irritating. Sapwood white. Leaves spiral, oblong to broadly elliptic, 6-13 cm long, 3-5 cm wide, base wedge-shaped, apex acute to acuminate, margin more or less toothed, secondary veins 6-8 pairs. Petioles c. 3 m long. Flowers axillary, but crowded at the end of the twigs, 17-35 mm in diameter, pedicel c. 2.5 cm long, bracteoles 2, sepals 5, petals 5, shortly connate at the base, obovate, white, up to 2 cm long, stamens numerous, ovary 5-celled, style simple. Fruit a woody capsule, almost globose, 2-3 cm in diameter, silky, opening by 5 valves. Seeds winged around.",
    "Habitus":"Tree",
    "Ecology":"Secondary Forest Trees of Kalimantan, Indonesia",
    "Distribution":"Burma, South China, Thailand, Malay Peninsula, West Java, Philippines (Palawan); Borneo.",
    "Manfaat":"Primary and especially secondary forest, on well-drained land, locally common, from sea-level up to 3000 m altitude.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Theaceae-Schima%20wallichii-BSS140%20(Small).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8333333,1.133333333 ]
    },
    "properties": {
    "Species":"Vatica Pauciflora (Korth.) Blume",
    "Kolektor":"Sidiyasa, K.",
    "Description":"Trees up to 30 m tall, up to 45 cm diameter. Twigs terete, glabrescent, not scabrid. Stipules up to 8 mm long, linear, becoming reflexed. Petioles 10-18 mm long. Leaves elliptic lanceolate, 6.5-20 cm long, 2.2-8 cm wide, thinly leathery, base wedge-shaped, apex acuminate, up to 1.5 cm long, secondary veins 5-7 pairs. Panicle up to 9 cm long, calyx lobes up to 5 mm diameter, hemispherical, more or less fused with the impressed base of the nut. Nut ovoid, c. 3 cm long, almost acute, with 3 distinct furrows, pericarp thick, corky, warty. (Trees of the Balikpapan-Samarinda Area, East Kalimantan, Indonesia)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp forests up to 100 m altitude. Found in fresh water swamps, on banks along rivers and along rivers. In secondary forests usually present as a pre-disturbance remnant tree.",
    "Distribution":"Thailand, Peninsular Malaysia, Sumatra, new record for East-Kalimantan, only found in the Sungai Wain area",
    "Manfaat":"The timber is used.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Vatica%20pauciflora-S3134%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.1333333,2.033333333 ]
    },
    "properties": {
    "Species":"Vatica Nitens King",
    "Kolektor":"Wahyudi, A",
    "Description":"A medium-sized to large tree, up to 40 m tall with straight, cylindrical bole up to 70 cm diameter and small buttresses. Young vegetative parts densely powdery fulvous tomentose, fugaceous on leaf, subpersistent only on panicle, leaf bud and stipule. Twig to 2 mm apically, becoming smooth, glabrous. Bud to 3 by 3.5 mm, ovoid, acute. Stipule to 20 by 3.5 mm, narrowly oblong, subacute, caducous. Leaves 10-17 by 3.5-5.5 cm, coriaceous, narrowly oblong; base obtuse or cuneate; acumen to 1 cm long; nerves 12-22 pairs, raised beneath, curved, at 45?-70?, with short second ary nerves; midrib obtuse, raised beneath, applanate or slightly raised above; petiole 1-2 cm long, slightly geniculate. Panicle to 1 1 cm long, terminal, occasionally axillary, densely persistently fulvous tomentose, terete or angular; singly, rarely doubly, branched; bracteoles fugaceous. Flower bud to 7 by 3 mm, fusiform; calyx densely pubescent on both surfaces, lobes narrowly deltoid, acute; appendage to connective short, stout; style very short, not exceeding anthers; flowers otherwise typical. Fruit pedicel 3-5 mm long, calyx fulvous powdery tomentose, glabrescent, base impressed; 2 longer lobes to 13 by 2 cm, free to base, oblong, slightly recurved, hastate, acute; base to 7 mm broad, ? revolute. Nut to 3 cm diameter, globose, shortly densely persistently pale fulvous tomentose. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Occurs scattered in mixed dipterocarp forest on low hills and ridges up to 600 m altitude.",
    "Distribution":"Peninsular Malaysia, East Kalimantan and northern Borneo (Sarawak, Brunei, Sabah).",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Vatica%20nitens-AW92%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 117.15,2.533333333 ]
    },
    "properties": {
    "Species":"Vatica Oblongifolia Hook.F.",
    "Kolektor":"Wahyudi, A",
    "Description":"Mid-canopy tree up to 38 m tall and 93 cm diameter. Stem with resin. Stipules ca. 45 mm long. Leaves alternate, simple, penni-veined, petiole usually densely short red-brown hairy. Flowers ca. 22 mm diameter, white-yellow, placed in panicles. Fruits ca. 16 mm long, yellow-brown, without wings, filled with sticky resin. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"In undisturbed mixed dipterocarp, keranga and peat swamp forests up to 700 m altitude. Usually on alluvial sites with clay to sandy soils, but also found on ridges and near beaches. In secondary forests usually present as a pre-disturbance remnant tree.",
    "Distribution":"Borneo (Sarawak, Brunei, Sabah, Central-, South- and East-Kalimantan).",
    "Manfaat":"The timber is used.",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Vatica%20oblongifolia-AW16%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 116.8333333,1.133333333 ]
    },
    "properties": {
    "Species":"Vatica Parvifolia P.S.Ashton",
    "Kolektor":"Sidiyasa, K",
    "Description":"Young twig, panicle, leaf bud. and petiole densely ferrugineous powdery tomentose, stipule sparsely so. Twig to 1 mm diameter apically, much branched, becoming glabrous, smooth. Bud to 3 by 1.5 mm, ovoid, subacute. Stipules to 5 by 1 mm, linear, caducous. Leaves 2.8-6 by 1-2.3 cm, coriaceous, narrowly ovate to lanceolate; base obtuse; acumen to 1 cm long, caudate; nerves c. 8 pairs, indistinct, unraised, strongly curved, at 60?-75?; midrib slender, prominent beneath, applanate above; petiole 6-9 mm long. Panicle to 2 cm long, terminal or axillary, terete, singly branched. Flower bud to 6 mm long, small; calyx grey-brown pubescent; flowers otherwise typical. Fruit pedicel to 3 mm long, slender. Fruit calyx glabrescent but for the persistently puberulent base, lobes free to the pedicel; longer lobes to 6 by 0.7 cm, subequal, oblong, narrowly obtuse, revolute above the abruptly constricted base; 3 shorter lobes to 10 by 7 cm, subequal, broadly ovate, acute, cordate at base, prominently revolute. Nut to 5 by 3.5 mm, broadly ovoid, obtuse, shortly fulvous pubescent. (Flora Malesiana)",
    "Habitus":"Tree",
    "Ecology":"Rare. Heath forest below 600 m.",
    "Distribution":"Endemic in Borneo",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Diptero-Vatica%20parvifolia-S4111%20(Large).jpg"
    }
  },
  {
    "type": "Feature",
    "geometry": {
       "type": "Point",
       "coordinates":  [ 114.8666667,0.066666667 ]
    },
    "properties": {
    "Species":"Vitex Vestita Wall. in DC.",
    "Kolektor":"Kessler",
    "Description":"Trees up to 15 m tall, up to 40 cm in diameter. Leaves 3-foliolate. Leaflets distinctly stalked, ovate or elliptic, 6-15 cm long, 3-7.5 cm wide, base wedge-shaped to tapering; apex acuminate; margin entire; secondary veins 5-10 pairs; lower leaflet surface densely tomentose.Inflorescences axillary.Flowers yellow. Fruits c. 10 mm in diameter, black (Secondary Forest Trees of Kalimantan, Indonesia).",
    "Habitus":"Tree",
    "Ecology":"Lowland primary and secondary forests.",
    "Distribution":"Indo-Malesia; Borneo: Sabah, Brunei, Sarawak, Central and East Kalimantan.",
    "Manfaat":"",
    "Image":"http://herbarium-wanariset.or.id/uploads/images/Lamiaceae-Vitex%20vestita-PK2468%20(Large).jpg"
    }
  }
]
}